* Encoding: Big5.
DATA LIST FILE="C:\Users\Stella\Dropbox\PC\Desktop\EX2397C2\EX2397C2\Dat\EX2397C2.DAT " /
ID 1-6 NAME 7-16(A) TEL_A 17-21 TEL 22-29  TEL_NAME 30-35(A) 
DATE 36-41 BTIME 42-47 ETIME 48-53 RESULT 54-56 
CALLER 57-66 GENDER 67 LEVEL 68-69 HOURS 70-76 VERSION 77-78 
HOME_A 79-80 HOME_M 81-82 HOME_O 83-84 SAMPLE 85
DATE_1 86-91 BTIME_1 92-97 ETIME_1 98-103 RESULT_1 104-106
DATE_2 107-112 BTIME_2 113-118 ETIME_2 119-124 RESULT_2 125-127
DATE_3 128-133 BTIME_3 134-139 ETIME_3 140-145 RESULT_3 146-148
DATE_4 149-154 BTIME_4 155-160 ETIME_4 161-166 RESULT_4 167-169
DATE_5 170-175 BTIME_5 176-181 ETIME_5 182-187 RESULT_5 188-190
DATE_6 191-196 BTIME_6 197-202 ETIME_6 203-208 RESULT_6 209-211
DATE_7 212-217 BTIME_7 218-223 ETIME_7 224-229 RESULT_7 230-232                                  
Q1 250-251 Q2 252-253 Q3 254-255 Q4 256-257 Q5 258-259 Q6 260-261 
Q7 262-263 Q8 264-265 Q9 266-267 Q10 268-269 Q11 270-271 Q12 272-273 
Q13 274-275 Q14 276-277 Q15 278-279 Q16 280-281 Q17 282-283 Q18 284-285 
Q19 286-287 Q20 288-289 Q21 290-291 Q22 292-293 Q23 294-295 Q24 296-297 
Q25 298-300 Q26 301-303 Q27 304-306 Q28 307-309 Q29 310-312 Q30 313-315 
Q31 316-318 Q32 319-321 Q33 322-324 Q34 325-327 Q35 328-330 Q36 331-333 
Q37 334-335 Q38 336-337 Q39_1 338-339 Q39_2 340-341 Q39_3 342-343 Q39_4 344-345 
Q39_5 346-347 Q40 348-349 Q41 350-351 Q42 352-353 Q43 354-355 Q44 356-357 
Q45 358-359 Q46 360-361 Q47 362-363 Q48 364-365 Q49 366-367 Q50 368-369 
Q51 370-371 Q52 372-373 Q53 374-375 Q54 376-377 Q55 378-379 Q56 380-381 
Q57 382-383 Q58 384-385 Q59 386-387 Q60 388-389 Q61 390-391 Q62 392-393 
Q63 394-395 Q64 396-397 Q65 398-399 Q66 400-401 Q67 402-403 Q68 404-405 
Q69 406-407 Q70 408-409 Q71 410-411 Q72 412-413 Q73 414-415 Q74 416-417 
Q75 418-419 Q76 420-421 Q77 422-423 Q78 424-425 Q79 426-427 Q80 428-429 
Q81 430-431 Q82 432-433 Q83 434-435 Q84 436-437 Q85 438-439 Q86 440-441 
Q87 442-443 Q88 444-445 Q89 446-447 Q90 448-449 Q91 450-451 Q92 452-453 
Q93 454-455 Q94 456-457 Q95 458-459 Q96 460-461 Q97 462-463 Q98 464-465 
Q99 466-467 Q100 468-469 Q101 470-471 Q102 472-473 Q103 474-475 Q104 476-477 
Q105 478-479 Q106 480-481 Q107 482-483 Q108 484-485 Q109 486-487 Q110 488-489 
Q111 490-491 Q112 492-493 Q113 494-495 Q114 496-497 Q115 498-499 Q116 500-501 
Q117 502-503 Q118 504-505 Q119 506-507 Q120 508-509 Q121 510-511 Q122 512-513 
Q123 514-515 Q124 516-517 Q125 518-519 Q126 520-521 Q127 522-523 Q128 524-525 
Q129 526-527 Q130 528-529 Q131 530-531 Q132 532-533 Q133 534-535 Q134 536-537 
Q135 538-539 Q136 540-541 Q137 542-543 Q138 544-545 Q139 546-547 Q140 548-549 
Q141 550-551 Q142 552-553 Q143 554-555 Q144 556-557 Q145 558-559 Q146 560-561 
Q147 562-563 Q148 564-565 Q149 566-567 Q150 568-569 Q151 570-571 Q152 572-573 
Q153 574-575 Q154 576-577 Q155 578-579 Q156 580-581 Q157 582-583 Q158 584-585 
Q159 586-587 Q160 588-589 Q161 590-591 Q162 592-593 Q163 594-595 Q164 596-597 
Q165 598-599 Q166 600-601 Q167 602-603 Q168 604-605 Q169 606-607 Q170 608-609 
Q171 610-611 Q172 612-613 Q173 614-615 Q174 616-617 Q175 618-619 Q176 620-621 
Q177 622-623 Q178 624-625 Q179 626-627 Q180 628-629 Q181 630-631 Q182 632-633 
Q183 634-635 Q184 636-637 Q185 638-639 Q186 640-641 Q187 642-643 Q188 644-645 
Q189 646-647 Q190 648-649 Q191 650-651 Q192 652-653 Q193 654-655 Q194 656-657 
Q195 658-659 Q196 660-661 Q197 662-663 Q198 664-665 Q199 666-667 Q200 668-669 
Q201 670-671 Q202 672-673 Q203 674-675 Q204 676-677 Q205 678-679 Q206 680-681 
Q207 682-683 Q208 684-685 Q209 686-687 Q210 688-689 Q211 690-691 Q212 692-693 
Q213 694-695 Q214 696-697 Q215 698-699 Q216 700-701 Q217 702-703 Q218 704-705 
Q219 706-707 Q220 708-709 Q221 710-711 Q222 712-713 Q223 714-715 Q224 716-717 
Q225 718-719 Q226 720-721 Q227 722-723 Q228 724-726 Q229 727-729 Q230 730-732 
Q231 733-734 Q232 735-736  .
 
VARIABLE LABELS
ID "樣本編號"
NAME "受訪者姓名"
TEL_A "電話區碼"
TEL "電話號碼"
TEL_NAME "電話套數"
DATE "訪問日期"
BTIME "開始時間"
ETIME "結束時間"
RESULT "訪問結果"
CALLER "訪員編號"
GENDER "訪員性別"
LEVEL  "訪員級數"
HOURS  "累計時數"
VERSION "版本"
HOME_A "戶中全部合格人數"
HOME_M "戶中合格男性人數"
HOME_O "戶中排行"
SAMPLE "受訪樣本"
DATE_1 "訪問日期_1"
BTIME_1 "開始時間_1"
ETIME_1 "結束時間_1"
RESULT_1 "訪問結果_1"
DATE_2 "訪問日期_2"
BTIME_2 "開始時間_2"
ETIME_2 "結束時間_2"
RESULT_2 "訪問結果_2"
DATE_3 "訪問日期_3"
BTIME_3 "開始時間_3"
ETIME_3 "結束時間_3"
RESULT_3 "訪問結果_3"
DATE_4 "訪問日期_4"
BTIME_4 "開始時間_4"
ETIME_4 "結束時間_4"
RESULT_4 "訪問結果_4"
DATE_5 "訪問日期_5"
BTIME_5 "開始時間_5"
ETIME_5 "結束時間_5"
RESULT_5 "訪問結果_5"
DATE_6 "訪問日期_6"
BTIME_6 "開始時間_6"
ETIME_6 "結束時間_6"
RESULT_6 "訪問結果_6"
DATE_7 "訪問日期_7"
BTIME_7 "開始時間_7"
ETIME_7 "結束時間_7"
RESULT_7 "訪問結果_7"
Q1 "首先，我們想請問您(市話樣本)您是否有使用手機?(手機樣本)您住的地方是否有家用電話?"
Q2 "首先，您的戶籍是設在那一個縣市?"
Q3 "請問在宜蘭縣那一個鄉鎮市?"
Q4 "請問在新竹縣那一個鄉鎮市?"
Q5 "請問在苗栗縣那一個鄉鎮市?"
Q6 "請問在彰化縣那一個鄉鎮市?"
Q7 "請問在南投縣那一個鄉鎮市?"
Q8 "請問在雲林縣那一個鄉鎮市?"
Q9 "請問在嘉義縣那一個鄉鎮市?"
Q10 "請問在屏東縣那一個鄉鎮市?"
Q11 "請問在台東縣那一個鄉鎮市?"
Q12 "請問在花蓮縣那一個鄉鎮市?"
Q13 "請問在澎湖縣那一個鄉鎮市?"
Q14 "請問在基隆市那一個區?"
Q15 "請問在新竹市那一個區?"
Q16 "請問在嘉義市那一個區?"
Q17 "請問在台北市那一個區?"
Q18 "請問在高雄市那一個區?"
Q19 "請問在新北市那一區?"
Q20 "請問在台中市那一個區?"
Q21 "請問在台南市那一個區?"
Q22 "請問在桃園市那一個區?"
Q23 "請問在金門縣那一個鄉鎮市?"
Q24 "請問在連江縣那一個鄉鎮市?"
Q25 "在松山區哪一里?"
Q26 "在中正區哪一里?"
Q27 "在士林區哪一里?"
Q28 "在苓雅區哪一里?"
Q29 "在板橋區哪一里?"
Q30 "在三重區哪一里?"
Q31 "在中和區哪一里?"
Q32 "在新莊區哪一里?"
Q33 "在竹北市哪一里?"
Q34 "在東區哪一里?"
Q35 "在桃園區哪一里?"
Q36 "在中壢區哪一里?"
Q37 "請問您平常最常看哪一台的電視新聞?"
Q38 "請問您有沒有在使用即時通訊軟體與社群媒體?"
Q39_1 "請問您有在使用哪些即時通訊軟體與社群媒體?(可複選)"
Q39_2 "請問您有在使用哪些即時通訊軟體與社群媒體?(可複選)"
Q39_3 "請問您有在使用哪些即時通訊軟體與社群媒體?(可複選)"
Q39_4 "請問您有在使用哪些即時通訊軟體與社群媒體?(可複選)"
Q39_5 "請問您有在使用哪些即時通訊軟體與社群媒體?(可複選)"
Q40 "請問您對這次(2024年1月13日)的總統與立委選舉注不注意?"
Q41 "整體來說，請問您對蔡英文總統這七年多的施政表現滿意不滿意?"
Q42 "請問您對蔡英文總統這七年多來處理兩岸關係的表現滿意不滿意?"
Q43 "請問您覺得台灣現在的經濟狀況與一年前相比，是比較好、還是比較不好，或是差不多?"
Q44 "請問您覺得台灣在未來的一年經濟狀況會變好、還是變不好，或是差不多?"
Q45 "請問您覺得您家裡現在的經濟狀況與一年前相比，是比較好、還是比較不好，或是差不多?"
Q46 "請問您覺得您家裡在未來的一年經濟狀況會變好、還是變不好、還是變不好，或是差不多?"    
Q47 "我們社會上有些人認為中共會攻打台灣，有些人認為不會。如果以0代表中共絕對不會攻打台灣，10代表中共一定會攻打台灣，那麼0到10之間，您認為中共攻打台灣的機會有多大?"
Q48 "請問過去四年中，您有沒有因為中國大陸的軍機、軍艦頻繁繞台而感到生氣?"
Q49 "整體來說，請問您認為這一屆立法院(2020年選出來的)，哪一黨的立委表現的比較好"
Q50 "請問，下列兩種說法，您比較同意哪一個?"
Q51 "請問，您對您選區現任立委這三年多來的表現滿意不滿意?"
Q52 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(宜蘭縣)"
Q53 "您覺得哪一位候選人比較可能會當選?(宜蘭縣)"
Q54 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新竹縣第1選區)"
Q55 "您覺得哪一位候選人比較可能會當選?(新竹縣第1選區)"
Q56 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新竹縣第2選區)"
Q57 "您覺得哪一位候選人比較可能會當選?(新竹縣第2選區)"
Q58 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(苗栗縣第1選區)"
Q59 "您覺得哪一位候選人比較可能會當選?(苗栗縣第1選區)"
Q60 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(苗栗縣第2選區)"
Q61 "您覺得哪一位候選人比較可能會當選?(苗栗縣第2選區)"
Q62 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(彰化縣第1選區)"
Q63 "您覺得哪一位候選人比較可能會當選?(彰化縣第1選區)"
Q64 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(彰化縣第2選區)"
Q65 "您覺得哪一位候選人比較可能會當選?(彰化縣第2選區)"
Q66 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(彰化縣第3選區)"
Q67 "您覺得哪一位候選人比較可能會當選?(彰化縣第3選區)"
Q68 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(彰化縣第4選區)"
Q69 "您覺得哪一位候選人比較可能會當選?(彰化縣第4選區)"
Q70 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(南投縣第1選區)"
Q71 "您覺得哪一位候選人比較可能會當選?(南投縣第1選區)"
Q72 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(南投縣第2選區)"
Q73 "您覺得哪一位候選人比較可能會當選?(南投縣第2選區)"
Q74 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(雲林縣第1選區)"
Q75 "您覺得哪一位候選人比較可能會當選?(雲林縣第1選區)"
Q76 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(雲林縣第2選區)"
Q77 "您覺得哪一位候選人比較可能會當選?(雲林縣第2選區)"
Q78 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(嘉義縣第1選區)"
Q79 "您覺得哪一位候選人比較可能會當選?(嘉義縣第1選區)"
Q80 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(嘉義縣第2選區)"
Q81 "您覺得哪一位候選人比較可能會當選?(嘉義縣第2選區)"
Q82 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(屏東縣第1選區)"
Q83 "您覺得哪一位候選人比較可能會當選?(屏東縣第1選區)"
Q84 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(屏東縣第2選區)"
Q85 "您覺得哪一位候選人比較可能會當選?(屏東縣第2選區)"
Q86 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台東縣)"
Q87 "您覺得哪一位候選人比較可能會當選?(台東縣)"
Q88 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(花蓮縣)"
Q89 "您覺得哪一位候選人比較可能會當選?(花蓮縣)"
Q90 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(澎湖縣)"
Q91 "您覺得哪一位候選人比較可能會當選?(澎湖縣)"
Q92 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(基隆市)"
Q93 "您覺得哪一位候選人比較可能會當選?(基隆市)"
Q94 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新竹市)"
Q95 "您覺得哪一位候選人比較可能會當選?(新竹市)"
Q96 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(嘉義市)"
Q97 "您覺得哪一位候選人比較可能會當選?(嘉義市)"
Q98 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(金門縣)"
Q99 "您覺得哪一位候選人比較可能會當選?(金門縣)"
Q100 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(連江縣)"
Q101 "您覺得哪一位候選人比較可能會當選?(連江縣)"
Q102 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第1選區)"
Q103 "您覺得哪一位候選人比較可能會當選?(台北市第1選區)"
Q104 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第2選區)"
Q105 "您覺得哪一位候選人比較可能會當選?(台北市第2選區)"
Q106 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第3選區)"
Q107 "您覺得哪一位候選人比較可能會當選?(台北市第3選區)"
Q108 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第4選區)"
Q109 "您覺得哪一位候選人比較可能會當選?(台北市第4選區)"
Q110 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第5選區)"
Q111 "您覺得哪一位候選人比較可能會當選?(台北市第5選區)"
Q112 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第6選區)"
Q113 "您覺得哪一位候選人比較可能會當選?(台北市第6選區)"
Q114 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第7選區)"
Q115 "您覺得哪一位候選人比較可能會當選?(台北市第7選區)"
Q116 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台北市第8選區)"
Q117 "您覺得哪一位候選人比較可能會當選?(台北市第8選區)"
Q118 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第1選區)"
Q119 "您覺得哪一位候選人比較可能會當選?(高雄市第1選區)"
Q120 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第2選區)"
Q121 "您覺得哪一位候選人比較可能會當選?(高雄市第2選區)"
Q122 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第3選區)"
Q123 "您覺得哪一位候選人比較可能會當選?(高雄市第3選區)"
Q124 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第4選區)"
Q125 "您覺得哪一位候選人比較可能會當選?(高雄市第4選區)"
Q126 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第5選區)"
Q127 "您覺得哪一位候選人比較可能會當選?(高雄市第5選區)"
Q128 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第6選區)"
Q129 "您覺得哪一位候選人比較可能會當選?(高雄市第6選區)"
Q130 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第7選區)"
Q131 "您覺得哪一位候選人比較可能會當選?(高雄市第7選區)"
Q132 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(高雄市第8選區)"
Q133 "您覺得哪一位候選人比較可能會當選?(高雄市第8選區)"
Q134 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第1選區)"
Q135 "您覺得哪一位候選人比較可能會當選?(新北市第1選區)"
Q136 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第2選區)"
Q137 "您覺得哪一位候選人比較可能會當選?(新北市第2選區)"
Q138 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第3選區)"
Q139 "您覺得哪一位候選人比較可能會當選?(新北市第3選區)"
Q140 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第4選區)"
Q141 "您覺得哪一位候選人比較可能會當選?(新北市第4選區)"
Q142 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第5選區)"
Q143 "您覺得哪一位候選人比較可能會當選?(新北市第5選區)"
Q144 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第6選區)"
Q145 "您覺得哪一位候選人比較可能會當選?(新北市第6選區)"
Q146 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第7選區)"
Q147 "您覺得哪一位候選人比較可能會當選?(新北市第7選區)"
Q148 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第8選區)"
Q149 "您覺得哪一位候選人比較可能會當選?(新北市第8選區)"
Q150 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第9選區)"
Q151 "您覺得哪一位候選人比較可能會當選?(新北市第9選區)"
Q152 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第10選區)"
Q153 "您覺得哪一位候選人比較可能會當選?(新北市第10選區)"
Q154 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第11選區)"
Q155 "您覺得哪一位候選人比較可能會當選?(新北市第11選區)"
Q156 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(新北市第12選區)"
Q157 "您覺得哪一位候選人比較可能會當選?(新北市第12選區)"
Q158 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第1選區)"
Q159 "您覺得哪一位候選人比較可能會當選?(台中市第1選區)"
Q160 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第2選區)"
Q161 "您覺得哪一位候選人比較可能會當選?(台中市第2選區)"
Q162 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第3選區)"
Q163 "您覺得哪一位候選人比較可能會當選?(台中市第3選區)"
Q164 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第4選區)"
Q165 "您覺得哪一位候選人比較可能會當選?(台中市第4選區)"
Q166 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第5選區)"
Q167 "您覺得哪一位候選人比較可能會當選?(台中市第5選區)"
Q168 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第6選區)"
Q169 "您覺得哪一位候選人比較可能會當選?(台中市第6選區)"
Q170 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第7選區)"
Q171 "您覺得哪一位候選人比較可能會當選?(台中市第7選區)"
Q172 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台中市第8選區)"
Q173 "您覺得哪一位候選人比較可能會當選?(台中市第8選區)"
Q174 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台南市第1選區)"
Q175 "您覺得哪一位候選人比較可能會當選?(台南市第1選區)"
Q176 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台南市第2選區)"
Q177 "您覺得哪一位候選人比較可能會當選?(台南市第2選區)"
Q178 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台南市第3選區)"
Q179 "您覺得哪一位候選人比較可能會當選?(台南市第3選區)"
Q180 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台南市第4選區)"
Q181 "您覺得哪一位候選人比較可能會當選?(台南市第4選區)"
Q182 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台南市第5選區)"
Q183 "您覺得哪一位候選人比較可能會當選?(台南市第5選區)"
Q184 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(台南市第6選區)"
Q185 "您覺得哪一位候選人比較可能會當選?(台南市第6選區)"
Q186 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(桃園市第1選區)"
Q187 "您覺得哪一位候選人比較可能會當選?(桃園市第1選區)"
Q188 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(桃園市第2選區)"
Q189 "您覺得哪一位候選人比較可能會當選?(桃園市第2選區)"
Q190 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(桃園市第3選區)"
Q191 "您覺得哪一位候選人比較可能會當選?(桃園市第3選區)"
Q192 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(桃園市第4選區)"
Q193 "您覺得哪一位候選人比較可能會當選?(桃園市第4選區)"
Q194 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(桃園市第5選區)"
Q195 "您覺得哪一位候選人比較可能會當選?(桃園市第5選區)"
Q196 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(桃園市第6選區)"
Q197 "您覺得哪一位候選人比較可能會當選?(桃園市第6選區)"
Q198 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(平地原住民)"
Q199 "您覺得哪一位候選人比較可能會當選?(平地原住民)"
Q200 "如果明天就是投票日，在您「選區的」立委候選人當中，您會把票投給誰?(山地原住民)"
Q201 "您覺得哪一位候選人比較可能會當選?(山地原住民)"
Q202 "請問上次(2020年)立法委員選舉，區域候選人的部份，您把票投給哪一黨的候選人?"
Q203 "那這次(2024年)立委選舉的不分區選票，您會投給哪一個黨?"
Q204 "請問上次(2020年)立委選舉不分區選票，您把票投給哪一個黨?"
Q205 "您會給柯文哲多少?"
Q206 "您會給賴清德多少?"
Q207 "您會給侯友宜多少?"
Q208 "您會給吳欣盈多少?"
Q209 "您會給蕭美琴多少?"
Q210 "您會給趙少康多少?"
Q211 "如果明天就是投票日，您會把票投給哪一組總統候選人?"
Q212 "您覺得哪一組總統候選人比較可能當選?"
Q213 "您最不希望哪一組總統候選人當選?"
Q214 "請問上次(2020年)總統選舉，您把票投給了哪一組候選人?"
Q215 "請問您覺得目前國家面臨的問題中，最重要的是哪一個?是兩岸關係?教育政策?經濟發展?司法改革?還是居住正義?"
Q216 "那您覺得這次總統選舉哪一組候選人比較能夠處理這個問題?"
Q217 "在2023年12月30日舉行了總統電視辯論會，請問您有沒有看?"
Q218 "請問您認為哪一位總統候選人的表現比較好?"
Q219 "關於台灣和大陸的關係，有下面幾種不同的看法: 1.儘快統一2.儘快宣布獨立3.維持現狀，以後走向統一4.維持現狀，以後走向獨立5.維持現狀，看情形再決定獨立或統一6.永遠維持現狀。請問您比較偏向哪一種?""
Q220 "在目前國內的政黨中，請問您認為您比較支持哪一個政黨?"
Q221 "請問您支持(受訪者回答的黨)的程度是非常支持、還是普普通通?"
Q222 "請問您有沒有比較偏向哪一個政黨?"
Q223 "我們社會上，有人說自己是「台灣人」，也有人說自己是「中國人」，也有人說都是。請問您認為自己是「台灣人」、「中國人」，或者都是?"
Q224 "請問您是民國哪一年出生的?"
Q225 "請問您的最高學歷是什麼?"
Q226 "請問您的父親是本省客家人、本省閩南(河洛)人、大陸各省市人、原住民，還是新住民?"
Q227 "請問您的母親是本省客家人、本省閩南(河洛)人、大陸各省市人、原住民，還是新住民?"
Q228 "請問您的職業是什麼?"
Q229 "請問您配偶的職業是什麼?"
Q230 "請問您失業或退休前的職業是什麼?"
Q231 "性別: "
Q232 "訪問時使用語言: "
 .
 
value labels
    SAMPLE
    1 "正取樣本" 2 "替代樣本"/
    GENDER
    1 "男" 2 "女"/
    level
    1 "第一級"  2 "第二級"  3 "第三級"  /
    RESULT 
      000 "訪問成功"
      010 "受訪者暫時不在 或 不便接聽 (非當日約訪者)"
      020 "受訪者因臨時有事而中途拒訪 (非當日約訪者)"
      030 "受訪者暫時不在 或 不便接聽 (可當日約訪者)"
      040 "受訪者因臨時有事而中途拒訪[可當日約訪者]"
      050 "受訪者拒絕受訪[無法再訪者]"
      060 "受訪者中途拒訪[無法再訪者]"
      070 "接電話即拒訪 或 接電話者有事(我很忙)"
      080 "因語言因素無法受訪"
      081 "因語言因素無法受訪(原住民話)"
      082 "因語言因素無法受訪(客語)"
      083 "因語言因素無法受訪(方言)"
      090 "因生理或心理因素無法受訪"
      091 "受訪者死亡"
      092 "因其他因素無法受訪"
      100 "無人接聽"
      110 "通話中或電話沒掛好。(經立即重撥一次後仍忙線)"
      111 "沒有接觸過"
      112 "以通訊技術封閉電話"
      120 "停話"
      121 "空號"
      122 "被斷線停話"
      123 "移機轉號"
      124 "號中再轉號"
      125 "轉接至另一號"
      126 "電話故障"
      130 "傳真機或其他資料傳輸設備"
      140 "答錄機(住宅)"
      141 "答錄機(非住宅)"
      150 "受訪者訪問期間不在(服役 國外)"
      160 "戶中無合格受訪對象(或 外國人)"
      170 "不在母體定義之內(例如非訪問地區)"
      171 "已訪問過"
      180 "公司或政府機關或社團或機構"
      181 "群居單位(如宿舍)"
      190 "配額已滿"
      201 "問不出該戶是否有合格受訪者"
      202 "其他原因導致不能確定是否有合格受訪者"
/Q1
      1 "是"        2 "否"       
      95 "拒答"     99 "跳題"
/Q2
      2 "宜蘭縣"     4 "新竹縣"      5 "苗栗縣"     7 "彰化縣"        8 "南投縣"
      9 "雲林縣"     10 "嘉義縣"     13 "屏東縣"    14 "台東縣"       15 "花蓮縣"
      16 "澎湖縣"    17 "基隆市"     18 "新竹市"    20 "嘉義市"       28 "金門縣"
      29 "連江縣"    63 "台北市"     64 "高雄市"    65 "新北市"       66 "台中市"
      67 "台南市"    68 "桃園市"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q3
      1 "宜蘭市"     2 "羅東鎮"      3 "蘇澳鎮"     4 "頭城鎮"        5 "礁溪鄉"
      6 "壯圍鄉"     7 "員山鄉"      8 "冬山鄉"     9 "五結鄉"        10 "三星鄉"
      11 "大同鄉"    12 "南澳鄉"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q4
      1 "竹北市"     2 "竹東鎮"      3 "新埔鎮"     4 "關西鎮"        5 "湖口鄉"
      6 "新豐鄉"     7 "芎林鄉"      8 "橫山鄉"     9 "北埔鄉"        10 "寶山鄉"
      11 "峨眉鄉"    12 "尖石鄉"     13 "五峰鄉"    14 "第一選區"     15 "第二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q5
      1 "苗栗市"     2 "苑裡鎮"      3 "通霄鎮"     4 "竹南鎮"        5 "頭份市"
      6 "後龍鎮"     7 "卓蘭鎮"      8 "大湖鄉"     9 "公館鄉"        10 "銅鑼鄉"
      11 "南庄鄉"    12 "頭屋鄉"     13 "三義鄉"    14 "西湖鄉"       15 "造橋鄉"
      16 "三灣鄉"    17 "獅潭鄉"     18 "泰安鄉"    19 "第一選區"     20 "第二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q6
      1 "彰化市"     2 "鹿港鎮"      3 "和美鎮"     4 "線西鄉"        5 "伸港鄉"
      6 "福興鄉"     7 "秀水鄉"      8 "花壇鄉"     9 "芬園鄉"        10 "員林市"
      11 "溪湖鎮"    12 "田中鎮"     13 "大村鄉"    14 "埔鹽鄉"       15 "埔心鄉"
      16 "永靖鄉"    17 "社頭鄉"     18 "二水鄉"    19 "北斗鎮"       20 "二林鎮"
      21 "田尾鄉"    22 "埤頭鄉"     23 "芳苑鄉"    24 "大城鄉"       25 "竹塘鄉"
      26 "溪州鄉"    27 "第一選區"   28 "第二選區"  29 "第三選區"     30 "第四選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q7
      1 "南投市"     2 "埔里鎮"      3 "草屯鎮"     4 "竹山鎮"        5 "集集鎮"
      6 "名間鄉"     7 "鹿谷鄉"      8 "中寮鄉"     9 "魚池鄉"        10 "國姓鄉"
      11 "水里鄉"    12 "信義鄉"     13 "仁愛鄉"    14 "第一選區"     15 "第二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q8                  
      1 "斗六市"     2 "斗南鎮"      3 "虎尾鎮"     4 "西螺鎮"        5 "土庫鎮"
      6 "北港鎮"     7 "古坑鄉"      8 "大埤鄉"     9 "莿桐鄉"        10 "林內鄉"
      11 "二崙鄉"    12 "崙背鄉"     13 "麥寮鄉"    14 "東勢鄉"       15 "褒忠鄉"
      16 "臺西鄉"    17 "元長鄉"     18 "四湖鄉"    19 "口湖鄉"       20 "水林鄉"
      21 "第一選區"  22 "第二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q9
      1 "太保市"     2 "朴子市"      3 "布袋鎮"     4 "大林鎮"        5 "民雄鄉"
      6 "溪口鄉"     7 "新港鄉"      8 "六腳鄉"     9 "東石鄉"        10 "義竹鄉"
      11 "鹿草鄉"    12 "水上鄉"     13 "中埔鄉"    14 "竹崎鄉"       15 "梅山鄉"
      16 "番路鄉"    17 "大埔鄉"     18 "阿里山鄉"  19 "第一選區"     20 "第二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q10
      1 "屏東市"     2 "潮洲鎮"      3 "東港鎮"     4 "恆春鎮"        5 "萬丹鄉"
      6 "長治鄉"     7 "麟洛鄉"      8 "九如鄉"     9 "里港鄉"        10 "鹽埔鄉"
      11 "高樹鄉"    12 "萬巒鄉"     13 "內埔鄉"    14 "竹田鄉"       15 "新埤鄉"
      16 "枋寮鄉"    17 "新園鄉"     18 "崁頂鄉"    19 "林邊鄉"       20 "南州鄉"
      21 "佳冬鄉"    22 "琉球鄉"     23 "車城鄉"    24 "滿州鄉"       25 "枋山鄉"
      26 "三地門鄉"  27 "霧臺鄉"     28 "瑪家鄉"    29 "泰武鄉"       30 "來義鄉"
      31 "春日鄉"    32 "獅子鄉"     33 "牡丹鄉"    34 "第一選區"     35 "第二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q11
      1 "台東市"     2 "成功鎮"      3 "關山鎮"     4 "卑南鄉"        5 "鹿野鄉"
      6 "池上鄉"     7 "東河鄉"      8 "長濱鄉"     9 "太麻里鄉"      10 "大武鄉"
      11 "綠島鄉"    12 "海端鄉"     13 "延平鄉"    14 "金峰鄉"       15 "達仁鄉"
      16 "蘭嶼鄉"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q12
      1 "花蓮市"     2 "鳳林鎮"      3 "玉里鎮"     4 "新城鄉"        5 "吉安鄉"
      6 "壽豐鄉"     7 "光復鄉"      8 "豐濱鄉"     9 "瑞穗鄉"        10 "富里鄉"
      11 "秀林鄉"    12 "萬榮鄉"     13 "卓溪鄉"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q13
      1 "馬公市"     2 "湖西鄉"      3 "白沙鄉"     4 "西嶼鄉"        5 "望安鄉"
      6 "七美鄉"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q14
      1 "中正區"     2 "七堵區"      3 "暖暖區"     4 "仁愛區"        5 "中山區"
      6 "安樂區"     7 "信義區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q15
      1 "東區"       2 "北區"        3 "香山區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q16
      1 "東區"       2 "西區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q17
      1 "松山區"     2 "信義區"      3 "大安區"     4 "中山區"        5 "中正區"
      6 "大同區"     7 "萬華區"      8 "文山區"     9 "南港區"        10 "內湖區"
      11 "士林區"    12 "北投區"     13 "第一選區"  14 "第二選區"     15 "第三選區"
      16 "第四選區"  17 "第五選區"   18 "第六選區"  19 "第七選區"     20 "第八選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q18
      1 "鹽埕區"     2 "鼓山區"      3 "左營區"     4 "楠梓區"        5 "三民區"
      6 "新興區"     7 "前金區"      8 "苓雅區"     9 "前鎮區"        10 "旗津區"
      11 "小港區"    12 "鳳山區"     13 "林園區"    14 "大寮區"       15 "大樹區"
      16 "大社區"    17 "仁武區"     18 "鳥松區"    19 "岡山區"       20 "橋頭區"
      21 "燕巢區"    22 "田寮區"     23 "阿蓮區"    24 "路竹區"       25 "湖內區"
      26 "茄萣區"    27 "永安區"     28 "彌陀區"    29 "梓官區"       30 "旗山區"
      31 "美濃區"    32 "六龜區"     33 "甲仙區"    34 "杉林區"       35 "內門區"
      36 "茂林區"    37 "桃源區"     38 "那瑪夏區"  39 "第一選區"     40 "第二選區"
      41 "第三選區"  42 "第四選區"   43 "第五選區"  44 "第六選區"     45 "第七選區"
      46 "第八選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q19
      1 "板橋區"     2 "三重區"      3 "中和區"     4 "永和區"        5 "新莊區"
      6 "新店區"     7 "樹林區"      8 "鶯歌區"     9 "三峽區"        10 "淡水區"
      11 "汐止區"    12 "瑞芳區"     13 "土城區"    14 "蘆洲區"       15 "五股區"
      16 "泰山區"    17 "林口區"     18 "深坑區"    19 "石碇區"       20 "坪林區"
      21 "三芝區"    22 "石門區"     23 "八里區"    24 "平溪區"       25 "雙溪區"
      26 "貢寮區"    27 "金山區"     28 "萬里區"    29 "烏來區"       30 "第一選區"
      31 "第二選區"  32 "第三選區"   33 "第四選區"  34 "第五選區"     35 "第六選區"
      36 "第七選區"  37 "第八選區"   38 "第九選區"  39 "第十選區"     40 "第十一選區"
      41 "第十二選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q20
      1 "中區"       2 "東區"        3 "南區"       4 "西區"          5 "北區"
      6 "西屯區"     7 "南屯區"      8 "北屯區"     9 "豐原區"        10 "東勢區"
      11 "大甲區"    12 "清水區"     13 "沙鹿區"    14 "梧棲區"       15 "后里區"
      16 "神岡區"    17 "潭子區"     18 "大雅區"    19 "新社區"       20 "石岡區"
      21 "外埔區"    22 "大安區"     23 "烏日區"    24 "大肚區"       25 "龍井區"
      26 "霧峰區"    27 "太平區"     28 "大里區"    29 "和平區"       30 "第一選區"
      31 "第二選區"  32 "第三選區"   33 "第四選區"  34 "第五選區"     35 "第六選區"
      36 "第七選區"  37 "第八選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q21
      1 "新營區"     2 "鹽水區"      3 "白河區"     4 "柳營區"        5 "後壁區"
      6 "東山區"     7 "麻豆區"      8 "下營區"     9 "六甲區"        10 "官田區"
      11 "大內區"    12 "佳里區"     13 "學甲區"    14 "西港區"       15 "七股區"
      16 "將軍區"    17 "北門區"     18 "新化區"    19 "善化區"       20 "新市區"
      21 "安定區"    22 "山上區"     23 "玉井區"    24 "楠西區"       25 "南化區"
      26 "左鎮區"    27 "仁德區"     28 "歸仁區"    29 "關廟區"       30 "龍崎區"
      31 "永康區"    32 "東區"       33 "南區"      34 "北區"         35 "安南區"
      36 "安平區"    37 "中西區"     38 "第一選區"  39 "第二選區"     40 "第三選區"
      41 "第四選區"  42 "第五選區"   43 "第六選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q22
      1 "桃園區"     2 "中壢區"      3 "大溪區"     4 "楊梅區"        5 "蘆竹區"
      6 "大園區"     7 "龜山區"      8 "八德區"     9 "龍潭區"        10 "平鎮區"
      11 "新屋區"    12 "觀音區"     13 "復興區"    14 "第一選區"     15 "第二選區"
      16 "第三選區"  17 "第四選區"   18 "第五選區"  19 "第六選區"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q23
      1 "金城鎮"     2 "金沙鎮"      3 "金湖鎮"     4 "金寧鄉"        5 "烈嶼鄉"
      6 "烏坵鄉"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q24
      1 "南竿鄉"     2 "北竿鄉"      3 "莒光鄉"     4 "東引鄉"
      95 "拒答"      98 "不知道"     99 "跳題" 
/Q25
      2 "莊敬里"     3 "東榮里"      4 "三民里"     5 "新益里"        6 "富錦里"
      7 "新東里"     8 "富泰里"      9 "介壽里"     10 "精忠里"       11 "東光里"
      12 "龍田里"    13 "東昌里"     14 "東勢里"    15 "中華里"       16 "民有里"
      17 "民福里"    18 "慈祐里"     19 "安平里"    20 "鵬程里"       21 "自強里"
      22 "吉祥里"    24 "新聚里"     25 "復盛里"    26 "中正里"       27 "中崙里"
      28 "美仁里"    29 "吉仁里"     30 "敦化里"    31 "復源里"       32 "復建里"
      33 "復勢里"    34 "福成里"     35 "松基里"    36 "第三選區"     37 "第七選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q26
      1 "水源里"     2 "富水里"      3 "文盛里"     4 "林興里"        5 "河堤里"
      6 "頂東里"     7 "網溪里"      8 "板溪里"     9 "螢圃里"        10 "螢雪里"
      11 "永功里"    12 "永昌里"     13 "龍興里"    14 "忠勤里"       15 "廈安里"
      16 "愛國里"    17 "南門里"     18 "龍光里"    19 "南福里"       20 "龍福里"
      21 "新營里"    22 "建國里"     23 "光復里"    24 "黎明里"       25 "梅花里"
      26 "幸福里"    27 "幸市里"     28 "東門里"    29 "文北里"       30 "文祥里"
      31 "三愛里"    32 "第五選區"   33 "第八選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q27
      1 "仁勇里"     2 "義信里"      3 "福林里"     4 "福德里"        5 "福志里"
      6 "舊佳里"     7 "福佳里"      8 "後港里"     9 "福中里"        10 "前港里"
      11 "百齡里"    12 "承德里"     13 "福華里"    14 "明勝里"       15 "福順里"
      16 "富光里"    17 "葫蘆里"     18 "葫東里"    19 "社子里"       20 "社新里"
      21 "社園里"    22 "永倫里"     23 "福安里"    24 "富洲里"       25 "岩山里"
      26 "名山里"    27 "德行里"     28 "德華里"    29 "聖山里"       30 "忠誠里"
      31 "芝山里"    32 "東山里"     33 "三玉里"    34 "蘭雅里"       35 "蘭興里"
      36 "天福里"    37 "天祿里"     38 "天壽里"    39 "天和里"       40 "天山里"
      41 "天玉里"    42 "天母里"     43 "永福里"    44 "公館里"       45 "新安里"
      46 "陽明里"    47 "菁山里"     48 "平等里"    49 "溪山里"       50 "翠山里"
      51 "臨溪里"    52 "第一選區"   53 "第二選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q28
      1 "博仁里"     2 "苓洲里"      3 "苓昇里"     4 "苓中里"        5 "苓雅里"
      6 "苓東里"     7 "城北里"      8 "城西里"     9 "城東里"        10 "意誠里"
      11 "鼓中里"    12 "田西里"     13 "人和里"    14 "仁政里"       15 "廣澤里"
      16 "美田里"    17 "華堂里"     18 "日中里"    19 "普照里"       20 "和煦里"
      21 "晴朗里"    22 "普天里"     23 "林富里"    24 "林圍里"       25 "林安里"
      26 "光華里"    27 "林興里"     28 "林華里"    29 "林西里"       30 "林中里"
      31 "林泉里"    32 "林南里"     33 "中正里"    34 "尚義里"       35 "同慶里"
      36 "凱旋里"    37 "安祥里"     38 "奏捷里"    39 "福壽里"       40 "福南里"
      41 "五權里"    42 "民主里"     43 "林德里"    44 "林貴里"       45 "林榮里"
      46 "英明里"    47 "林靖里"     48 "朝陽里"    49 "福隆里"       50 "福祥里"
      51 "福海里"    52 "福康里"     53 "福人里"    54 "福地里"       55 "福居里"
      56 "福東里"    57 "福西里"     58 "永康里"    59 "正文里"       60 "正言里"
      61 "正大里"    62 "五福里"     63 "正心里"    64 "正道里"       65 "正義里"
      66 "正仁里"    67 "文昌里"     68 "建軍里"    69 "衛武里"       88 "第五選區"
      89 "第六選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q29
      1 "留侯里"     2 "流芳里"      3 "赤松里"     4 "黃石里"        5 "挹秀里"
      6 "湳興里"     7 "新興里"      8 "社後里"     9 "香社里"        10 "中正里"
      11 "自強里"    12 "自立里"     13 "光華里"    14 "國光里"       15 "港尾里"
      16 "金華里"    17 "港德里"     18 "民權里"    19 "建國里"       20 "漢生里"
      21 "公館里"    22 "新民里"     23 "幸福里"    24 "忠誠里"       25 "百壽里"
      26 "介壽里"    27 "新埔里"     28 "華江里"    29 "江翠里"       30 "純翠里"
      31 "溪頭里"    32 "聯翠里"     33 "宏翠里"    34 "仁翠里"       35 "新翠里"
      36 "吉翠里"    37 "德翠里"     38 "滿翠里"    39 "明翠里"       40 "松翠里"
      41 "柏翠里"    42 "龍翠里"     43 "華翠里"    44 "忠翠里"       45 "嵐翠里"
      46 "文翠里"    47 "青翠里"     48 "懷翠里"    49 "福翠里"       50 "港嘴里"
      51 "振興里"    52 "振義里"     53 "光復里"    54 "埔墘里"       55 "長壽里"
      56 "福壽里"    57 "海山里"     58 "九如里"    59 "玉光里"       60 "光仁里"
      61 "埤墘里"    62 "永安里"     63 "雙玉里"    64 "廣新里"       65 "深丘里"
      66 "香丘里"    67 "西安里"     68 "東丘里"    69 "長安里"       70 "福丘里"
      71 "福祿里"    72 "民族里"     73 "國泰里"    74 "福德里"       75 "景星里"
      76 "福星里"    77 "鄉雲里"     78 "廣德里"    79 "大豐里"       80 "重慶里"
      81 "仁愛里"    82 "和平里"     83 "廣福里"    84 "華興里"       85 "華貴里"
      86 "華德里"    87 "華東里"     88 "信義里"    89 "浮洲里"       90 "華中里"
      91 "僑中里"    92 "中山里"     93 "復興里"    94 "大安里"       95 "福安里"
      96 "聚安里"    97 "龍安里"     98 "崑崙里"    99 "溪洲里"       100 "溪北里"
      101 "香雅里"   102 "新生里"    103 "文德里"   104 "文化里"      105 "新海里"
      106 "莒光里"   107 "富貴里"    108 "正泰里"   109 "民生里"      110 "後埔里"
      111 "華福里"   112 "堂春里"    113 "成和里"   114 "光榮里"      115 "民安里"
      116 "陽明里"   117 "朝陽里"    118 "松柏里"   119 "文聖里"      120 "居仁里"
      121 "莊敬里"   122 "東安里"    123 "五權里"   124 "溪福里"      125 "大觀里"
      126 "歡園里"   127 "第六選區"  128 "第七選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q30
      1 "大有里"     2 "二重里"      3 "頂崁里"     4 "谷王里"        5 "中興里"
      6 "德厚里"     7 "成功里"      8 "福祉里"     9 "福民里"        10 "過田里"
      11 "錦田里"    12 "重明里"     13 "光田里"    14 "光陽里"       15 "田心里"
      16 "福田里"    17 "田中里"     18 "田安里"    19 "三民里"       20 "光明里"
      21 "光正里"    22 "同安里"     23 "同慶里"    24 "菜寮里"       25 "永春里"
      26 "中正里"    27 "吉利里"     28 "大同里"    29 "中民里"       30 "平和里"
      31 "大安里"    32 "仁德里"     33 "忠孝里"    34 "仁義里"       35 "光榮里"
      36 "光輝里"    37 "福星里"     38 "福利里"    39 "清和里"       40 "永興里"
      41 "中山里"    42 "大園里"     43 "國隆里"    44 "重陽里"       45 "民生里"
      46 "重新里"    47 "正德里"     48 "正義里"    49 "正安里"       50 "自強里"
      51 "文化里"    52 "中央里"     53 "雙園里"    54 "錦通里"       55 "錦安里"
      56 "長安里"    57 "光華里"     58 "長生里"    59 "開元里"       60 "大德里"
      61 "長元里"    62 "長江里"     63 "長泰里"    64 "長福里"       65 "介壽里"
      66 "萬壽里"    67 "錦江里"     68 "龍濱里"    69 "龍門里"       70 "秀江里"
      71 "奕壽里"    72 "三安里"     73 "福安里"    74 "信安里"       75 "安慶里"
      76 "幸福里"    77 "六合里"     78 "六福里"    79 "順德里"       80 "承德里"
      81 "瑞德里"    82 "崇德里"     83 "厚德里"    84 "維德里"       85 "尚德里"
      86 "培德里"    87 "永德里"     88 "永盛里"    89 "永福里"       90 "永清里"
      91 "永安里"    92 "永煇里"     93 "溪美里"    94 "福隆里"       95 "五常里"
      96 "五福里"    97 "仁忠里"     98 "慈福里"    99 "慈生里"       100 "慈惠里"
      101 "慈愛里"   102 "慈化里"    103 "慈祐里"   104 "五華里"      105 "富貴里"
      106 "富華里"   107 "富福里"    108 "碧華里"   109 "五谷里"      110 "博愛里"
      111 "福德里"   112 "永吉里"    113 "永發里"   114 "永順里"      115 "永豐里"
      116 "立德里"   117 "福樂里"    118 "仁華里"   119 "五順里"      120 "第二選區"
      121 "第三選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q31
      1 "中原里"     2 "平河里"      3 "信和里"     4 "仁和里"        5 "中正里"
      6 "建和里"     7 "連和里"      8 "連城里"     9 "力行里"        10 "枋寮里"
      11 "漳和里"    12 "廟美里"     13 "福真里"    14 "福善里"       15 "福美里"
      16 "福祥里"    17 "瓦窯里"     18 "福和里"    19 "佳和里"       20 "安樂里"
      21 "安和里"    22 "安平里"     23 "中安里"    24 "泰安里"       25 "新南里"
      26 "南山里"    27 "秀山里"     28 "秀成里"    29 "秀福里"       30 "秀景里"
      31 "秀明里"    32 "秀峰里"     33 "秀仁里"    34 "頂南里"       35 "華新里"
      36 "東南里"    37 "華南里"     38 "忠孝里"    39 "崇南里"       40 "景南里"
      41 "橫路里"    42 "內南里"     43 "壽南里"    44 "外南里"       45 "復興里"
      46 "和興里"    47 "景平里"     48 "景新里"    49 "景福里"       50 "景安里"
      51 "景文里"    52 "錦和里"     53 "錦昌里"    54 "灰窯里"       55 "積穗里"
      56 "民享里"    57 "員山里"     58 "嘉穗里"    59 "文元里"       60 "嘉新里"
      61 "民安里"    62 "安穗里"     63 "瑞穗里"    64 "明穗里"       65 "清穗里"
      66 "自強里"    67 "德穗里"     68 "民生里"    69 "國光里"       70 "壽德里"
      71 "明德里"    72 "秀水里"     73 "德行里"    74 "宜安里"       75 "安順里"
      76 "秀義里"    77 "秀士里"     78 "興南里"    79 "景本里"       80 "福南里"
      81 "中興里"    82 "吉興里"     83 "中山里"    84 "碧河里"       85 "錦中里"
      86 "錦盛里"    87 "民有里"     88 "員富里"    89 "嘉慶里"       90 "冠穗里"
      91 "國華里"    92 "正南里"     93 "正行里"    94 "第八選區"     95 "第九選區"
      995 "拒答"     998 "不知道"    999 "跳題" 
/Q32
      1 "海山里"     2 "頭前里"     3 "國泰里"     4 "全安里"         5 "福基里"
      6 "豐年里"
      7 "忠孝里"     8 "恆安里"     9 "後港里"     10 "文衡里"        11 "中美里"
      12 "八德里"    13 "興漢里"    14 "中和里"    15 "西盛里"        16 "榮和里"
      17 "中泰里"    18 "瓊林里"    19 "文德里"    20 "中誠里"        21 "裕民里"
      22 "文明里"    23 "中港里"    24 "富國里"    25 "思源里"        26 "立人里"
      27 "南港里"    28 "仁愛里"    29 "立德里"    30 "信義里"        31 "立言里"
      32 "民安里"    33 "和平里"    34 "立功里"    35 "民本里"        36 "化成里"
      37 "立志里"    38 "光華里"    39 "思賢里"    40 "營盤里"        41 "光榮里"
      42 "自強里"    43 "丹鳳里"    44 "光明里"    45 "自立里"        46 "合鳳里"
      47 "幸福里"    48 "雙鳳里"    49 "自信里"    50 "龍鳳里"        51 "中華里"
      52 "中隆里"    53 "中原里"    54 "中信里"    55 "四維里"        56 "建福里"
      57 "中宏里"    58 "中全里"    59 "立泰里"    60 "全泰里"        61 "仁義里"
      62 "立基里"    63 "昌明里"    64 "昌平里"    65 "文聖里"        66 "萬安里"
      67 "龍安里"    68 "福營里"    69 "後德里"    70 "建安里"        71 "成德里"
      72 "福興里"    73 "昌信里"    74 "昌隆里"    75 "中平里"        76 "立廷里"
      77 "泰豐里"    78 "富民里"    79 "龍福里"    80 "祥鳳里"        81 "民全里"
      82 "民有里"    83 "光正里"    84 "光和里"    85 "第四選區"      86 "第五選區"
      995 "拒答"     998 "不知道"   999 "跳題" 
/Q33
      1 "斗崙里"     2 "鹿場里"     3 "東平里"     4 "中興里"         5 "隘口里"
      6 "東海里"     7 "竹北里"     8 "竹仁里"     9 "竹義里"         10 "泰和里"
      11 "新社里"    12 "聯興里"    13 "麻園里"    14 "溪州里"        15 "白地里"
      16 "新港里"    17 "大義里"    18 "崇義里"    19 "大眉里"        20 "尚義里"
      21 "十興里"    22 "新國里"    23 "新庄里"    24 "北崙里"        25 "新崙里"
      26 "福德里"    27 "東興里"    28 "北興里"    29 "興安里"        30 "文化里"
      31 "中崙里"    32 "第一選區"  33 "第二選區"
      995 "拒答"     998 "不知道"   999 "跳題" 
/Q34
      1 "富裕里"     2 "裕農里"     3 "大智里"     4 "崇學里"         5 "泉南里"
      6 "仁和里"     7 "後甲里"     8 "東光里"     9 "新東里"         10 "中西里"
      11 "東安里"    12 "崇明里"    13 "自強里"    14 "和平里"        15 "路東里"
      16 "大德里"    17 "關聖里"    18 "衛國里"    19 "崇善里"        20 "富強里"
      21 "圍下里"    22 "小東里"    23 "大學里"    24 "龍山里"        25 "虎尾里"
      26 "德高里"    27 "莊敬里"    28 "大福里"    29 "忠孝里"        30 "崇誨里"
      31 "東明里"    32 "崇德里"    33 "東智里"    34 "東聖里"        35 "崇成里"
      36 "東門里"    37 "成大里"    38 "大同里"    39 "德光里"        40 "崇信里"
      41 "崇文里"    42 "復興里"    43 "裕聖里"    44 "南聖里"        45 "文聖里"
      46 "第五選區"  47 "第六選區"
      995 "拒答"     998 "不知道"   999 "跳題" 
/Q35
      1 "文化里"     2 "文明里"     3 "武陵里"     4 "大林里"         5 "忠義里"
      6 "會稽里"     7 "長美里"     8 "民生里"     9 "永興里"         10 "汴洲里"
      11 "永安里"    12 "東埔里"    13 "東門里"    14 "東山里"        15 "萬壽里"
      16 "長安里"    17 "中埔里"    18 "西埔里"    19 "西門里"        20 "中和里"
      21 "文昌里"    22 "新埔里"    23 "中山里"    24 "慈文里"        25 "西湖里"
      26 "南門里"    27 "南華里"    28 "玉山里"    29 "中成里"        30 "中正里"
      31 "北門里"    32 "雲林里"    33 "福林里"    34 "光興里"        35 "龍山里"
      36 "龍岡里"    37 "成功里"    38 "青溪里"    39 "朝陽里"        40 "中興里"
      41 "豐林里"    42 "建國里"    43 "大豐里"    44 "福安里"        45 "三民里"
      46 "大興里"    47 "春日里"    48 "信光里"    49 "中寧里"        50 "同安里"
      51 "莊敬里"    52 "文中里"    53 "泰山里"    54 "中路里"        55 "中德里"
      56 "龍祥里"    57 "大有里"    58 "寶山里"    59 "龍鳳里"        60 "龍安里"
      61 "自強里"    62 "中信里"    63 "長德里"    64 "中平里"        65 "中原里"
      66 "中泰里"    67 "南埔里"    68 "寶慶里"    69 "北埔里"        70 "中聖里"
      71 "龍壽里"    72 "同德里"    73 "明德里"    74 "寶安里"        75 "瑞慶里"
      76 "三元里"    77 "大樹里"    78 "大業里"    79 "福元里"        80 "經國里"
      81 "檜樂里"    82 "寶民里"
      83 "第一選區"
      84 "第四選區"
      995 "拒答"     998 "不知道"   999 "跳題" 
/Q36
      1 "龍平里"     2 "龍昌里"     3 "仁德里"     4 "永興里"         5 "內壢里"
      6 "成功里"     7 "光明里"     8 "自立里"     9 "自強里"         10 "中堅里"
      11 "龍興里"    12 "仁美里"    13 "仁愛里"    14 "新街里"        15 "中央里"
      16 "普仁里"    17 "普義里"    18 "忠義里"    19 "中正里"        20 "興仁里"
      21 "東興里"    22 "洽溪里"    23 "篤行里"    24 "新明里"        25 "新興里"
      26 "中原里"    27 "內定里"    28 "中壢里"    29 "龍岡里"        30 "仁祥里"
      31 "水尾里"    32 "青埔里"    33 "復興里"    34 "文化里"        35 "興國里"
      36 "忠福里"    37 "信義里"    38 "石頭里"    39 "龍東里"        40 "中建里"
      41 "興南里"    42 "後寮里"    43 "過嶺里"    44 "五權里"        45 "舊明里"
      46 "芝芭里"    47 "月眉里"    48 "三民里"    49 "山東里"        50 "中榮里"
      51 "內厝里"    52 "振興里"    53 "普慶里"    54 "興和里"        55 "永光里"
      56 "復華里"    57 "忠孝里"    58 "福德里"    59 "和平里"        60 "普忠里"
      61 "普強里"    62 "明德里"    63 "至善里"    64 "五福里"        65 "龍德里"
      66 "正義里"    67 "龍安里"    68 "中山里"    69 "德義里"        70 "仁義里"
      71 "華勛里"    72 "仁福里"    73 "幸福里"    74 "永福里"        75 "仁和里"
      76 "華愛里"    77 "莊敬里"    78 "自治里"    79 "健行里"        80 "興平里"
      81 "中興里"    82 "龍慈里"    83 "自信里"    84 "林森里"        85 "金華里"
      86 "青溪里"    87"興華里"     88 "興福里"
      89 "第三選區" 90 "第六選區"
      995 "拒答"     998 "不知道"   999 "跳題" 
/Q37
      1 "台視"       2 "中視"       3 "華視"       4 "民視"           5 "TVBS"
      6 "三立"       7 "東森"       8 "中天"       9 "年代"           10 "八大"
      11 "非凡"      12 "大愛"      13 "公視"      14 "客家"          15 "原住民"
      16 "壹電視"  17 "Goodnews"   18 "寰宇新聞台"  19 "CNN"          20 "NHK"
      21 "BBC"     22 "地方新聞台" 23"UDN新聞台"    24 "FOX福斯(MOD)" 25 "NBC國家廣播公司"
      26 "東森財經新聞台"          27 "新唐人"      28 "鏡電視"
      92 "都不看"    96 "很難說"     95 "拒答"  
/Q38
      1 "有"         2 "沒有"       95 "拒答"      98 "不知道"
/Q39_1 Q39_2 Q39_3 Q39_4 Q39_5
      1 "Line"               2 "臉書Facebook"  3 "IG Instagram"   4 "Youtube"   5 "微信"
      6 "Skype"            7 "QQ"                 8 "PTT"                9 "Twitter"    10 "微博"
      11 "Messenger"   12 "Whatsapp"      13 "Telegram"      14 "揪科"      15 "Dcard"
      16 "Google Hangouts"  17 "噗浪"      18"Viber"          19 "Threads"   20 "抖音"
      21 "Discord"        22 "小紅書"
      95 "拒答"            98 "不知道"            99 "跳題"
/Q40
      1 "非常注意"         2 "有點注意"           3 "不太注意"         4 "一點都不注意"
      95 "拒答"            96 "很難說"            97 "無意見"          98 "不知道"
/Q41
      1 "非常滿意"         2 "有點滿意"           3 "不太滿意"         4 "非常不滿意"
      95 "拒答"            96 "很難說"            97 "無意見"          98 "不知道"
/Q42
      1 "非常滿意"         2 "有點滿意"           3 "不太滿意"         4 "非常不滿意"
      95 "拒答"            96 "很難說"            97 "無意見"          98 "不知道"
/Q43
      1 "比較好"           2 "比較不好"           3 "差不多"           
      95 "拒答"            96 "看情形"            97 "無意見"          98 "不知道"
      99 "跳題"
/Q44
      1 "變好"             2 "變不好"             3 "差不多"
      95 "拒答"            96 "看情形"            97 "無意見"          98 "不知道"
      99 "跳題"
/Q45
      1 "比較好"           2 "比較不好"           3 "差不多"
      95 "拒答"            96 "看情形"            97 "無意見"          98 "不知道"
      99 "跳題"      
/Q46
      1 "變好"             2 "變不好"             3 "差不多"
      95 "拒答"            96 "看情形"            97 "無意見"          98 "不知道"
      99 "跳題"    
/Q47
      0 "中共絕對不會攻打台灣"                 10 "中共一定會攻打台灣"
      95 "拒答"            98 "不知道"
/Q48
      1 "非常生氣"         2 "有點生氣"           3 "不太生氣"         4 "完全不生氣"
      95 "拒答"            96 "很難說"            97 "無意見"          98 "不知道"
/Q49
      1 "國民黨"           2 "民進黨"             6 "無黨團結聯盟"     8 "無黨籍"      21 "時代力量"        
      35 "台灣基進"      38 "台灣民眾黨"
      91 "一樣好"          92 "一樣差"
      95 "拒  答"          96 "看情形"            97 "無 意 見"        98 "不 知 道"
/Q50
      1 "總統與立法院的多數立委最好是不同黨，才能互相制衡"
      2 "總統與立法院的多數立委最好是同一政黨，才可以貫徹政策"
      95 "拒答"            96 "很難說"            97 "無意見"          98 "不知道"
/Q51
      1 "非常滿意"         2 "有點滿意"           3 "不太滿意"         4 "非常不滿意"
      96 "很難說"          97 "無意見"            98 "不知道"          95 "拒答"
/Q52
      1 "黃琤婷/女/中國國民黨"          2 "陳俊宇/男/民主進步黨"                 17 "林意評/男/台灣基進"
      41 "陳琬惠/女/台灣民眾黨"         75 "邱介勳/男/制度救世島"                84 "林錦坤/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                           94 "投廢票"
      96 "看情形"                       98 "不知道"                             95 "拒答"       99 "跳題"
/Q53
      1 "黃琤婷/女/中國國民黨"          2 "陳俊宇/男/民主進步黨"                 17 "林意評/男/台灣基進"
      41 "陳琬惠/女/台灣民眾黨"         75 "邱介勳/男/制度救世島"                84 "林錦坤/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q54
      1 "徐欣瑩/女/中國國民黨"          2 "詹紀緹/女/民主進步黨"                 9 "余筱菁/女/台灣綠黨"
      42 "劉復嵐/男/台灣維新"           79 "劉台穠/女/小民參政歐巴桑聯盟"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q55
      1 "徐欣瑩/女/中國國民黨"          2 "詹紀緹/女/民主進步黨"                 9 "余筱菁/女/台灣綠黨"
      42 "劉復嵐/男/台灣維新"           79 "劉台穠/女/小民參政歐巴桑聯盟"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q56
      1 "林思銘/男/中國國民黨"          2 "曾聖凱/男/民主進步黨"                 19 "王婉諭/女/時代力量"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q57
      1 "林思銘/男/中國國民黨"          2 "曾聖凱/男/民主進步黨"                 19 "王婉諭/女/時代力量"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q58
      2 "康世明/男/民主進步黨"          84 "陳超明/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q59
      2 "康世明/男/民主進步黨"          84 "陳超明/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q60
      1 "邱鎮軍/男/中國國民黨"          84 "曾玟學/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"
      99 "跳題"
/Q61
      1 "邱鎮軍/男/中國國民黨"          84 "曾玟學/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q62
      1 "阮厚爵/男/中國國民黨"          2 "陳秀寶/女/民主進步黨"                 84 "蘇群傑/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"
      99 "跳題"
/Q63
      1 "阮厚爵/男/中國國民黨"          2 "陳秀寶/女/民主進步黨"                 84 "蘇群傑/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q64
      1 "楊曜聰/男/中國國民黨"          2 "黃秀芳/女/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q65
      1 "楊曜聰/男/中國國民黨"          2 "黃秀芳/女/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q66
      1 "謝衣鳳/女/中國國民黨"          2 "吳音寧/女/民主進步黨"                 25 "桂麗娜/女/中華統一促進黨"
      84 "洪建興/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q67
      1 "謝衣鳳/女/中國國民黨"          2 "吳音寧/女/民主進步黨"                 25 "桂麗娜/女/中華統一促進黨"
      84 "洪建興/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q68
      1 "鄭俊雄/男/中國國民黨"          2 "陳素月/女/民主進步黨"                 71 "鄭錫懋/男/台灣雙語無法黨"
      82 "蔡念諶/男/中華文化共和黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q69
      1 "鄭俊雄/男/中國國民黨"          2 "陳素月/女/民主進步黨"                 71 "鄭錫懋/男/台灣雙語無法黨"
      82 "蔡念諶/男/中華文化共和黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q70
      1 "馬文君/女/中國國民黨"          2 "蔡銘軒/男/民主進步黨"                 13 "許文忠/男/勞動黨"
      79 "李圓恩/女/小民參政歐巴桑聯盟" 84 "林金潭/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"     99 "跳題"
/Q71
      1 "馬文君/女/中國國民黨"          2 "蔡銘軒/男/民主進步黨"                 13 "許文忠/男/勞動黨"
      79 "李圓恩/女/小民參政歐巴桑聯盟" 84 "林金潭/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"     99 "跳題"
/Q72
      1 "游顥/男/中國國民黨"            2 "蔡培慧/女/民主進步黨"                   84 "陳癸佑/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"     99 "跳題"
/Q73
      1 "游顥/男/中國國民黨"            2 "蔡培慧/女/民主進步黨"                   84 "陳癸佑/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"     99 "跳題"
/Q74
      1 "丁學忠/男/中國國民黨"          2 "蘇治芬/女/民主進步黨"                 25 "郭炳宏/男/中華統一促進黨"
      70 "李昭儀/女/台灣革命黨"         84 "吳炳輝/男/無"                        85 "陳俊龍/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q75
      1 "丁學忠/男/中國國民黨"          2 "蘇治芬/女/民主進步黨"                 25 "郭炳宏/男/中華統一促進黨"
      70 "李昭儀/女/台灣革命黨"         84 "吳炳輝/男/無"                        85 "陳俊龍/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q76
      1 "邱良閱/男/中國國民黨"          2 "劉建國/男/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q77
      1 "邱良閱/男/中國國民黨"          2 "劉建國/男/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q78
      1 "詹琬蓁/女/中國國民黨"          2 "蔡易餘/男/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q79
      1 "詹琬蓁/女/中國國民黨"          2 "蔡易餘/男/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q80
      2 "陳冠廷/男/民主進步黨"          42 "黃一哲/男/台灣維新"                  75 "簡銘傑/男/制度救世島"
      84 "林國慶/男/無"                 85 "廖昱婧/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q81
      2 "陳冠廷/男/民主進步黨"          42 "黃一哲/男/台灣維新"                  75 "簡銘傑/男/制度救世島"
      84 "林國慶/男/無"                 85 "廖昱婧/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q82
      1 "黃明賢/男/中國國民黨"          2 "鍾佳濱/男/民主進步黨"                 25 "李孟翰/男/中華統一促進黨"
      42 "張庭源/男/台灣維新"           84 "蔣月惠/女/無"                       85 "曾鈺庭/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q83
      1 "黃明賢/男/中國國民黨"          2 "鍾佳濱/男/民主進步黨"                 25 "李孟翰/男/中華統一促進黨"
      42 "張庭源/男/台灣維新"           84 "蔣月惠/女/無"                        85 "曾鈺庭/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q84
      2 "徐富癸/男/民主進步黨"          56 "吳媚宮/女/中華聯合黨"                73 "何秋葺/女/人民最大黨"
      84 "蘇孟淳/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q85
      2 "徐富癸/男/民主進步黨"          56 "吳媚宮/女/中華聯合黨"                73 "何秋葺/女/人民最大黨"
      84 "蘇孟淳/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q86
      1 "黃建賓/男/中國國民黨"          2 "賴坤成/男/民主進步黨"                 79 "黃婉茹/女/小民參政歐巴桑聯盟"
      84 "許瑞貴/男/無"                 85 "劉櫂豪/男/無"                        86 "陳長宏/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"        99 "跳題"
/Q87
      1 "黃建賓/男/中國國民黨"          2 "賴坤成/男/民主進步黨"                 79 "黃婉茹/女/小民參政歐巴桑聯盟"
      84 "許瑞貴/男/無"                 85 "劉櫂豪/男/無"                        86 "陳長宏/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q88
      1 "傅崑萁/男/中國國民黨"          2 "張美慧/女/民主進步黨"                 75 "周玉梅/女/制度救世島"
      84 "許願神/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q89
      1 "傅崑萁/男/中國國民黨"          2 "張美慧/女/民主進步黨"                 75 "周玉梅/女/制度救世島"
      84 "許願神/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q90
      1 "吳政杰/男/中國國民黨"          2 "楊曜/男/民主進步黨"                   84 "陳慧娟/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q91
      1 "吳政杰/男/中國國民黨"          2 "楊曜/男/民主進步黨"                   84 "陳慧娟/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q92
      1 "林沛祥/男/中國國民黨"          2 "鄭文婷/女/民主進步黨"                 79 "謝海菁/女/小民參政歐巴桑聯盟"
      81 "邱紹祐/男/家庭基本收入"        83 "黃傑陽/男/無"                       85 "王醒之/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q93
      1 "林沛祥/男/中國國民黨"          2 "鄭文婷/女/民主進步黨"                 79 "謝海菁/女/小民參政歐巴桑聯盟"
      81 "邱紹祐/男/家庭基本收入"       83 "黃傑陽/男/無"                        85 "王醒之/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q94
      1 "鄭正鈐/男/中國國民黨"          2 "林志潔/女/民主進步黨"                 19 "邱顯智/男/時代力量"
      75 "趙福龍/男/制度救世島"         77 "楊清華/男/司法改革黨"                84 "柯美蘭/女/無"
      85 "王榮德/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q95
      1 "鄭正鈐/男/中國國民黨"          2 "林志潔/女/民主進步黨"                 19 "邱顯智/男/時代力量"
      75 "趙福龍/男/制度救世島"         77 "楊清華/男/司法改革黨"                84 "柯美蘭/女/無"
      85 "王榮德/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q96
      1 "張秀華/女/中國國民黨"          2 "王美惠/女/民主進步黨"                 71 "林智勳/男/台灣雙語無法黨"
      79 "陳玥妗/女/小民參政歐巴桑聯盟"  80 "蔡松益/男/復康聯盟黨"               84 "簡明廉/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q97
      1 "張秀華/女/中國國民黨"          2 "王美惠/女/民主進步黨"                 71 "林智勳/男/台灣雙語無法黨"
      79 "陳玥妗/女/小民參政歐巴桑聯盟" 80 "蔡松益/男/復康聯盟黨"                84 "簡明廉/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q98
      1 "陳玉珍/女/中國國民黨"          41 "尚文凱/女/台灣民眾黨"                84 "洪和成/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q99
      1 "陳玉珍/女/中國國民黨"          41 "尚文凱/女/台灣民眾黨"                84 "洪和成/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q100
      1 "陳雪生/男/中國國民黨"          2 "李問/男/民主進步黨"                   41 "曹爾凱/男/台灣民眾黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q101
      1 "陳雪生/男/中國國民黨"          2 "李問/男/民主進步黨"                   41 "曹爾凱/男/台灣民眾黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q102
      1 "張斯綱/男/中國國民黨"          2 "吳思瑤/女/民主進步黨"                 48 "賴宗育/男/人民民主黨"
      71 "陳執中/男/台灣雙語無法黨"     73 "張臺勝/男/人民最大黨"                74 "胡金城/男/人民最大黨"
      84 "許盛鋒/男/無"                 85 "侯漢廷/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"      99 "跳題"
/Q103
      1 "張斯綱/男/中國國民黨"          2 "吳思瑤/女/民主進步黨"                 48 "賴宗育/男/人民民主黨"
      71 "陳執中/男/台灣雙語無法黨"     73 "張臺勝/男/人民最大黨"                74 "胡金城/男/人民最大黨"
      84 "許盛鋒/男/無"                 85 "侯漢廷/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q104
      1 "游淑慧/女/中國國民黨"          2 "王世堅/男/民主進步黨"                 25 "郭啟源/男/中華統一促進黨"
      73 "何梅娟/女/人民最大黨"         75 "熊嘉玲/女/制度救世島"               
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q105
      1 "游淑慧/女/中國國民黨"          2 "王世堅/男/民主進步黨"                 25 "郭啟源/男/中華統一促進黨"
      73 "何梅娟/女/人民最大黨"         75 "熊嘉玲/女/制度救世島"               
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q106
      1 "王鴻薇/女/中國國民黨"          2 "謝佩芬/女/民主進步黨"                 42 "楊時睿/男/台灣維新"
      71 "陳一郎/男/台灣雙語無法黨"     73 "余新造/男/人民最大黨"                75 "高士恩/男/制度救世島"
      84 "陳源發/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q107
      1 "王鴻薇/女/中國國民黨"          2 "謝佩芬/女/民主進步黨"                 42 "楊時睿/男/台灣維新"
      71 "陳一郎/男/台灣雙語無法黨"     73 "余新造/男/人民最大黨"                75 "高士恩/男/制度救世島"
      84 "陳源發/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q108
      1 "李彥秀/女/中國國民黨"          2 "高嘉瑜/女/民主進步黨"                 17 "吳欣岱/女/台灣基進"
      59 "林秋彤/女/台灣整復師聯盟工黨" 75 "黃啟彬/男/制度救世島"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q109
      1 "李彥秀/女/中國國民黨"          2 "高嘉瑜/女/民主進步黨"                 17 "吳欣岱/女/台灣基進"
      59 "林秋彤/女/台灣整復師聯盟工黨" 75 "黃啟彬/男/制度救世島"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q110
      1 "鍾小平/男/中國國民黨"          2 "吳沛憶/女/民主進步黨"                 38 "許敬民/男/合一行動聯盟"
      76 "張華特/男/台灣麻將最大黨"     77 "李慧曦/女/司法改革黨"                78 "蘇諍/男/經濟黨"
      84 "于美人/女/無"                 85 "林志成/男/無"                        86 "陳燕玉/女/無"
      87 "孫智麗/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q111
      1 "鍾小平/男/中國國民黨"          2 "吳沛憶/女/民主進步黨"                 38 "許敬民/男/合一行動聯盟"
      76 "張華特/男/台灣麻將最大黨"     77 "李慧曦/女/司法改革黨"                78 "蘇諍/男/經濟黨"
      84 "于美人/女/無"                 85 "林志成/男/無"                        86 "陳燕玉/女/無"
      87 "孫智麗/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q112
      1 "羅智強/男/中國國民黨"          24 "苗博雅/女/社會民主黨"                42 "朱翊銘/男/台灣維新"
      71 "崔建章/男/台灣雙語無法黨"     75 "張雪卿/女/制度救世島"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q113
      1 "羅智強/男/中國國民黨"          24 "苗博雅/女/社會民主黨"                42 "朱翊銘/男/台灣維新"
      71 "崔建章/男/台灣雙語無法黨"     75 "張雪卿/女/制度救世島"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q114
      1 "徐巧芯/女/中國國民黨"          2 "許淑華/女/民主進步黨"                 42 "羅丹/男/台灣維新"
      53 "李承龍/男/中華愛國同心黨"     84 "陳韋安/男/無"                        
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q115
      1 "徐巧芯/女/中國國民黨"          2 "許淑華/女/民主進步黨"                 42 "羅丹/男/台灣維新"
      53 "李承龍/男/中華愛國同心黨"     84 "陳韋安/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q116
      1 "賴士葆/男/中國國民黨"          2 "王閔生/男/民主進步黨"                 41 "張其祿/男/台灣民眾黨"
      42 "劉佩玲/女/台灣維新"           67 "胡之壯/男/興中同盟會"                79 "賴宣任/女/小民參政歐巴桑聯盟"
      84 "夏萬浪/男/無"                 85 "張維學/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q117
      1 "賴士葆/男/中國國民黨"          2 "王閔生/男/民主進步黨"                 41 "張其祿/男/台灣民眾黨"
      42 "劉佩玲/女/台灣維新"           67 "胡之壯/男/興中同盟會"                79 "賴宣任/女/小民參政歐巴桑聯盟"
      84 "夏萬浪/男/無"                 85 "張維學/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q118
      2 "邱議瑩/女/民主進步黨"          41 "曾尹儷/女/台灣民眾黨"                73 "劉承智/男/人民最大黨"
      84 "林義迪/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q119
      2 "邱議瑩/女/民主進步黨"          41 "曾尹儷/女/台灣民眾黨"                73 "劉承智/男/人民最大黨"
      84 "林義迪/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q120
      1 "曹桓榮/男/中國國民黨"          2 "邱志偉/男/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q121
      1 "曹桓榮/男/中國國民黨"          2 "邱志偉/男/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q122
      1 "李眉蓁/女/中國國民黨"          2 "李柏毅/男/民主進步黨"                 76 "郭璽/男/台灣麻將最大黨"
      84 "張正達/男/無"                 85 "陳銓霖/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q123
      1 "李眉蓁/女/中國國民黨"          2 "李柏毅/男/民主進步黨"                 76 "郭璽/男/台灣麻將最大黨"
      84 "張正達/男/無"                 85 "陳銓霖/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q124
      1 "陳若翠/女/中國國民黨"          2 "林岱樺/女/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q125
      1 "陳若翠/女/中國國民黨"          2 "林岱樺/女/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q126
      1 "黃柏霖/男/中國國民黨"          2 "李昆澤/男/民主進步黨"                 79 "張芳愉/女/小民參政歐巴桑聯盟"
      84 "楊椒喬/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q127
      1 "黃柏霖/男/中國國民黨"          2 "李昆澤/男/民主進步黨"                 79 "張芳愉/女/小民參政歐巴桑聯盟"
      84 "楊椒喬/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q128
      1 "陳美雅/女/中國國民黨"          2 "黃捷/女/民主進步黨"                   44 "郭倍宏/男/喜樂島聯盟"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q129
      1 "陳美雅/女/中國國民黨"          2 "黃捷/女/民主進步黨"       44 "郭倍宏/男/喜樂島聯盟"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q130
      1 "鍾易仲/男/中國國民黨"          2 "許智傑/男/民主進步黨"                 77 "王和平統一/男/司法改革黨"
      84 "洪啟修/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"                                                                                
/Q131
      1 "鍾易仲/男/中國國民黨"          2 "許智傑/男/民主進步黨"                 77 "王和平統一/男/司法改革黨"
      84 "洪啟修/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q132
      1 "李明璇/女/中國國民黨"          2 "賴瑞隆/男/民主進步黨"                 13 "湛秀英/女/勞動黨"
      77 "李政憲/男/司法改革黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q133
      1 "李明璇/女/中國國民黨"          2 "賴瑞隆/男/民主進步黨"                 13 "湛秀英/女/勞動黨"
      77 "李政憲/男/司法改革黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q134
      1 "洪孟楷/男/中國國民黨"          2 "何博文/男/民主進步黨"                 25 "翁藤原/男/中華統一促進黨"
      42 "徐百弟/男/台灣維新"           75 "游清池/男/制度救世島"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q135
      1 "洪孟楷/男/中國國民黨"          2 "何博文/男/民主進步黨"                 25 "翁藤原/男/中華統一促進黨"
      42 "徐百弟/男/台灣維新"           75 "游清池/男/制度救世島"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q136
      2 "林淑芬/女/民主進步黨"          25 "何淯笙/男/中華統一促進黨"            41 "李有宜/女/台灣民眾黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q137
      2 "林淑芬/女/民主進步黨"          25 "何淯笙/男/中華統一促進黨"            41 "李有宜/女/台灣民眾黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q138
      1 "蔡明堂/男/中國國民黨"          2 "李坤城/男/民主進步黨"                 84 "陳東雲/男/無"
      85 "蘇卿彥/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q139
      1 "蔡明堂/男/中國國民黨"          2 "李坤城/男/民主進步黨"                 84 "陳東雲/男/無"
      85 "蘇卿彥/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q140
      1 "蔣欣璋/男/中國國民黨"          2 "吳秉叡/男/民主進步黨"                 75 "邱吉均/男/制度救世島"
      84 "蘇輝湟/男/無"                 85 "洪懿馥/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q141
      1 "蔣欣璋/男/中國國民黨"          2 "吳秉叡/男/民主進步黨"                 75 "邱吉均/男/制度救世島"
      84 "蘇輝湟/男/無"                 85 "洪懿馥/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q142
      1 "洪佳君/女/中國國民黨"          2 "蘇巧慧/女/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q143
      1 "洪佳君/女/中國國民黨"          2 "蘇巧慧/女/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q144
      1 "林國春/男/中國國民黨"          2 "張宏陸/男/民主進步黨"                 77 "黃淑珍/女/司法改革黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q145
      1 "林國春/男/中國國民黨"          2 "張宏陸/男/民主進步黨"                 77 "黃淑珍/女/司法改革黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q146
      1 "葉元之/男/中國國民黨"          2 "羅致政/男/民主進步黨"                 79 "劉書婷/女/小民參政歐巴桑聯盟"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q147
      1 "葉元之/男/中國國民黨"          2 "羅致政/男/民主進步黨"                 79 "劉書婷/女/小民參政歐巴桑聯盟"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q148
      1 "張智倫/男/中國國民黨"          2 "吳崢/男/民主進步黨"                   41 "邱臣遠/男/台灣民眾黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q149
      1 "張智倫/男/中國國民黨"          2 "吳崢/男/民主進步黨"                   41 "邱臣遠/男/台灣民眾黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q150
      1 "林德福/男/中國國民黨"          2 "莊銘淵/男/民主進步黨"                 42 "陳愷寧/女/台灣維新"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q151
      1 "林德福/男/中國國民黨"          2 "莊銘淵/男/民主進步黨"                 42 "陳愷寧/女/台灣維新"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q152
      1 "林金結/男/中國國民黨"          2 "吳琪銘/男/民主進步黨"                 73 "孟藹倫/女/人民最大黨"
      80 "袁興/男/復康聯盟黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q153
      1 "林金結/男/中國國民黨"          2 "吳琪銘/男/民主進步黨"                 73 "孟藹倫/女/人民最大黨"
      80 "袁興/男/復康聯盟黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q154
      1 "羅明才/男/中國國民黨"          2 "曾柏瑜/女/民主進步黨"                 52 "陳聖/男/中華婦女黨"
      73 "張家榛/女/人民最大黨"         75 "魏趨安/男/制度救世島"                84 "鄭添泉/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q155
      1 "羅明才/男/中國國民黨"          2 "曾柏瑜/女/民主進步黨"                 52 "陳聖/男/中華婦女黨"
      73 "張家榛/女/人民最大黨"         75 "魏趨安/男/制度救世島"                84 "鄭添泉/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q156
      1 "廖先翔/男/中國國民黨"          2 "賴品妤/女/民主進步黨"                 42 "陳長志/男/台灣維新"
      71 "李佳蒨/女/台灣雙語無法黨"     84 "黃瑞傳/男/無"                        85 "楊木火/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q157
      1 "廖先翔/男/中國國民黨"          2 "賴品妤/女/民主進步黨"                 42 "陳長志/男/台灣維新"
      71 "李佳蒨/女/台灣雙語無法黨"     84 "黃瑞傳/男/無"                        85 "楊木火/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q158
      2 "蔡其昌/男/民主進步黨"          41 "蔡壁如/女/台灣民眾黨"                84 "賴信全/男/無"
      85 "劉燈鐘/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q159
      2 "蔡其昌/男/民主進步黨"          41 "蔡壁如/女/台灣民眾黨"                84 "賴信全/男/無"
      85 "劉燈鐘/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q160
      1 "顏寬恆/男/中國國民黨"          2 "林靜儀/女/民主進步黨"                 61 "洪麗華/女/司法正義黨"
      84 "紀銘修/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q161
      1 "顏寬恆/男/中國國民黨"          2 "林靜儀/女/民主進步黨"                 61 "洪麗華/女/司法正義黨"
      84 "紀銘修/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q162
      1 "楊瓊瓔/女/中國國民黨"          2 "謝子涵/女/民主進步黨"                 77 "張炯春/男/司法改革黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q163
      1 "楊瓊瓔/女/中國國民黨"          2 "謝子涵/女/民主進步黨"                 77 "張炯春/男/司法改革黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q164
      1 "廖偉翔/男/中國國民黨"          2 "張廖萬堅/男/民主進步黨"               71 "李海碩/男/台灣雙語無法黨"
      72 "林中翊/男/台灣雙語無法黨"     85 "陳志彬/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q165
      1 "廖偉翔/男/中國國民黨"          2 "張廖萬堅/男/民主進步黨"               71 "李海碩/男/台灣雙語無法黨"
      72 "林中翊/男/台灣雙語無法黨" 85 "陳志彬/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q166
      1 "黃健豪/男/中國國民黨"          2 "莊競程/男/民主進步黨"                 25 "林澤培/女/中華統一促進黨"
      71 "謝旻汎/男/台灣雙語無法黨"     77 "彭振芳/男/司法改革黨"                79 "蔡善雯/女/小民參政歐巴桑聯盟"
      84 "苗豐隆/男/無"                 85 "陳維新/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q167
      1 "黃健豪/男/中國國民黨"          2 "莊競程/男/民主進步黨"                 25 "林澤培/女/中華統一促進黨"
      71 "謝旻汎/男/台灣雙語無法黨"     77 "彭振芳/男/司法改革黨"                79 "蔡善雯/女/小民參政歐巴桑聯盟"
      84 "苗豐隆/男/無"                 85 "陳維新/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q168
      1 "羅廷瑋/男/中國國民黨"          2 "江肇國/男/民主進步黨"                 25 "黃千庭/女/中華統一促進黨"
      84 "賀姿華/女/無"                 85 "紀文清/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q169
      1 "羅廷瑋/男/中國國民黨"          2 "江肇國/男/民主進步黨"                 25 "黃千庭/女/中華統一促進黨"
      84 "賀姿華/女/無"                 85 "紀文清/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q170
      1 "林家興/男/中國國民黨"          2 "何欣純/女/民主進步黨"                 77 "林振東/男/司法改革黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q171
      1 "林家興/男/中國國民黨"          2 "何欣純/女/民主進步黨"                 77 "林振東/男/司法改革黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q172
      1 "江啟臣/男/中國國民黨"          2 "謝志忠/男/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q173
      1 "江啟臣/男/中國國民黨"          2 "謝志忠/男/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q174
      1 "周宏昌/男/中國國民黨"          2 "賴惠員/女/民主進步黨"                 25 "林芳竹/女/中華統一促進黨"
      80 "蔡承攸/男/復康聯盟黨"         84 "侯陸太/男/無"                        85 "魏耀乾/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q175
      1 "周宏昌/男/中國國民黨"          2 "賴惠員/女/民主進步黨"                 25 "林芳竹/女/中華統一促進黨"
      80 "蔡承攸/男/復康聯盟黨"         84 "侯陸太/男/無"                        85 "魏耀乾/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q176
      2 "郭國文/男/民主進步黨"          73 "詹秋嫻/女/人民最大黨"                84 "陳昆和/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q177
      2 "郭國文/男/民主進步黨"          73 "詹秋嫻/女/人民最大黨"                84 "陳昆和/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q178
      1 "姚正玉/女/中國國民黨"          2 "陳亭妃/女/民主進步黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q179
      1 "姚正玉/女/中國國民黨"          2 "陳亭妃/女/民主進步黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q180
      2 "林宜瑾/女/民主進步黨"          77 "劉清田/男/司法改革黨"                84 "李全教/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q181
      2 "林宜瑾/女/民主進步黨"          77 "劉清田/男/司法改革黨"                84 "李全教/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q182
      2 "林俊憲/男/民主進步黨"          72 "蕭燐洪/男/台灣雙語無法黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q183
      2 "林俊憲/男/民主進步黨"          72 "蕭燐洪/男/台灣雙語無法黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q184
      1 "陳以信/男/中國國民黨"          2 "王定宇/男/民主進步黨"                 84 "陳永和/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q185
      1 "陳以信/男/中國國民黨"          2 "王定宇/男/民主進步黨"                 84 "陳永和/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q186
      1 "牛煦庭/男/中國國民黨"          2 "鄭運鵬/男/民主進步黨"                 84 "馬治薇/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q187
      1 "牛煦庭/男/中國國民黨"          2 "鄭運鵬/男/民主進步黨"                 84 "馬治薇/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q188
      1 "涂權吉/男/中國國民黨"          2 "黃世杰/男/民主進步黨"                 25 "陳志豪/男/中華統一促進黨"
      84 "王思玟/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q189
      1 "涂權吉/男/中國國民黨"          2 "黃世杰/男/民主進步黨"                 25 "陳志豪/男/中華統一促進黨"
      84 "王思玟/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q190
      1 "魯明哲/男/中國國民黨"          2 "彭俊豪/男/民主進步黨"                 3 "游智彬/男/新黨"
      75 "戴浙/男/制度救世島"           79 "徐鶯慈/女/小民參政歐巴桑聯盟"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q191
      1 "魯明哲/男/中國國民黨"          2 "彭俊豪/男/民主進步黨"                 3 "游智彬/男/新黨"
      75 "戴浙/男/制度救世島"           79 "徐鶯慈/女/小民參政歐巴桑聯盟"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q192
      1 "萬美玲/女/中國國民黨"          2 "范綱祥/男/民主進步黨"                 81 "甘乃迪/男/台灣國民黨"
      84 "黃明莉/女/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q193
      1 "萬美玲/女/中國國民黨"          2 "范綱祥/男/民主進步黨"                 81 "甘乃迪/男/台灣國民黨"
      84 "黃明莉/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q194
      1 "呂玉玲/女/中國國民黨"          2 "劉仁照/男/民主進步黨"                 41 "賴香伶/女/台灣民眾黨"
      77 "易乃文/男/司法改革黨"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q195
      1 "呂玉玲/女/中國國民黨"          2 "劉仁照/男/民主進步黨"                 41 "賴香伶/女/台灣民眾黨"
      77 "易乃文/男/司法改革黨"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q196
      1 "邱若華/女/中國國民黨"          41 "李慕妍/女/台灣民眾黨"                73 "翁紹庭/女/人民最大黨"
      80 "劉睿宸/男/復康聯盟黨"         84 "葉堂宇/男/無"                        85 "趙正宇/男/無"
      88 "平地原住民"                   89 "山地原住民"                         90 "沒有投票權"  91 "不領票"
      92 "還沒決定"                     93 "不會去投"                            94 "投廢票"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q197
      1 "邱若華/女/中國國民黨"          41 "李慕妍/女/台灣民眾黨"                73 "翁紹庭/女/人民最大黨"
      80 "劉睿宸/男/復康聯盟黨"         84 "葉堂宇/男/無"                        85 "趙正宇/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q198
      1 "黃仁/男/中國國民黨"            2 "鄭天財 Sra Kacaw/男/中國國民黨"      3 "陳瑩/女/民主進步黨"
      4 "米甘幹 理佛克/男/新黨"        7 "陳國榮/男/台灣維新"                          9 "陳政宗/男/無"                  
      10 "忠仁 達祿斯/男/無"            11 "高美珠/女/無"                                  12 "吳建智咖啡哥/男/無"
      90 "沒有投票權"                      91 "不領票"
      92 "還沒決定"                         93 "不會去投"                                        94 "投廢票"
      96 "看情形"                            98 "不知道"                 95 "拒答"             99 "跳題"
/Q199
      1 "黃仁/男/中國國民黨"            2 "鄭天財 Sra Kacaw/男/中國國民黨"      3 "陳瑩/女/民主進步黨"
      4 "米甘幹 理佛克/男/新黨"        7 "陳國榮/男/台灣維新"                          9 "陳政宗/男/無"                  
      10 "忠仁 達祿斯/男/無"            11 "高美珠/女/無"                                  12 "吳建智咖啡哥/男/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q200
      1 "孔文吉/男/中國國民黨"          2 "盧縣一/男/中國國民黨"                 3 "伍麗華 Saidhai Tahovecahe/女/民主進步黨"
      6 "胡黃廣文/男/台灣民眾黨"       8 "高畹芯/女/司法改革黨"                 9 "張子孝/男/無"
      10 "高金素梅/女/無"                 11 "林果/女/無"                                 12 "林世偉/男/無"
      13 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
      90 "沒有投票權"                      91 "不領票"
      92 "還沒決定"                         93 "不會去投"                                        94 "投廢票"
      96 "看情形"                            98 "不知道"                 95 "拒答"             99 "跳題"
/Q201
      1 "孔文吉/男/中國國民黨"          2 "盧縣一/男/中國國民黨"                 3 "伍麗華 Saidhai Tahovecahe/女/民主進步黨"
      6 "胡黃廣文/男/台灣民眾黨"       8 "高畹芯/女/司法改革黨"                 9 "張子孝/男/無"
      10 "高金素梅/女/無"                 11 "林果/女/無"                                 12 "林世偉/男/無"
      13 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
      96 "看情形"                       98 "不知道"                              95 "拒答"       99 "跳題"
/Q202
      1 "國民黨"          2 "民進黨"          4 "親民黨"          9 "綠黨"             13 "勞動黨"
      17 "台灣基進"       19 "時代力量"       25 "中華統一促進黨" 37 "國會政黨聯盟"    38 "合一行動聯盟"
      39 "安定力量"       40 "宗教聯盟"       41 "台灣民眾黨"     42 "台灣維新"        43 "台澎黨"
      44 "喜樂島聯盟"     45 "一邊一國行動黨" 72 "無黨籍"         
      89 "沒領票"         91 "忘了"           92 "無投票權"       93 "沒有去投"        94 "投廢票"
      95 "拒答"           99 "跳題"
/Q203
      1 "國民黨"              2 "民進黨"          3 "新 黨"           4 "親民黨"           6 "台聯"
      9 "台灣綠黨"            17 "台灣基進"       19 "時代力量"       25 "中華統一促進黨"  41 "台灣民眾黨"
      42 "台灣維新"           71 "台灣雙語無法黨" 73 "人民最大黨"     75 "制度救世島"      77 "司法改革黨"
      79 "小民參政歐巴桑聯盟" 
      89 "不領票"             92 "還沒決定"       94 "投廢票"         96 "很難說"          98 "不知道"
      95 "拒答"               99 "跳題"
/Q204
      1 "國民黨"          2 "民進黨"           3 "新黨"            4 "親民黨"          6 "台聯"
      9 "綠黨"            13 "勞動黨"          17 "台灣基進"       19 "時代力量"       25 "中華統一促進黨"
      37 "國會政黨聯盟"   38 "合一行動聯盟"    39 "安定力量"       40 "宗教聯盟"       41 "台灣民眾黨"
      42 "台灣維新"       43 "台澎黨"          44 "喜樂島聯盟"     45 "一邊一國行動黨"
      89 "沒領票"         91 "忘了"            92 "無投票權"       94 "投廢票"         95 "拒答"           
      99 "跳題"
/Q205
      0 "非常不喜歡"      5 "普通"       10 "非常喜歡"
      95 "拒答"           98 "不知道"
/Q206
      0 "非常不喜歡"      5 "普通"       10 "非常喜歡"
      95 "拒答"           98 "不知道"
/Q207
      0 "非常不喜歡"      5 "普通"       10 "非常喜歡"
      95 "拒答"           98 "不知道"
/Q208
      0 "非常不喜歡"      5 "普通"       10 "非常喜歡"
      95 "拒答"           98 "不知道"    99 "跳題"
/Q209
      0 "非常不喜歡"      5 "普通"       10 "非常喜歡"
      95 "拒答"           98 "不知道"    99 "跳題"
/Q210
      0 "非常不喜歡"      5 "普通"       10 "非常喜歡"
      95 "拒答"           98 "不知道"    99 "跳題"
/Q211
      1 "柯文哲與吳欣盈"  2 "賴清德與蕭美琴"   3 "侯友宜與趙少康"
      89 "不領票"         92 "還沒決定"        93 "不會去投"       94 "投廢票"
      96 "看情形"         98 "不知道"          95 "拒答"
/Q212
      1 "柯文哲與吳欣盈"  2 "賴清德與蕭美琴"   3 "侯友宜與趙少康"
      96 "看情形"         97 "無意見"          98 "不知道"         95 "拒答"
/Q213
      1 "柯文哲與吳欣盈"  2 "賴清德與蕭美琴"   3 "侯友宜與趙少康"
      96 "看情形"         97 "無意見"          98 "不知道"         95 "拒答"
/Q214
      1 "宋楚瑜與余湘"    2 "韓國瑜與張善政"   3 "蔡英文與賴清德"
      89 "沒領票"         91 "忘了"            92 "無投票權"       93 "沒有去投"
      94 "投廢票"         95 "拒答"
/Q215
      1 "兩岸關係"      2 "教育政策"       3 "年金改革"     4 "經濟發展"
      5 "食品安全"      6 "能源政策"       7 "勞工政策"      8 "司法改革"
      9 "民生問題"      10 "就業問題"      11 "藍綠惡鬥"     12 "交通問題"
      13 "治安問題"     14 "轉型正義"      15 "外交問題"     16 "低薪問題"
      17 "社會福利"     18 "居住正義"      19 "兩性平權"     20 "不當黨產"
      21 "貪污問題"     22 "國民素質"      23 "國家團結"     24 "財政問題"
      25 "核汙染食品"   26 "特赦陳水扁"    27 "婚姻平權"     28 "黨內事務"
      29 "公務員問題"   30 "國防問題"      31 "毒品問題"     32 "生育政策"
      33 "醫療體系問題" 34 "環境政策"      35 "農業問題"     36 "都市更新"
      37 "憲法改革"     38 "內閣改組"      39 "主權問題"     40 "貧富差距"
      41 "內政問題"     42 "城鄉差距"      43 "原住民議題"   44 "媒體改革"
      45 "長照問題"     46 "國民外交"      47 "國土規劃"     48 "民主問題"
      49 "廉能政府"     50 "人口問題"      51 "族群融合"     52 "科技發展"
      53 "環保問題"     54 "言論自由"      55 "動物保護"     56 "兵役制度"
      57 "軍人福利"     58 "稅收政策"      59 "公共衛生"     60 "安樂死立法"   
      61 "國家安全"    
      95 "拒答"           96 "很難說"          97 "無意見"         98 "不知道"           99 "跳題"
/Q216
      1 "柯文哲與吳欣盈"  2 "賴清德與蕭美琴"   3 "侯友宜與趙少康"
      91 "都可以"         92 "都不可以"
      95 "拒答"           96 "很難說"          97 "無意見"         98 "不知道"           99 "跳題"  
/Q217
      1 "有"              2 "沒有"             95 "拒答"           99 "跳題"  
/Q218
      1 "柯文哲"          2 "賴清德"           3 "侯友宜"
      91 "都好"           92 "都不好"          93 "沒有收看"
      95 "拒答"           96 "很難說"          97 "無意見"         98 "不知道"           99 "跳題"  
/Q219
      1 "儘快統一"                            2 "儘快宣布獨立"                         
      3 "維持現狀，以後走向統一"              4 "維持現狀，以後走向獨立"     
      5 "維持現狀，看情形再決定獨立或統一"    6 "永遠維持現狀"
      7 "已經是獨立的國家"                  8 "已經是統一的國家"  
      96 "很難說"      97 "無意見"            98 "不知道"      95 "拒答"
/Q220
      1 "國民黨"           2 "民進黨"        3 "新黨"            4 "親民黨"          5 "台聯"
      6 "都支持"           7 "都不支持"      8 "國民黨加民進黨"  9 "國民黨加新黨"    10 "國民黨加親民黨"
      12 "民進黨加親民黨"  16 "泛藍"         17 "泛綠"           18 "在野黨"         19 "選人不選黨"
      20 "綠黨"            21 "時代力量"     23 "社民黨"         26 "自由台灣黨"     28 "無黨團結聯盟"
      29 "中華統一促進黨"  34 "台灣工黨"     35 "台灣基進"       36 "青年中國黨"     37 "言論自由聯盟黨"
      38 "台灣民眾黨"      41 "喜樂島聯盟"   42 "台澎黨"         45 "台灣動物保護黨" 46 "小民參政歐巴桑聯盟"
      47 "金色力量黨"      48 "司法改革黨"
      96 "看情形"          97 "無意見"       98 "不知道"         95 "拒答"        
/Q221
      1 "非常支持"         2 "普普通通"      99 "跳題"
/Q222
      3 "偏國民黨"         4 "偏民進黨"      5 "偏新黨"          6 "偏親民黨"           7 "偏台聯"
      8 "都不偏"           12 "偏國民黨加親民黨"                 14 "偏民進黨加親民黨"  18 "偏泛藍"
      19 "偏泛綠"          20 "在野黨"       21 "選人不選黨"     23 "偏綠黨"            24 "偏時代力量"
      26 "偏社民黨"        29 "偏自由台灣黨" 31 "偏無黨團結聯盟" 32 "偏中華統一促進黨"  33 "偏軍公教聯盟黨"
      34 "偏信心希望聯盟"  35 "偏綠黨社會民主黨聯盟"             36 "偏台灣獨立黨"      37 "偏台灣工黨"
      38 "偏台灣基進"      39 "偏青年中國黨" 40 "偏言論自由聯盟黨"                      41 "偏台灣民眾黨"
      42 "偏國會政黨聯盟"  43 "偏一邊一國行動黨"                 44 "偏喜樂島聯盟"      45 "偏台澎黨"
      48 "偏台灣動物保護黨"                  49 "偏小民參政歐巴桑聯盟"                  50 "偏金色力量黨"
      51 "偏司法改革黨"
      96 "看情形"         97 "無意見"         98 "不知道"         95 "拒答"          99 "跳題" 
/Q223
      1 "台灣人"          2 "都是"               3 "中國人"
      96 "看情形"         97 "無意見"         98 "不知道"         95 "拒答"
/Q224
      95 "拒答"    
/Q225
      1 "不識字及未入學"    2 "小學"          3 "國、初中"          4 "高中、職"        5 "專科"
      6 "大學"              7 "研究所及以上"
      95 "拒答"
/Q226
      1 "本省客家人"        2 "本省閩南人"     3 "大陸各省市人"      4 "原住民"         5 "外籍人士"
      6 "大陸新住民"        7 "外國新住民"
      95 "拒答"             98 "不知道"
/Q227
      1 "本省客家人"        2 "本省閩南人"     3 "大陸各省市人"      4 "原住民"         5 "外籍人士"
      6 "大陸新住民"        7 "外國新住民"
      95 "拒答"             98 "不知道"
/Q228
      101 "民意代表"         102 "政府行政主管"           103 "公營事業主管"   104 "民營事業主管"
      105 "民營事業公司負責人(自營商人)，有雇用人"
      106 "民營事業公司負責人(自營商人)，沒有雇用人"
      201 "政府部門研究人員(科學家)"                    202 "私人部門研究人員(科學家)"
      203 "公立醫療單位醫事技術人員（醫師、藥師、護士、醫療人員）"
      204 "非公立醫療單位醫事技術人員（醫師、藥師、護士、醫療人員）"
      205 "會計師"           206 "公立教育機構教師"       207 "私立教育機構教師"
      208 "法官、書記官、檢察官、司法官"                  209 "律師"             
      210 "宗教工作者"       211 "藝術工作者（演員、表演工作者、攝影師）"      212 "文字工作者(作家、記者、劇作家)"
      213 "公營事業工程師(機師)"                          214 "民營事業工程師(機師)"             
      215 "職業運動專業人士"
      301 "政府單位與公營事業部門職員"                302 "民營事業職員"
      303 "買賣業務人員"                                       401 "服務、餐旅人員(含攤販、個人服務、計程車司機)"
      501 "農林漁牧"
      601 "政府單位與公營事業部門勞工"                 602 "民營事業勞工"
      701 "學生"                                                    801 "軍警調查局人員"
      901 "家管，沒有做家庭代工"                          902 "家管，有做家庭代工"
      903 "家管，家裡有事業，有幫忙但未領薪水"
      904 "家管，家裡有事業，有幫忙且領薪水"
      905 "失業者"           906 "退休者"                    911 "一直無業"     
      907 "無正式職業，但有其他收入"
      995 "拒答"     
/Q229
      101 "民代"              102 "政府行政主管"              103 "公營事業主管"   104 "民營事業主管"
      105 "民營事業公司負責人(自營商人)，有雇用人"  106 "民營事業公司負責人(自營商人)，沒有雇用人"
      201 "政府部門研究人員(科學家)"                         202 "私人部門研究人員(科學家)"
      203 "公立醫療單位醫事技術人員(醫師、藥師、護士、醫療人員)"
      204 "非公立醫療單位醫事技術人員(醫師、藥師、護士、醫療人員)"
      205 "會計師"              206 "公立教育機構教師"    207 "私立教育機構教師"
      208 "法官、書記官、檢察官、司法官"                  209 "律師"
      210 "宗教工作者"          211 "藝術工作者(演員、表演工作者、攝影師)"   212 "文字工作者(作家、記者、劇作家)"
      213 "公營事業工程師(機師)"                                214 "民營事業工程師(機師)"
      215 "職業運動專業人士"
      301 "政府單位與公營事業部門職員"                    302 "民營事業職員"
      303 "買賣業務人員"                                           401 "服務、餐旅人員(含攤販、個人服務、計程車司機)"
      501 "農林漁牧"
      601 "政府單位與公營事業部門勞工"                    602 "民營事業勞工"
      701 "學生"                                          801 "軍警調查局人員"
      901 "配偶已去逝"      902 "沒有配偶(含已離異)"    907 "無正式職業，但有其他收入"
      911 "一直無業"        
      995 "拒答"            999 "跳題"
/Q230
      101 "民代"               102 "政府行政主管"             103 "公營事業主管"   104 "民營事業主管"
      105 "民營事業公司負責人(自營商人)，有雇用人"   106 "民營事業公司負責人(自營商人)，沒有雇用人"
      201 "政府部門研究人員(科學家)"                         202 "私人部門研究人員(科學家)"
      203 "公立醫療單位醫事技術人員(醫師、藥師、護士、醫療人員)"
      204 "非公立醫療單位醫事技術人員(醫師、藥師、護士、醫療人員)"
      205 "會計師"               206 "公立教育機構教師"    207 "私立教育機構教師"
      208 "法官、書記官、檢察官、司法官"                  209 "律師"
      210 "宗教工作者"            211 "藝術工作者(演員、表演工作者、攝影師)"  212 "文字工作者(作家、記者、劇作家)"
      213 "公營事業工程師(機師)"                                214 "民營事業工程師(機師)"
      215 "職業運動專業人士"
      301 "政府單位與公營事業部門職員"                    302 "民營事業職員"
      303 "買賣業務人員"                                           401 "服務、餐旅人員(含攤販、個人服務、計程車司機)"
      501 "農林漁牧"
      601 "政府單位與公營事業部門勞工"                    602 "民營事業勞工"
      701 "學生"                                                        801 "軍警調查局人員"
      907 "無正式工作但有其他收入"
      995 "拒答"            999 "跳題"  /Q231
      1 "男性"       2 "女性"
/Q232
      1 "國語"       2 "台語"           3 "客語"       4 "國、台語"       5 "國、客語".

FIN .


fre all.



*[樣本類型].
COMPUTE TYPE=0.
IF (tel_a > 89) TYPE=2.
IF (tel_a < 90) TYPE=1.
VARIABLE LABELS TYPE "樣本類型".
VALUE LABELS TYPE 1 "市話訪問" 2 "手機訪問".
FRE TYPE.


*[建立性別新變數].
COMPUTE SEX=q231.
variable label sex "性別".
value label sex 1 "男性" 2 "女性".
cro q231 by sex.

*年齡.
compute AGE=0.
IF(DATE<=231231)age=112-Q224.
IF(DATE>231231)age=113-Q224.
recode age (20 thru 29=1)(30 thru 39=2)(40 thru 49=3)(50 thru 59=4) (60 thru hi=5)(lo thru 19=9).
var lab age "年齡".
val lab age 1 "20至29歲" 2 "30至39歲" 3 "40至49歲" 4 "50至59歲" 5 "60歲及以上" 9 "無反應".
cross q224 by age.



*教育程度.
compute EDU=q225.
recode edu (1 2=1) (3=2) (4=3) (5=4) (6 7=5) (ELSE=9).
var lab edu "教育程度".
val lab edu 1 "小學及以下" 2 "國、初中" 3 "高中、職" 4 "專科" 5 "大學及以上" 9 "無反應".
cross q225 by edu.




*[建立父親省籍新變數].
COMPUTE SENGI=Q226.
RECODE SENGI (1=1)(2=2)(3=3)(4=4)(5=5)(ELSE=9).
VARIABLE LABELS SENGI "父親省籍".
VALUE LABELS SENGI 1 "本省客家人" 2 "本省閩南人" 3 "大陸各省市人" 4 "原住民" 5 "外籍人士" 9 "無反應、其他".
CRO Q226 BY SENGI.

*[建立父親省籍7新變數].
COMPUTE SENGI7=Q226.
RECODE SENGI7 (1=1)(2=2)(3=3)(4=4)(5=5)(6=6)(7=7)(ELSE=9).
VARIABLE LABELS SENGI7 "父親省籍7分類".
VALUE LABELS SENGI7 1 "本省客家人" 2 "本省閩南人" 3 "大陸各省市人" 4 "原住民"  5"外籍人士" 6 "大陸新住民" 7 "外國新住民"9 "無反應".
CRO Q226 BY SENGI7.

*[建立母親省籍新變數].
COMPUTE MASENGI=Q227.
RECODE MASENGI (1=1)(2=2)(3=3)(4=4)(5=5)(ELSE=9).
VARIABLE LABELS MASENGI "母親省籍".
VALUE LABELS MASENGI 1 "本省客家人" 2 "本省閩南人" 3 "大陸各省市人" 4 "原住民" 5 "外籍人士" 9 "無反應、其他".
CRO Q227 BY MASENGI.

*[建立母親省籍7新變數].
COMPUTE MASENGI7=Q227.
RECODE MASENGI7 (1=1)(2=2)(3=3)(4=4)(5=5)(6=6)(7=7)(ELSE=9).
VARIABLE LABELS MASENGI7 "母親省籍7分類".
VALUE LABELS MASENGI7 1 "本省客家人" 2 "本省閩南人" 3 "大陸各省市人" 4 "原住民"  5"外籍人士" 6 "大陸新住民" 7 "外國新住民"9 "無反應".
CRO Q227 BY MASENGI7.



*[建立統獨立場新變數].
COMPUTE TONDU=Q219.                                                                                                                                                    
RECODE TONDU (1=1)(2=6)(3=2)(4=5)(5=3)(6=4)(7 8=9)(95 thru 98=9).                                                                                                            
VARIABLE LABELS TONDU "統獨立場".                                                                                                                                             
VALUE LABELS TONDU 1 "儘快統一" 2 "維持現狀，以後走向統一" 3 "維持現狀，看情形再決定獨立或統一" 4 "永遠維持現狀" 5 "維持現狀，以後走向獨立" 6 "儘快獨立" 9 "無反應、其他".            
CRO Q219 by TONDU.

*[政黨認同].  
COMPUTE PARTYID=0.                    
IF (Q220=1) PARTYID=1.                 
IF (Q220=6 and Q222=3) PARTYID=1.     
IF (Q220=7 and Q222=3) PARTYID=1.    
IF (Q220=10 and Q222=3) PARTYID=1.   
IF (Q220=18 and Q222=3) PARTYID=1.     
IF (Q220=19 and Q222=3) PARTYID=1.     
IF (Q220 gt 21 and Q222=3) PARTYID=1.  
IF (Q220=2) PARTYID=2.     
IF (Q220=6 and Q222=4) PARTYID=2.         
IF (Q220=7 and Q222=4) PARTYID=2.   
IF (Q220=8 and Q222=4) PARTYID=2.    
IF (Q220=18 and Q222=4) PARTYID=2.    
IF (Q220=19 and Q222=4) PARTYID=2.    
IF (Q220=17 and Q222=4) PARTYID=2.    
IF (Q220 gt 21 and Q222=4) PARTYID=2.    
IF (Q220=3) PARTYID=3.                 
IF (Q220=6 and Q222=5) PARTYID=3.      
IF (Q220=7 and Q222=5) PARTYID=3.   
IF (Q220=9 and Q222=5) PARTYID=3.   
IF (Q220=16 and Q222=5) PARTYID=3.   
IF (Q220=18 and Q222=5) PARTYID=3.   
IF (Q220=19 and Q222=5) PARTYID=3.   
IF (Q220 gt 21 and Q222=5) PARTYID=3.    
IF (Q220=4) PARTYID=4.                 
IF (Q220=6 and Q222=6) PARTYID=4.     
IF (Q220=7 and Q222=6) PARTYID=4.
IF (Q220=18 and Q222=6) PARTYID=4.
IF (Q220=19 and Q222=6) PARTYID=4.
IF (Q220 gt 21 and Q222=6) PARTYID=4.    
IF (Q220=5) PARTYID=5.  
IF (Q220=6 and Q222=7) PARTYID=5.      
IF (Q220=7 and Q222=7) PARTYID=5.      
IF (Q220=18 and Q222=7) PARTYID=5.      
IF (Q220=19 and Q222=7) PARTYID=5.      
IF (Q220 gt 21 and Q222=7) PARTYID=5.   
IF (Q220=21) PARTYID=6.  
IF (Q220=6 and Q222=24) PARTYID=6.  
IF (Q220=7 and Q222=24) PARTYID=6.  
IF (Q220=18 and Q222=24) PARTYID=6.  
IF (Q220=19 and Q222=24) PARTYID=6.  
IF (Q220 gt 21 and Q222=24) PARTYID=6.     
IF (Q220=38) PARTYID=7.
IF (Q220=6 and Q222=41) PARTYID=7.
IF (Q220=7 and Q222=41) PARTYID=7.
IF (Q220=18 and Q222=41) PARTYID=7.
IF (Q220=19 and Q222=41) PARTYID=7.
IF (Q220 gt 21 and Q222=41) PARTYID=7.     
IF ((Q220=6 or Q220=7 or Q220=8  or Q220=16 or Q220=18 or Q220=19  or Q220 gt 94) and (Q222=8 or Q222=10 or Q222=18 or Q222=20 or Q222=21 or Q222=96)) PARTYID=8.
RECODE PARTYID(0=9).
VARIABLE LABELS PARTYID "政黨認同".                                                                                        
VALUE LABELS PARTYID 1 "國民黨" 2 "民進黨" 3 "新黨" 4 "親民黨" 5 "台聯" 6"時代力量" 7 "台灣民眾黨" 8 "中立及看情形" 9 "無反應及其他政黨".  
FRE PARTYID. 


*政黨支持.
COMPUTE PARTY=0.                        
IF (Q220=1 AND Q221=1) PARTY=1.           
IF (Q220=1 AND Q221 GT 1) PARTY=2.
IF (Q220 GT 5 AND Q222=3) PARTY=3.
IF (Q220=2 AND Q221=1) PARTY=4.           
IF (Q220=2 AND Q221 GT 1) PARTY=5.        
IF (Q220 GT 5 AND Q222=4) PARTY=6.        
IF (Q220=3 AND Q221=1) PARTY=7.           
IF (Q220=3 AND Q221 GT 1) PARTY=8.        
IF (Q220 GT 5 AND Q222=5) PARTY=9.        
IF (Q220=4 AND Q221=1) PARTY=10.          
IF (Q220=4 AND Q221 GT 1) PARTY=11.       
IF (Q220 GT 5 AND Q222=6) PARTY=12.       
IF (Q220=5 AND Q221=1) PARTY=13.          
IF (Q220=5 AND Q221 GT 1) PARTY=14.       
IF (Q220 GT 5 AND Q222=7) PARTY=15.       
IF (Q220=21 AND Q221=1) PARTY=16.      
IF (Q220=21 AND Q221 GT 1) PARTY=17.     
IF (Q220 GT 5 AND Q222=24) PARTY=18.   
IF (Q220=38 AND Q221=1) PARTY=19.      
IF (Q220=38 AND Q221 GT 1) PARTY=20.     
IF (Q220 GT 5 AND Q222=41) PARTY=21.       
IF ((Q220=6 or Q220=7 or Q220=8 or Q220=16 or Q220=18 or Q220=19 or Q220=20 or Q220=25 or Q220=35) AND (Q222=8 or Q222=10 or Q222=18 or Q222=20 or Q222=21 or Q222=23 or Q222=25 or Q222=38)) PARTY=99.      
RECODE PARTY(0=99).
VARIABLE LABELS PARTY "政黨支持".                                                                                 
VALUE LABELS party 1 "非常支持國民黨" 2 "普通支持國民黨" 3 "偏國民黨" 4 "非常支持民進黨" 5 "普通支持民進黨" 6 "偏民進黨"          
              7 "非常支持新黨" 8 "普通支持新黨" 9 "偏新黨" 10 "非常支持親民黨" 11 "普通支持親民黨" 12 "偏親民黨"       
              13 "非常支持台聯" 14 "普通支持台聯" 15 "偏台聯"  16 "非常支持時代力量" 17 "普通支持時代力量" 18 "偏時代力量"
              19 "非常支持台灣民眾黨" 20 "普通支持台灣民眾黨" 21 "偏台灣民眾黨"  99 "中立、其他政黨及無反應".
FRE PARTY.


*[建立台灣人/中國人認同新變數].
COMPUTE T_Cidentity= Q223.
RECODE T_Cidentity (95 96 97 98=9).
VARIABLE LABELS T_Cidentity "台灣人/中國人認同".
VALUE LABELS T_Cidentity 1"台灣人" 2"都是" 3"中國人" 9"無反應".
FRE T_Cidentity.
CRO Q223 BY T_Cidentity.


*[建立職業五分類新變數].
COMPUTE AA=Q228.                                                                      
COMPUTE BB=Q229.                                                                      
COMPUTE CC=Q230.                                                                      
COMPUTE DD=Q230.                                                                      
COMPUTE EE=Q228.                                                                      
RECODE AA (101 THRU 106=1)(201 THRU 215=2)(301 THRU 303=3)(401=4)(501=5)             
           (601 602=6)(701=7)(801=8)(901 THRU 904=9)(906 905=10).                     
RECODE BB (101 THRU 215=1)(701 801=1) (301 THRU 401=2)(501=3)(601 602=4)(ELSE=5).    
RECODE CC (101 THRU 215=1)(701 801=1) (301 THRU 401=2)(501=3)(601 602=4)(ELSE=5).    
RECODE DD (101 102 103 201 203 206 208 213 301 601 801 207=1)                        
           (104 106 105 202 204 205 209 210 211 212 214 215=2)                        
           (302 303 401=3)(602=4)(501=5)(701=6)(901 THRU 904=7)(ELSE=8).              
RECODE EE (101 THRU 106=1)(201 THRU 215=2)(301 THRU 303=3)(401=4)(501=5)             
           (601 602=6)(701=7)(801=8)(901 THRU 904=9)(906=10).      
                   
COMPUTE CAREER=Q228.                                                                  
RECODE CAREER (101 THRU 215=1)(701 801=1)                                            
               (301 THRU 401=2)(501=3)(601 602=4)(ELSE=5).                            
IF (AA=9  AND BB=1) CAREER=1.                                                        
IF (AA=9  AND BB=2) CAREER=2.                                                        
IF (AA=9  AND BB=3) CAREER=3.                                                        
IF (AA=9  AND BB=4) CAREER=4.                                                        
IF (AA=9  AND BB>4) CAREER=5.                                                        
IF (AA=10 AND CC=1) CAREER=1.                                                        
IF (AA=10 AND CC=2) CAREER=2.                                                        
IF (AA=10 AND CC=3) CAREER=3.                                                        
IF (AA=10 AND CC=4) CAREER=4.                                                        
IF (AA=10 AND CC>4) CAREER=5.                                                        
VARIABLE LABELS CAREER "職業五分類".                                                 
VALUE LABELS CAREER 1 "高、中級白領" 2 "中低、低級白領" 3 "農林漁牧" 4 "藍領"  5 "無反應、其他".                      
FRE CAREER.


*[建立職業八分類新變數].
COMPUTE CAREER8=Q228.                                                                          
RECODE CAREER8 (101 102 103 201 203 206 208 213 301 601 801 207=1)                            
                (104 106 105 202 204 205 209 210 211 212 214 215=2)                            
                (302 303 401=3)(602=4)(501=5)(701=6)(901 THRU 904=7)                           
                (ELSE=8).                                                                      
IF (AA=10 AND DD=1) CAREER8=1.                                                                
IF (AA=10 AND DD=2) CAREER8=2.                                                                
IF (AA=10 AND DD=3) CAREER8=3.                                                                
IF (AA=10 AND DD=4) CAREER8=4.                                                                
IF (AA=10 AND DD=5) CAREER8=5.                                                                
IF (AA=10 AND DD=6) CAREER8=6.                                                                
IF (AA=10 AND DD=7) CAREER8=7.                                                                
IF (AA=10 AND DD>7) CAREER8=8.                                                                
VARIABLE LABELS CAREER8 "職業八分類".                                                         
VALUE LABELS CAREER8 1 "軍公教人員" 2 "私部門管理階層及專業人員" 3 "私部門職員"               
                4 "私部門勞工" 5 "農林漁牧" 6 "學生" 7 "家管" 8 "無反應、其他".                                  
FRE CAREER8.
DELETE VARIABLES AA BB CC DD EE.


*[建立地理區域新變數].
COMPUTE TOWNID=0.                                                                
COMPUTE AAA=100*Q2.
IF (Q3 NE 99) TOWNID=AAA+Q3.
IF (Q4 NE 99) TOWNID=AAA+Q4.
IF (Q5 NE 99) TOWNID=AAA+Q5.
IF (Q6 NE 99) TOWNID=AAA+Q6.
IF (Q7 NE 99) TOWNID=AAA+Q7.
IF (Q8 NE 99) TOWNID=AAA+Q8.
IF (Q9 NE 99) TOWNID=AAA+Q9.
IF (Q10 NE 99) TOWNID=AAA+Q10.
IF (Q11 NE 99) TOWNID=AAA+Q11.
IF (Q12 NE 99) TOWNID=AAA+Q12.
IF (Q13 NE 99) TOWNID=AAA+Q13.
IF (Q14 NE 99) TOWNID=AAA+Q14.
IF (Q15 NE 99) TOWNID=AAA+Q15.
IF (Q16 NE 99) TOWNID=AAA+Q16.
IF (Q17 NE 99) TOWNID=AAA+Q17.
IF (Q18 NE 99) TOWNID=AAA+Q18.
IF (Q19 NE 99) TOWNID=AAA+Q19.
IF (Q20 NE 99) TOWNID=AAA+Q20.
IF (Q21 NE 99) TOWNID=AAA+Q21.
IF (Q22 NE 99) TOWNID=AAA+Q22.
RECODE TOWNID (0=9999).                                                                                          
COMPUTE AREAR=TOWNID.                                                              
RECODE AREAR (201 THRU 299=7)(401 THRU 599=3)(700 THRU 899=4)(900 THRU 1099=5)                   
              (1300 THRU 1399=6)(1400 THRU 1599=7)(1600 THRU 1699=6)(1700 THRU 1799=2)
              (1800 THRU 1899=3)(2000 THRU 2199=5)(6300 THRU 6399=1)(6400 THRU 6499=6)                                 
              (6501 THRU 6506=1)(6507 THRU 6599=2)(6600 THRU 6699=4)(6700 THRU 6799=5)
              (6800 THRU 6899=3)(ELSE=9).                                                             
VARIABLE LABELS AREAR "地理區域".                                                   
VALUE LABELS AREAR 1 "大台北都會區" 2 "新北市基隆" 3 "桃竹苗" 4 "中彰投" 5 "雲嘉南" 6 "高屏澎" 7 "宜花東" 9 "無反應".                   
FRE AREAR.




*總統投票對象.
recode q211 (95 thru 98=99)(else=copy) into NQ211.
var lab nq211 "如果明天就是投票日，您會把票投給哪一組總統候選人?".
val lab nq211 1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴" 3 "侯友宜與趙少康"
             89 "不領票"      92 "還沒有決定"    93 "不會去投"   94 "投廢票"   99 "無反應".


*可能性當選之總統候選人.
recode q212 (95 thru 98=9)(else=copy) into NQ212.
var lab nq212 "您覺得哪一組總統候選人比較可能當選?".
val lab nq212 1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴" 3 "侯友宜與趙少康"
             9 "無反應".


*最不希望哪一組選總統.
recode q213 (95 thru 98=9)(else=copy) into NQ213.
var lab nq213 "您最不希望哪一組總統候選人當選".
val lab nq213 1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴" 3 "侯友宜與趙少康"
             9 "無反應".


*第一波波次語法.
compute WAVE=1.
var lab WAVE "波次".
*第二波波次語法.
compute WAVE=2.
var lab WAVE "波次".
*第三波波次語法.
compute WAVE=3.
var lab WAVE "波次".


val lab WAVE 1"第一波(R1)" 2"第二波(R2)" 3"第三波(R3)".
if (date<231229)wave=1.
if(date>231228 & date<240106)wave=2.
if(date>240105)wave=3.
fre wave.


compute Cand=0.

*宜蘭縣.
if (q52=01)cand=020101.
if (q52=02)cand=020102.
if (q52=17)cand=020117.
if (q52=41)cand=020141.
if (q52=75)cand=020175.
if (q52=84)cand=020184.
if (q52=88 and q198=01)cand=690101.
if (q52=88 and q198=02)cand=690102.
if (q52=88 and q198=03)cand=690103.
if (q52=88 and q198=04)cand=690104.
if (q52=88 and q198=07)cand=690107.
if (q52=88 and q198=09)cand=690109.
if (q52=88 and q198=10)cand=690110.
if (q52=88 and q198=11)cand=690111.
if (q52=88 and q198=12)cand=690112.
if (q52=89 and q200=01)cand=700101.
if (q52=89 and q200=02)cand=700102.
if (q52=89 and q200=03)cand=700103.
if (q52=89 and q200=06)cand=700106.
if (q52=89 and q200=08)cand=700108.
if (q52=89 and q200=09)cand=700109.
if (q52=89 and q200=10)cand=700110.
if (q52=89 and q200=11)cand=700111.
if (q52=89 and q200=12)cand=700112.
if (q52=89 and q200=13)cand=700113.
if (q52=92 or q52=96 or q52=98)cand=999992.
if (q52=90)cand=999990.
if (q52=91)cand=999991.
if (q52=93)cand=999993.
if (q52=94)cand=999994.
if (q52=95)cand=999995.

*桃園市第一選區.
if (q186=01)cand=680101.
if (q186=02)cand=680102.
if (q186=84)cand=680184.
if (q186=88 and q198=01)cand=690101.
if (q186=88 and q198=02)cand=690102.
if (q186=88 and q198=03)cand=690103.
if (q186=88 and q198=04)cand=690104.
if (q186=88 and q198=07)cand=690107.
if (q186=88 and q198=09)cand=690109.
if (q186=88 and q198=10)cand=690110.
if (q186=88 and q198=11)cand=690111.
if (q186=88 and q198=12)cand=690112.
if (q186=89 and q200=01)cand=700101.
if (q186=89 and q200=02)cand=700102.
if (q186=89 and q200=03)cand=700103.
if (q186=89 and q200=06)cand=700106.
if (q186=89 and q200=08)cand=700108.
if (q186=89 and q200=09)cand=700109.
if (q186=89 and q200=10)cand=700110.
if (q186=89 and q200=11)cand=700111.
if (q186=89 and q200=12)cand=700112.
if (q186=89 and q200=13)cand=700113.
if (q186=92 or q186=96 or q186=98)cand=999992.
if (q186=90)cand=999990.
if (q186=91)cand=999991.
if (q186=93)cand=999993.
if (q186=94)cand=999994.
if (q186=95)cand=999995.

*桃園市第二選區.
if (q188=01)cand=680201.
if (q188=02)cand=680202.
if (q188=25)cand=680225.
if (q188=84)cand=680284.
if (q188=88 and q198=01)cand=690101.
if (q188=88 and q198=02)cand=690102.
if (q188=88 and q198=03)cand=690103.
if (q188=88 and q198=04)cand=690104.
if (q188=88 and q198=07)cand=690107.
if (q188=88 and q198=09)cand=690109.
if (q188=88 and q198=10)cand=690110.
if (q188=88 and q198=11)cand=690111.
if (q188=88 and q198=12)cand=690112.
if (q188=89 and q200=01)cand=700101.
if (q188=89 and q200=02)cand=700102.
if (q188=89 and q200=03)cand=700103.
if (q188=89 and q200=06)cand=700106.
if (q188=89 and q200=08)cand=700108.
if (q188=89 and q200=09)cand=700109.
if (q188=89 and q200=10)cand=700110.
if (q188=89 and q200=11)cand=700111.
if (q188=89 and q200=12)cand=700112.
if (q188=89 and q200=13)cand=700113.
if (q188=92 or q188=96 or q188=98)cand=999992.
if (q188=90)cand=999990.
if (q188=91)cand=999991.
if (q188=93)cand=999993.
if (q188=94)cand=999994.
if (q188=95)cand=999995.

*桃園市第三選區.
if (q190=01)cand=680301.
if (q190=02)cand=680302.
if (q190=03)cand=680303.
if (q190=75)cand=680375.
if (q190=79)cand=680379.
if (q190=88 and q198=01)cand=690101.
if (q190=88 and q198=02)cand=690102.
if (q190=88 and q198=03)cand=690103.
if (q190=88 and q198=04)cand=690104.
if (q190=88 and q198=07)cand=690107.
if (q190=88 and q198=09)cand=690109.
if (q190=88 and q198=10)cand=690110.
if (q190=88 and q198=11)cand=690111.
if (q190=88 and q198=12)cand=690112.
if (q190=89 and q200=01)cand=700101.
if (q190=89 and q200=02)cand=700102.
if (q190=89 and q200=03)cand=700103.
if (q190=89 and q200=06)cand=700106.
if (q190=89 and q200=08)cand=700108.
if (q190=89 and q200=09)cand=700109.
if (q190=89 and q200=10)cand=700110.
if (q190=89 and q200=11)cand=700111.
if (q190=89 and q200=12)cand=700112.
if (q190=89 and q200=13)cand=700113.
if (q190=92 or q190=96 or q190=98)cand=999992.
if (q190=90)cand=999990.
if (q190=91)cand=999991.
if (q190=93)cand=999993.
if (q190=94)cand=999994.
if (q190=95)cand=999995.

*桃園市第四選區.
if (q192=01)cand=680401.
if (q192=02)cand=680402.
if (q192=81)cand=680481.
if (q192=84)cand=680484.
if (q192=88 and q198=01)cand=690101.
if (q192=88 and q198=02)cand=690102.
if (q192=88 and q198=03)cand=690103.
if (q192=88 and q198=04)cand=690104.
if (q192=88 and q198=07)cand=690107.
if (q192=88 and q198=09)cand=690109.
if (q192=88 and q198=10)cand=690110.
if (q192=88 and q198=11)cand=690111.
if (q192=88 and q198=12)cand=690112.
if (q192=89 and q200=01)cand=700101.
if (q192=89 and q200=02)cand=700102.
if (q192=89 and q200=03)cand=700103.
if (q192=89 and q200=06)cand=700106.
if (q192=89 and q200=08)cand=700108.
if (q192=89 and q200=09)cand=700109.
if (q192=89 and q200=10)cand=700110.
if (q192=89 and q200=11)cand=700111.
if (q192=89 and q200=12)cand=700112.
if (q192=89 and q200=13)cand=700113.
if (q192=92 or q192=96 or q192=98)cand=999992.
if (q192=90)cand=999990.
if (q192=91)cand=999991.
if (q192=93)cand=999993.
if (q192=94)cand=999994.
if (q192=95)cand=999995.

*桃園市第五選區.
if (q194=01)cand=680501.
if (q194=02)cand=680502.
if (q194=41)cand=680541.
if (q194=77)cand=680577.
if (q194=88 and q198=01)cand=690101.
if (q194=88 and q198=02)cand=690102.
if (q194=88 and q198=03)cand=690103.
if (q194=88 and q198=04)cand=690104.
if (q194=88 and q198=07)cand=690107.
if (q194=88 and q198=09)cand=690109.
if (q194=88 and q198=10)cand=690110.
if (q194=88 and q198=11)cand=690111.
if (q194=88 and q198=12)cand=690112.
if (q194=89 and q200=01)cand=700101.
if (q194=89 and q200=02)cand=700102.
if (q194=89 and q200=03)cand=700103.
if (q194=89 and q200=06)cand=700106.
if (q194=89 and q200=08)cand=700108.
if (q194=89 and q200=09)cand=700109.
if (q194=89 and q200=10)cand=700110.
if (q194=89 and q200=11)cand=700111.
if (q194=89 and q200=12)cand=700112.
if (q194=89 and q200=13)cand=700113.
if (q194=92 or q194=96 or q194=98)cand=999992.
if (q194=90)cand=999990.
if (q194=91)cand=999991.
if (q194=93)cand=999993.
if (q194=94)cand=999994.
if (q194=95)cand=999995.


*桃園市第六選區.
if (q196=01)cand=680601.
if (q196=41)cand=680641.
if (q196=73)cand=680673.
if (q196=80)cand=680680.
if (q196=84)cand=680684.
if (q196=85)cand=680685.
if (q196=88 and q198=01)cand=690101.
if (q196=88 and q198=02)cand=690102.
if (q196=88 and q198=03)cand=690103.
if (q196=88 and q198=04)cand=690104.
if (q196=88 and q198=07)cand=690107.
if (q196=88 and q198=09)cand=690109.
if (q196=88 and q198=10)cand=690110.
if (q196=88 and q198=11)cand=690111.
if (q196=88 and q198=12)cand=690112.
if (q196=89 and q200=01)cand=700101.
if (q196=89 and q200=02)cand=700102.
if (q196=89 and q200=03)cand=700103.
if (q196=89 and q200=06)cand=700106.
if (q196=89 and q200=08)cand=700108.
if (q196=89 and q200=09)cand=700109.
if (q196=89 and q200=10)cand=700110.
if (q196=89 and q200=11)cand=700111.
if (q196=89 and q200=12)cand=700112.
if (q196=89 and q200=13)cand=700113.
if (q196=92 or q196=96 or q196=98)cand=999992.
if (q196=90)cand=999990.
if (q196=91)cand=999991.
if (q196=93)cand=999993.
if (q196=94)cand=999994.
if (q196=95)cand=999995.

*新竹縣第一選區.   
if (q54=01)cand=040101.
if (q54=02)cand=040102.
if (q54=09)cand=040109.
if (q54=42)cand=040142.
if (q54=79)cand=040179.
if (q54=88 and q198=01)cand=690101.
if (q54=88 and q198=02)cand=690102.
if (q54=88 and q198=03)cand=690103.
if (q54=88 and q198=04)cand=690104.
if (q54=88 and q198=07)cand=690107.
if (q54=88 and q198=09)cand=690109.
if (q54=88 and q198=10)cand=690110.
if (q54=88 and q198=11)cand=690111.
if (q54=88 and q198=12)cand=690112.
if (q54=89 and q200=01)cand=700101.
if (q54=89 and q200=02)cand=700102.
if (q54=89 and q200=03)cand=700103.
if (q54=89 and q200=06)cand=700106.
if (q54=89 and q200=08)cand=700108.
if (q54=89 and q200=09)cand=700109.
if (q54=89 and q200=10)cand=700110.
if (q54=89 and q200=11)cand=700111.
if (q54=89 and q200=12)cand=700112.
if (q54=89 and q200=13)cand=700113.
if (q54=92 or q54=96 or q54=98)cand=999992.
if (q54=90)cand=999990.
if (q54=91)cand=999991.
if (q54=93)cand=999993.
if (q54=94)cand=999994.
if (q54=95)cand=999995.


*新竹縣第二選區. 
if (q56=01)cand=040201.
if (q56=02)cand=040202.
if (q56=19)cand=040219.
if (q56=88 and q198=01)cand=690101.
if (q56=88 and q198=02)cand=690102.
if (q56=88 and q198=03)cand=690103.
if (q56=88 and q198=04)cand=690104.
if (q56=88 and q198=07)cand=690107.
if (q56=88 and q198=09)cand=690109.
if (q56=88 and q198=10)cand=690110.
if (q56=88 and q198=11)cand=690111.
if (q56=88 and q198=12)cand=690112.
if (q56=89 and q200=01)cand=700101.
if (q56=89 and q200=02)cand=700102.
if (q56=89 and q200=03)cand=700103.
if (q56=89 and q200=06)cand=700106.
if (q56=89 and q200=08)cand=700108.
if (q56=89 and q200=09)cand=700109.
if (q56=89 and q200=10)cand=700110.
if (q56=89 and q200=11)cand=700111.
if (q56=89 and q200=12)cand=700112.
if (q56=89 and q200=13)cand=700113.
if (q56=92 or q56=96 or q56=98)cand=999992.
if (q56=90)cand=999990.
if (q56=91)cand=999991.
if (q56=93)cand=999993.
if (q56=94)cand=999994.
if (q56=95)cand=999995.


*苗栗縣第一選區.   
if (q58=02)cand=050102.
if (q58=84)cand=050184.
if (q58=88 and q198=01)cand=690101.
if (q58=88 and q198=02)cand=690102.
if (q58=88 and q198=03)cand=690103.
if (q58=88 and q198=04)cand=690104.
if (q58=88 and q198=07)cand=690107.
if (q58=88 and q198=09)cand=690109.
if (q58=88 and q198=10)cand=690110.
if (q58=88 and q198=11)cand=690111.
if (q58=88 and q198=12)cand=690112.
if (q58=89 and q200=01)cand=700101.
if (q58=89 and q200=02)cand=700102.
if (q58=89 and q200=03)cand=700103.
if (q58=89 and q200=06)cand=700106.
if (q58=89 and q200=08)cand=700108.
if (q58=89 and q200=09)cand=700109.
if (q58=89 and q200=10)cand=700110.
if (q58=89 and q200=11)cand=700111.
if (q58=89 and q200=12)cand=700112.
if (q58=89 and q200=13)cand=700113.
if (q58=92 or q58=96 or q58=98)cand=999992.
if (q58=90)cand=999990.
if (q58=91)cand=999991.
if (q58=93)cand=999993.
if (q58=94)cand=999994.
if (q58=95)cand=999995.

*苗栗縣第二選區.
if (q60=01)cand=050201.
if (q60=84)cand=050284.
if (q60=88 and q198=01)cand=690101.
if (q60=88 and q198=02)cand=690102.
if (q60=88 and q198=03)cand=690103.
if (q60=88 and q198=04)cand=690104.
if (q60=88 and q198=07)cand=690107.
if (q60=88 and q198=09)cand=690109.
if (q60=88 and q198=10)cand=690110.
if (q60=88 and q198=11)cand=690111.
if (q60=88 and q198=12)cand=690112.
if (q60=89 and q200=01)cand=700101.
if (q60=89 and q200=02)cand=700102.
if (q60=89 and q200=03)cand=700103.
if (q60=89 and q200=06)cand=700106.
if (q60=89 and q200=08)cand=700108.
if (q60=89 and q200=09)cand=700109.
if (q60=89 and q200=10)cand=700110.
if (q60=89 and q200=11)cand=700111.
if (q60=89 and q200=12)cand=700112.
if (q60=89 and q200=13)cand=700113.
if (q60=92 or q60=96 or q60=98)cand=999992.
if (q60=90)cand=999990.
if (q60=91)cand=999991.
if (q60=93)cand=999993.
if (q60=94)cand=999994.
if (q60=95)cand=999995.

*彰化縣第一選區.   
if (q62=01)cand=070101.
if (q62=02)cand=070102.
if (q62=84)cand=070184.
if (q62=88 and q198=01)cand=690101.
if (q62=88 and q198=02)cand=690102.
if (q62=88 and q198=03)cand=690103.
if (q62=88 and q198=04)cand=690104.
if (q62=88 and q198=07)cand=690107.
if (q62=88 and q198=09)cand=690109.
if (q62=88 and q198=10)cand=690110.
if (q62=88 and q198=11)cand=690111.
if (q62=88 and q198=12)cand=690112.
if (q62=89 and q200=01)cand=700101.
if (q62=89 and q200=02)cand=700102.
if (q62=89 and q200=03)cand=700103.
if (q62=89 and q200=06)cand=700106.
if (q62=89 and q200=08)cand=700108.
if (q62=89 and q200=09)cand=700109.
if (q62=89 and q200=10)cand=700110.
if (q62=89 and q200=11)cand=700111.
if (q62=89 and q200=12)cand=700112.
if (q62=89 and q200=13)cand=700113.
if (q62=92 or q62=96 or q62=98)cand=999992.
if (q62=90)cand=999990.
if (q62=91)cand=999991.
if (q62=93)cand=999993.
if (q62=94)cand=999994.
if (q62=95)cand=999995.

*彰化縣第二選區.
if (q64=01)cand=070201.
if (q64=02)cand=070202.
if (q64=88 and q198=01)cand=690101.
if (q64=88 and q198=02)cand=690102.
if (q64=88 and q198=03)cand=690103.
if (q64=88 and q198=04)cand=690104.
if (q64=88 and q198=07)cand=690107.
if (q64=88 and q198=09)cand=690109.
if (q64=88 and q198=10)cand=690110.
if (q64=88 and q198=11)cand=690111.
if (q64=88 and q198=12)cand=690112.
if (q64=89 and q200=01)cand=700101.
if (q64=89 and q200=02)cand=700102.
if (q64=89 and q200=03)cand=700103.
if (q64=89 and q200=06)cand=700106.
if (q64=89 and q200=08)cand=700108.
if (q64=89 and q200=09)cand=700109.
if (q64=89 and q200=10)cand=700110.
if (q64=89 and q200=11)cand=700111.
if (q64=89 and q200=12)cand=700112.
if (q64=89 and q200=13)cand=700113.
if (q64=92 or q64=96 or q64=98)cand=999992.
if (q64=90)cand=999990.
if (q64=91)cand=999991.
if (q64=93)cand=999993.
if (q64=94)cand=999994.
if (q64=95)cand=999995.

*彰化縣第三選區.   
if (q66=01)cand=070301.
if (q66=02)cand=070302.
if (q66=25)cand=070325.
if (q66=84)cand=070384.
if (q66=88 and q198=01)cand=690101.
if (q66=88 and q198=02)cand=690102.
if (q66=88 and q198=03)cand=690103.
if (q66=88 and q198=04)cand=690104.
if (q66=88 and q198=07)cand=690107.
if (q66=88 and q198=09)cand=690109.
if (q66=88 and q198=10)cand=690110.
if (q66=88 and q198=11)cand=690111.
if (q66=88 and q198=12)cand=690112.
if (q66=89 and q200=01)cand=700101.
if (q66=89 and q200=02)cand=700102.
if (q66=89 and q200=03)cand=700103.
if (q66=89 and q200=06)cand=700106.
if (q66=89 and q200=08)cand=700108.
if (q66=89 and q200=09)cand=700109.
if (q66=89 and q200=10)cand=700110.
if (q66=89 and q200=11)cand=700111.
if (q66=89 and q200=12)cand=700112.
if (q66=89 and q200=13)cand=700113.
if (q66=92 or q66=96 or q66=98)cand=999992.
if (q66=90)cand=999990.
if (q66=91)cand=999991.
if (q66=93)cand=999993.
if (q66=94)cand=999994.
if (q66=95)cand=999995.

*彰化縣第四選區.
if (q68=01)cand=070401.
if (q68=02)cand=070402.
if (q68=71)cand=070471.
if (q68=82)cand=070482.
if (q68=88 and q198=01)cand=690101.
if (q68=88 and q198=02)cand=690102.
if (q68=88 and q198=03)cand=690103.
if (q68=88 and q198=04)cand=690104.
if (q68=88 and q198=07)cand=690107.
if (q68=88 and q198=09)cand=690109.
if (q68=88 and q198=10)cand=690110.
if (q68=88 and q198=11)cand=690111.
if (q68=88 and q198=12)cand=690112.
if (q68=89 and q200=01)cand=700101.
if (q68=89 and q200=02)cand=700102.
if (q68=89 and q200=03)cand=700103.
if (q68=89 and q200=06)cand=700106.
if (q68=89 and q200=08)cand=700108.
if (q68=89 and q200=09)cand=700109.
if (q68=89 and q200=10)cand=700110.
if (q68=89 and q200=11)cand=700111.
if (q68=89 and q200=12)cand=700112.
if (q68=89 and q200=13)cand=700113.
if (q68=92 or q68=96 or q68=98)cand=999992.
if (q68=90)cand=999990.
if (q68=91)cand=999991.
if (q68=93)cand=999993.
if (q68=94)cand=999994.
if (q68=95)cand=999995.

*南投縣第一選區.   
if (q70=01)cand=080101.
if (q70=02)cand=080102.
if (q70=13)cand=080113.
if (q70=79)cand=080179.
if (q70=84)cand=080184.
if (q70=88 and q198=01)cand=690101.
if (q70=88 and q198=02)cand=690102.
if (q70=88 and q198=03)cand=690103.
if (q70=88 and q198=04)cand=690104.
if (q70=88 and q198=07)cand=690107.
if (q70=88 and q198=09)cand=690109.
if (q70=88 and q198=10)cand=690110.
if (q70=88 and q198=11)cand=690111.
if (q70=88 and q198=12)cand=690112.
if (q70=89 and q200=01)cand=700101.
if (q70=89 and q200=02)cand=700102.
if (q70=89 and q200=03)cand=700103.
if (q70=89 and q200=06)cand=700106.
if (q70=89 and q200=08)cand=700108.
if (q70=89 and q200=09)cand=700109.
if (q70=89 and q200=10)cand=700110.
if (q70=89 and q200=11)cand=700111.
if (q70=89 and q200=12)cand=700112.
if (q70=89 and q200=13)cand=700113.
if (q70=92 or q70=96 or q70=98)cand=999992.
if (q70=90)cand=999990.
if (q70=91)cand=999991.
if (q70=93)cand=999993.
if (q70=94)cand=999994.
if (q70=95)cand=999995.

*南投縣第二選區.
if (q72=01)cand=080201.
if (q72=02)cand=080202.
if (q72=84)cand=080284.
if (q72=88 and q198=01)cand=690101.
if (q72=88 and q198=02)cand=690102.
if (q72=88 and q198=03)cand=690103.
if (q72=88 and q198=04)cand=690104.
if (q72=88 and q198=07)cand=690107.
if (q72=88 and q198=09)cand=690109.
if (q72=88 and q198=10)cand=690110.
if (q72=88 and q198=11)cand=690111.
if (q72=88 and q198=12)cand=690112.
if (q72=89 and q200=01)cand=700101.
if (q72=89 and q200=02)cand=700102.
if (q72=89 and q200=03)cand=700103.
if (q72=89 and q200=06)cand=700106.
if (q72=89 and q200=08)cand=700108.
if (q72=89 and q200=09)cand=700109.
if (q72=89 and q200=10)cand=700110.
if (q72=89 and q200=11)cand=700111.
if (q72=89 and q200=12)cand=700112.
if (q72=89 and q200=13)cand=700113.
if (q72=92 or q72=96 or q72=98)cand=999992.
if (q72=90)cand=999990.
if (q72=91)cand=999991.
if (q72=93)cand=999993.
if (q72=94)cand=999994.
if (q72=95)cand=999995.

*雲林縣第一選區.   
if (q74=01)cand=090101.
if (q74=02)cand=090102.
if (q74=25)cand=090125.
if (q74=70)cand=090170.
if (q74=84)cand=090184.
if (q74=85)cand=090185.
if (q74=88 and q198=01)cand=690101.
if (q74=88 and q198=02)cand=690102.
if (q74=88 and q198=03)cand=690103.
if (q74=88 and q198=04)cand=690104.
if (q74=88 and q198=07)cand=690107.
if (q74=88 and q198=09)cand=690109.
if (q74=88 and q198=10)cand=690110.
if (q74=88 and q198=11)cand=690111.
if (q74=88 and q198=12)cand=690112.
if (q74=89 and q200=01)cand=700101.
if (q74=89 and q200=02)cand=700102.
if (q74=89 and q200=03)cand=700103.
if (q74=89 and q200=06)cand=700106.
if (q74=89 and q200=08)cand=700108.
if (q74=89 and q200=09)cand=700109.
if (q74=89 and q200=10)cand=700110.
if (q74=89 and q200=11)cand=700111.
if (q74=89 and q200=12)cand=700112.
if (q74=89 and q200=13)cand=700113.
if (q74=92 or q74=96 or q74=98)cand=999992.
if (q74=90)cand=999990.
if (q74=91)cand=999991.
if (q74=93)cand=999993.
if (q74=94)cand=999994.
if (q74=95)cand=999995.

*雲林縣第二選區.
if (q76=01)cand=090201.
if (q76=02)cand=090202.
if (q76=88 and q198=01)cand=690101.
if (q76=88 and q198=02)cand=690102.
if (q76=88 and q198=03)cand=690103.
if (q76=88 and q198=04)cand=690104.
if (q76=88 and q198=07)cand=690107.
if (q76=88 and q198=09)cand=690109.
if (q76=88 and q198=10)cand=690110.
if (q76=88 and q198=11)cand=690111.
if (q76=88 and q198=12)cand=690112.
if (q76=89 and q200=01)cand=700101.
if (q76=89 and q200=02)cand=700102.
if (q76=89 and q200=03)cand=700103.
if (q76=89 and q200=06)cand=700106.
if (q76=89 and q200=08)cand=700108.
if (q76=89 and q200=09)cand=700109.
if (q76=89 and q200=10)cand=700110.
if (q76=89 and q200=11)cand=700111.
if (q76=89 and q200=12)cand=700112.
if (q76=89 and q200=13)cand=700113.
if (q76=92 or q76=96 or q76=98)cand=999992.
if (q76=90)cand=999990.
if (q76=91)cand=999991.
if (q76=93)cand=999993.
if (q76=94)cand=999994.
if (q76=95)cand=999995.

*嘉義縣第一選區.   
if (q78=01)cand=100101.
if (q78=02)cand=100102.
if (q78=88 and q198=01)cand=690101.
if (q78=88 and q198=02)cand=690102.
if (q78=88 and q198=03)cand=690103.
if (q78=88 and q198=04)cand=690104.
if (q78=88 and q198=07)cand=690107.
if (q78=88 and q198=09)cand=690109.
if (q78=88 and q198=10)cand=690110.
if (q78=88 and q198=11)cand=690111.
if (q78=88 and q198=12)cand=690112.
if (q78=89 and q200=01)cand=700101.
if (q78=89 and q200=02)cand=700102.
if (q78=89 and q200=03)cand=700103.
if (q78=89 and q200=06)cand=700106.
if (q78=89 and q200=08)cand=700108.
if (q78=89 and q200=09)cand=700109.
if (q78=89 and q200=10)cand=700110.
if (q78=89 and q200=11)cand=700111.
if (q78=89 and q200=12)cand=700112.
if (q78=89 and q200=13)cand=700113.
if (q78=92 or q78=96 or q78=98)cand=999992.
if (q78=90)cand=999990.
if (q78=91)cand=999991.
if (q78=93)cand=999993.
if (q78=94)cand=999994.
if (q78=95)cand=999995.

*嘉義縣第二選區.
if (q80=02)cand=100202.
if (q80=42)cand=100242.
if (q80=75)cand=100275.
if (q80=84)cand=100284.
if (q80=85)cand=100285.
if (q80=88 and q198=01)cand=690101.
if (q80=88 and q198=02)cand=690102.
if (q80=88 and q198=03)cand=690103.
if (q80=88 and q198=04)cand=690104.
if (q80=88 and q198=07)cand=690107.
if (q80=88 and q198=09)cand=690109.
if (q80=88 and q198=10)cand=690110.
if (q80=88 and q198=11)cand=690111.
if (q80=88 and q198=12)cand=690112.
if (q80=89 and q200=01)cand=700101.
if (q80=89 and q200=02)cand=700102.
if (q80=89 and q200=03)cand=700103.
if (q80=89 and q200=06)cand=700106.
if (q80=89 and q200=08)cand=700108.
if (q80=89 and q200=09)cand=700109.
if (q80=89 and q200=10)cand=700110.
if (q80=89 and q200=11)cand=700111.
if (q80=89 and q200=12)cand=700112.
if (q80=89 and q200=13)cand=700113.
if (q80=92 or q80=96 or q80=98)cand=999992.
if (q80=90)cand=999990.
if (q80=91)cand=999991.
if (q80=93)cand=999993.
if (q80=94)cand=999994.
if (q80=95)cand=999995.

*屏東縣第一選區.   
if (q82=01)cand=130101.
if (q82=02)cand=130102.
if (q82=25)cand=130125.
if (q82=42)cand=130142.
if (q82=84)cand=130184.
if (q82=85)cand=130185.
if (q82=88 and q198=01)cand=690101.
if (q82=88 and q198=02)cand=690102.
if (q82=88 and q198=03)cand=690103.
if (q82=88 and q198=04)cand=690104.
if (q82=88 and q198=07)cand=690107.
if (q82=88 and q198=09)cand=690109.
if (q82=88 and q198=10)cand=690110.
if (q82=88 and q198=11)cand=690111.
if (q82=88 and q198=12)cand=690112.
if (q82=89 and q200=01)cand=700101.
if (q82=89 and q200=02)cand=700102.
if (q82=89 and q200=03)cand=700103.
if (q82=89 and q200=06)cand=700106.
if (q82=89 and q200=08)cand=700108.
if (q82=89 and q200=09)cand=700109.
if (q82=89 and q200=10)cand=700110.
if (q82=89 and q200=11)cand=700111.
if (q82=89 and q200=12)cand=700112.
if (q82=89 and q200=13)cand=700113.
if (q82=92 or q82=96 or q82=98)cand=999992.
if (q82=90)cand=999990.
if (q82=91)cand=999991.
if (q82=93)cand=999993.
if (q82=94)cand=999994.
if (q82=95)cand=999995.

*屏東縣第二選區.
if (q84=02)cand=130202.
if (q84=56)cand=130256.
if (q84=73)cand=130273.
if (q84=84)cand=130284.
if (q84=88 and q198=01)cand=690101.
if (q84=88 and q198=02)cand=690102.
if (q84=88 and q198=03)cand=690103.
if (q84=88 and q198=04)cand=690104.
if (q84=88 and q198=07)cand=690107.
if (q84=88 and q198=09)cand=690109.
if (q84=88 and q198=10)cand=690110.
if (q84=88 and q198=11)cand=690111.
if (q84=88 and q198=12)cand=690112.
if (q84=89 and q200=01)cand=700101.
if (q84=89 and q200=02)cand=700102.
if (q84=89 and q200=03)cand=700103.
if (q84=89 and q200=06)cand=700106.
if (q84=89 and q200=08)cand=700108.
if (q84=89 and q200=09)cand=700109.
if (q84=89 and q200=10)cand=700110.
if (q84=89 and q200=11)cand=700111.
if (q84=89 and q200=12)cand=700112.
if (q84=89 and q200=13)cand=700113.
if (q84=92 or q84=96 or q84=98)cand=999992.
if (q84=90)cand=999990.
if (q84=91)cand=999991.
if (q84=93)cand=999993.
if (q84=94)cand=999994.
if (q84=95)cand=999995.

*台東縣.   
if (q86=01)cand=140101.
if (q86=02)cand=140102.
if (q86=79)cand=140179.
if (q86=84)cand=140184.
if (q86=85)cand=140185.
if (q86=86)cand=140186.
if (q86=88 and q198=01)cand=690101.
if (q86=88 and q198=02)cand=690102.
if (q86=88 and q198=03)cand=690103.
if (q86=88 and q198=04)cand=690104.
if (q86=88 and q198=07)cand=690107.
if (q86=88 and q198=09)cand=690109.
if (q86=88 and q198=10)cand=690110.
if (q86=88 and q198=11)cand=690111.
if (q86=88 and q198=12)cand=690112.
if (q86=89 and q200=01)cand=700101.
if (q86=89 and q200=02)cand=700102.
if (q86=89 and q200=03)cand=700103.
if (q86=89 and q200=06)cand=700106.
if (q86=89 and q200=08)cand=700108.
if (q86=89 and q200=09)cand=700109.
if (q86=89 and q200=10)cand=700110.
if (q86=89 and q200=11)cand=700111.
if (q86=89 and q200=12)cand=700112.
if (q86=89 and q200=13)cand=700113.
if (q86=92 or q86=96 or q86=98)cand=999992.
if (q86=90)cand=999990.
if (q86=91)cand=999991.
if (q86=93)cand=999993.
if (q86=94)cand=999994.
if (q86=95)cand=999995.


*花蓮縣.   
if (q88=01)cand=150101.
if (q88=02)cand=150102.
if (q88=75)cand=150175.
if (q88=84)cand=150184.
if (q88=88 and q198=01)cand=690101.
if (q88=88 and q198=02)cand=690102.
if (q88=88 and q198=03)cand=690103.
if (q88=88 and q198=04)cand=690104.
if (q88=88 and q198=07)cand=690107.
if (q88=88 and q198=09)cand=690109.
if (q88=88 and q198=10)cand=690110.
if (q88=88 and q198=11)cand=690111.
if (q88=88 and q198=12)cand=690112.
if (q88=89 and q200=01)cand=700101.
if (q88=89 and q200=02)cand=700102.
if (q88=89 and q200=03)cand=700103.
if (q88=89 and q200=06)cand=700106.
if (q88=89 and q200=08)cand=700108.
if (q88=89 and q200=09)cand=700109.
if (q88=89 and q200=10)cand=700110.
if (q88=89 and q200=11)cand=700111.
if (q88=89 and q200=12)cand=700112.
if (q88=89 and q200=13)cand=700113.
if (q88=92 or q88=96 or q88=98)cand=999992.
if (q88=90)cand=999990.
if (q88=91)cand=999991.
if (q88=93)cand=999993.
if (q88=94)cand=999994.
if (q88=95)cand=999995.

*澎湖縣.   
if (q90=01)cand=160101.
if (q90=02)cand=160102.
if (q90=84)cand=160184.
if (q90=88 and q198=01)cand=690101.
if (q90=88 and q198=02)cand=690102.
if (q90=88 and q198=03)cand=690103.
if (q90=88 and q198=04)cand=690104.
if (q90=88 and q198=07)cand=690107.
if (q90=88 and q198=09)cand=690109.
if (q90=88 and q198=10)cand=690110.
if (q90=88 and q198=11)cand=690111.
if (q90=88 and q198=12)cand=690112.
if (q90=89 and q200=01)cand=700101.
if (q90=89 and q200=02)cand=700102.
if (q90=89 and q200=03)cand=700103.
if (q90=89 and q200=06)cand=700106.
if (q90=89 and q200=08)cand=700108.
if (q90=89 and q200=09)cand=700109.
if (q90=89 and q200=10)cand=700110.
if (q90=89 and q200=11)cand=700111.
if (q90=89 and q200=12)cand=700112.
if (q90=89 and q200=13)cand=700113.
if (q90=92 or q90=96 or q90=98)cand=999992.
if (q90=90)cand=999990.
if (q90=91)cand=999991.
if (q90=93)cand=999993.
if (q90=94)cand=999994.
if (q90=95)cand=999995.


*基隆市.   
if (q92=01)cand=170101.
if (q92=02)cand=170102.
if (q92=79)cand=170179.
if (q92=81)cand=170181.
if (q92=83)cand=170183.
if (q92=85)cand=170185.
if (q92=88 and q198=01)cand=690101.
if (q92=88 and q198=02)cand=690102.
if (q92=88 and q198=03)cand=690103.
if (q92=88 and q198=04)cand=690104.
if (q92=88 and q198=07)cand=690107.
if (q92=88 and q198=09)cand=690109.
if (q92=88 and q198=10)cand=690110.
if (q92=88 and q198=11)cand=690111.
if (q92=88 and q198=12)cand=690112.
if (q92=89 and q200=01)cand=700101.
if (q92=89 and q200=02)cand=700102.
if (q92=89 and q200=03)cand=700103.
if (q92=89 and q200=06)cand=700106.
if (q92=89 and q200=08)cand=700108.
if (q92=89 and q200=09)cand=700109.
if (q92=89 and q200=10)cand=700110.
if (q92=89 and q200=11)cand=700111.
if (q92=89 and q200=12)cand=700112.
if (q92=89 and q200=13)cand=700113.
if (q92=92 or q92=96 or q92=98)cand=999992.
if (q92=90)cand=999990.
if (q92=91)cand=999991.
if (q92=93)cand=999993.
if (q92=94)cand=999994.
if (q92=95)cand=999995.

*新竹市.   
if (q94=01)cand=180101.
if (q94=02)cand=180102.
if (q94=19)cand=180119.
if (q94=75)cand=180175.
if (q94=77)cand=180177.
if (q94=84)cand=180184.
if (q94=85)cand=180185.
if (q94=88 and q198=01)cand=690101.
if (q94=88 and q198=02)cand=690102.
if (q94=88 and q198=03)cand=690103.
if (q94=88 and q198=04)cand=690104.
if (q94=88 and q198=07)cand=690107.
if (q94=88 and q198=09)cand=690109.
if (q94=88 and q198=10)cand=690110.
if (q94=88 and q198=11)cand=690111.
if (q94=88 and q198=12)cand=690112.
if (q94=89 and q200=01)cand=700101.
if (q94=89 and q200=02)cand=700102.
if (q94=89 and q200=03)cand=700103.
if (q94=89 and q200=06)cand=700106.
if (q94=89 and q200=08)cand=700108.
if (q94=89 and q200=09)cand=700109.
if (q94=89 and q200=10)cand=700110.
if (q94=89 and q200=11)cand=700111.
if (q94=89 and q200=12)cand=700112.
if (q94=89 and q200=13)cand=700113.
if (q94=92 or q94=96 or q94=98)cand=999992.
if (q94=90)cand=999990.
if (q94=91)cand=999991.
if (q94=93)cand=999993.
if (q94=94)cand=999994.
if (q94=95)cand=999995.

*嘉義市.   
if (q96=01)cand=200101.
if (q96=02)cand=200102.
if (q96=71)cand=200171.
if (q96=79)cand=200179.
if (q96=80)cand=200180.
if (q96=84)cand=200184.
if (q96=88 and q198=01)cand=690101.
if (q96=88 and q198=02)cand=690102.
if (q96=88 and q198=03)cand=690103.
if (q96=88 and q198=04)cand=690104.
if (q96=88 and q198=07)cand=690107.
if (q96=88 and q198=09)cand=690109.
if (q96=88 and q198=10)cand=690110.
if (q96=88 and q198=11)cand=690111.
if (q96=88 and q198=12)cand=690112.
if (q96=89 and q200=01)cand=700101.
if (q96=89 and q200=02)cand=700102.
if (q96=89 and q200=03)cand=700103.
if (q96=89 and q200=06)cand=700106.
if (q96=89 and q200=08)cand=700108.
if (q96=89 and q200=09)cand=700109.
if (q96=89 and q200=10)cand=700110.
if (q96=89 and q200=11)cand=700111.
if (q96=89 and q200=12)cand=700112.
if (q96=89 and q200=13)cand=700113.
if (q96=92 or q96=96 or q96=98)cand=999992.
if (q96=90)cand=999990.
if (q96=91)cand=999991.
if (q96=93)cand=999993.
if (q96=94)cand=999994.
if (q96=95)cand=999995.

*台北市第一選區.
if (q102=01)cand=630101.
if (q102=02)cand=630102.
if (q102=48)cand=630148.
if (q102=71)cand=630171.
if (q102=73)cand=630173.
if (q102=74)cand=630174.
if (q102=84)cand=630184.
if (q102=85)cand=630185.
if (q102=88 and q198=01)cand=690101.
if (q102=88 and q198=02)cand=690102.
if (q102=88 and q198=03)cand=690103.
if (q102=88 and q198=04)cand=690104.
if (q102=88 and q198=07)cand=690107.
if (q102=88 and q198=09)cand=690109.
if (q102=88 and q198=10)cand=690110.
if (q102=88 and q198=11)cand=690111.
if (q102=88 and q198=12)cand=690112.
if (q102=89 and q200=01)cand=700101.
if (q102=89 and q200=02)cand=700102.
if (q102=89 and q200=03)cand=700103.
if (q102=89 and q200=06)cand=700106.
if (q102=89 and q200=08)cand=700108.
if (q102=89 and q200=09)cand=700109.
if (q102=89 and q200=10)cand=700110.
if (q102=89 and q200=11)cand=700111.
if (q102=89 and q200=12)cand=700112.
if (q102=89 and q200=13)cand=700113.
if (q102=92 or q102=96 or q102=98)cand=999992.
if (q102=90)cand=999990.
if (q102=91)cand=999991.
if (q102=93)cand=999993.
if (q102=94)cand=999994.
if (q102=95)cand=999995.

*台北市第二選區.
if (q104=01)cand=630201.
if (q104=02)cand=630202.
if (q104=25)cand=630225.
if (q104=73)cand=630273.
if (q104=75)cand=630275.
if (q104=88 and q198=01)cand=690101.
if (q104=88 and q198=02)cand=690102.
if (q104=88 and q198=03)cand=690103.
if (q104=88 and q198=04)cand=690104.
if (q104=88 and q198=07)cand=690107.
if (q104=88 and q198=09)cand=690109.
if (q104=88 and q198=10)cand=690110.
if (q104=88 and q198=11)cand=690111.
if (q104=88 and q198=12)cand=690112.
if (q104=89 and q200=01)cand=700101.
if (q104=89 and q200=02)cand=700102.
if (q104=89 and q200=03)cand=700103.
if (q104=89 and q200=06)cand=700106.
if (q104=89 and q200=08)cand=700108.
if (q104=89 and q200=09)cand=700109.
if (q104=89 and q200=10)cand=700110.
if (q104=89 and q200=11)cand=700111.
if (q104=89 and q200=12)cand=700112.
if (q104=89 and q200=13)cand=700113.
if (q104=92 or q104=96 or q104=98)cand=999992.
if (q104=90)cand=999990.
if (q104=91)cand=999991.
if (q104=93)cand=999993.
if (q104=94)cand=999994.
if (q104=95)cand=999995.


*台北市第三選區.
if (q106=01)cand=630301.
if (q106=02)cand=630302.
if (q106=42)cand=630342.
if (q106=71)cand=630371.
if (q106=73)cand=630373.
if (q106=75)cand=630375.
if (q106=84)cand=630384.
if (q106=88 and q198=01)cand=690101.
if (q106=88 and q198=02)cand=690102.
if (q106=88 and q198=03)cand=690103.
if (q106=88 and q198=04)cand=690104.
if (q106=88 and q198=07)cand=690107.
if (q106=88 and q198=09)cand=690109.
if (q106=88 and q198=10)cand=690110.
if (q106=88 and q198=11)cand=690111.
if (q106=88 and q198=12)cand=690112.
if (q106=89 and q200=01)cand=700101.
if (q106=89 and q200=02)cand=700102.
if (q106=89 and q200=03)cand=700103.
if (q106=89 and q200=06)cand=700106.
if (q106=89 and q200=08)cand=700108.
if (q106=89 and q200=09)cand=700109.
if (q106=89 and q200=10)cand=700110.
if (q106=89 and q200=11)cand=700111.
if (q106=89 and q200=12)cand=700112.
if (q106=89 and q200=13)cand=700113.
if (q106=92 or q106=96 or q106=98)cand=999992.
if (q106=90)cand=999990.
if (q106=91)cand=999991.
if (q106=93)cand=999993.
if (q106=94)cand=999994.
if (q106=95)cand=999995.

*台北市第四選區.
if (q108=01)cand=630401.
if (q108=02)cand=630402.
if (q108=17)cand=630417.
if (q108=59)cand=630459.
if (q108=75)cand=630475.
if (q108=88 and q198=01)cand=690101.
if (q108=88 and q198=02)cand=690102.
if (q108=88 and q198=03)cand=690103.
if (q108=88 and q198=04)cand=690104.
if (q108=88 and q198=07)cand=690107.
if (q108=88 and q198=09)cand=690109.
if (q108=88 and q198=10)cand=690110.
if (q108=88 and q198=11)cand=690111.
if (q108=88 and q198=12)cand=690112.
if (q108=89 and q200=01)cand=700101.
if (q108=89 and q200=02)cand=700102.
if (q108=89 and q200=03)cand=700103.
if (q108=89 and q200=06)cand=700106.
if (q108=89 and q200=08)cand=700108.
if (q108=89 and q200=09)cand=700109.
if (q108=89 and q200=10)cand=700110.
if (q108=89 and q200=11)cand=700111.
if (q108=89 and q200=12)cand=700112.
if (q108=89 and q200=13)cand=700113.
if (q108=92 or q108=96 or q108=98)cand=999992.
if (q108=90)cand=999990.
if (q108=91)cand=999991.
if (q108=93)cand=999993.
if (q108=94)cand=999994.
if (q108=95)cand=999995.

*台北市第五選區.
if (q110=01)cand=630501.
if (q110=02)cand=630502.
if (q110=38)cand=630538.
if (q110=76)cand=630576.
if (q110=77)cand=630577.
if (q110=78)cand=630578.
if (q110=84)cand=630584.
if (q110=85)cand=630585.
if (q110=86)cand=630586.
if (q110=87)cand=630587.
if (q110=88 and q198=01)cand=690101.
if (q110=88 and q198=02)cand=690102.
if (q110=88 and q198=03)cand=690103.
if (q110=88 and q198=04)cand=690104.
if (q110=88 and q198=07)cand=690107.
if (q110=88 and q198=09)cand=690109.
if (q110=88 and q198=10)cand=690110.
if (q110=88 and q198=11)cand=690111.
if (q110=88 and q198=12)cand=690112.
if (q110=89 and q200=01)cand=700101.
if (q110=89 and q200=02)cand=700102.
if (q110=89 and q200=03)cand=700103.
if (q110=89 and q200=06)cand=700106.
if (q110=89 and q200=08)cand=700108.
if (q110=89 and q200=09)cand=700109.
if (q110=89 and q200=10)cand=700110.
if (q110=89 and q200=11)cand=700111.
if (q110=89 and q200=12)cand=700112.
if (q110=89 and q200=13)cand=700113.
if (q110=92 or q110=96 or q110=98)cand=999992.
if (q110=90)cand=999990.
if (q110=91)cand=999991.
if (q110=93)cand=999993.
if (q110=94)cand=999994.
if (q110=95)cand=999995.


*台北市第六選區.
if (q112=01)cand=630601.
if (q112=24)cand=630624.
if (q112=42)cand=630642.
if (q112=71)cand=630671.
if (q112=75)cand=630675.
if (q112=88 and q198=01)cand=690101.
if (q112=88 and q198=02)cand=690102.
if (q112=88 and q198=03)cand=690103.
if (q112=88 and q198=04)cand=690104.
if (q112=88 and q198=07)cand=690107.
if (q112=88 and q198=09)cand=690109.
if (q112=88 and q198=10)cand=690110.
if (q112=88 and q198=11)cand=690111.
if (q112=88 and q198=12)cand=690112.
if (q112=89 and q200=01)cand=700101.
if (q112=89 and q200=02)cand=700102.
if (q112=89 and q200=03)cand=700103.
if (q112=89 and q200=06)cand=700106.
if (q112=89 and q200=08)cand=700108.
if (q112=89 and q200=09)cand=700109.
if (q112=89 and q200=10)cand=700110.
if (q112=89 and q200=11)cand=700111.
if (q112=89 and q200=12)cand=700112.
if (q112=89 and q200=13)cand=700113.
if (q112=92 or q112=96 or q112=98)cand=999992.
if (q112=90)cand=999990.
if (q112=91)cand=999991.
if (q112=93)cand=999993.
if (q112=94)cand=999994.
if (q112=95)cand=999995.

*台北市第七選區.
if (q114=01)cand=630701.
if (q114=02)cand=630702.
if (q114=42)cand=630742.
if (q114=53)cand=630753.
if (q114=84)cand=630784.
if (q114=88 and q198=01)cand=690101.
if (q114=88 and q198=02)cand=690102.
if (q114=88 and q198=03)cand=690103.
if (q114=88 and q198=04)cand=690104.
if (q114=88 and q198=07)cand=690107.
if (q114=88 and q198=09)cand=690109.
if (q114=88 and q198=10)cand=690110.
if (q114=88 and q198=11)cand=690111.
if (q114=88 and q198=12)cand=690112.
if (q114=89 and q200=01)cand=700101.
if (q114=89 and q200=02)cand=700102.
if (q114=89 and q200=03)cand=700103.
if (q114=89 and q200=06)cand=700106.
if (q114=89 and q200=08)cand=700108.
if (q114=89 and q200=09)cand=700109.
if (q114=89 and q200=10)cand=700110.
if (q114=89 and q200=11)cand=700111.
if (q114=89 and q200=12)cand=700112.
if (q114=89 and q200=13)cand=700113.
if (q114=92 or q114=96 or q114=98)cand=999992.
if (q114=90)cand=999990.
if (q114=91)cand=999991.
if (q114=93)cand=999993.
if (q114=94)cand=999994.
if (q114=95)cand=999995.

*台北市第八選區.
if (q116=01)cand=630801.
if (q116=02)cand=630802.
if (q116=41)cand=630841.
if (q116=42)cand=630842.
if (q116=67)cand=630867.
if (q116=79)cand=630879.
if (q116=84)cand=630884.
if (q116=85)cand=630885.
if (q116=88 and q198=01)cand=690101.
if (q116=88 and q198=02)cand=690102.
if (q116=88 and q198=03)cand=690103.
if (q116=88 and q198=04)cand=690104.
if (q116=88 and q198=07)cand=690107.
if (q116=88 and q198=09)cand=690109.
if (q116=88 and q198=10)cand=690110.
if (q116=88 and q198=11)cand=690111.
if (q116=88 and q198=12)cand=690112.
if (q116=89 and q200=01)cand=700101.
if (q116=89 and q200=02)cand=700102.
if (q116=89 and q200=03)cand=700103.
if (q116=89 and q200=06)cand=700106.
if (q116=89 and q200=08)cand=700108.
if (q116=89 and q200=09)cand=700109.
if (q116=89 and q200=10)cand=700110.
if (q116=89 and q200=11)cand=700111.
if (q116=89 and q200=12)cand=700112.
if (q116=89 and q200=13)cand=700113.
if (q116=92 or q116=96 or q116=98)cand=999992.
if (q116=90)cand=999990.
if (q116=91)cand=999991.
if (q116=93)cand=999993.
if (q116=94)cand=999994.
if (q116=95)cand=999995.

*高雄市第一選區.
if (q118=02)cand=640102.
if (q118=41)cand=640141.
if (q118=73)cand=640173.
if (q118=84)cand=640184.
if (q118=88 and q198=01)cand=690101.
if (q118=88 and q198=02)cand=690102.
if (q118=88 and q198=03)cand=690103.
if (q118=88 and q198=04)cand=690104.
if (q118=88 and q198=07)cand=690107.
if (q118=88 and q198=09)cand=690109.
if (q118=88 and q198=10)cand=690110.
if (q118=88 and q198=11)cand=690111.
if (q118=88 and q198=12)cand=690112.
if (q118=89 and q200=01)cand=700101.
if (q118=89 and q200=02)cand=700102.
if (q118=89 and q200=03)cand=700103.
if (q118=89 and q200=06)cand=700106.
if (q118=89 and q200=08)cand=700108.
if (q118=89 and q200=09)cand=700109.
if (q118=89 and q200=10)cand=700110.
if (q118=89 and q200=11)cand=700111.
if (q118=89 and q200=12)cand=700112.
if (q118=89 and q200=13)cand=700113.
if (q118=92 or q118=96 or q118=98)cand=999992.
if (q118=90)cand=999990.
if (q118=91)cand=999991.
if (q118=93)cand=999993.
if (q118=94)cand=999994.
if (q118=95)cand=999995.


*高雄市第二選區.
if (q120=01)cand=640201.
if (q120=02)cand=640202.
if (q120=88 and q198=01)cand=690101.
if (q120=88 and q198=02)cand=690102.
if (q120=88 and q198=03)cand=690103.
if (q120=88 and q198=04)cand=690104.
if (q120=88 and q198=07)cand=690107.
if (q120=88 and q198=09)cand=690109.
if (q120=88 and q198=10)cand=690110.
if (q120=88 and q198=11)cand=690111.
if (q120=88 and q198=12)cand=690112.
if (q120=89 and q200=01)cand=700101.
if (q120=89 and q200=02)cand=700102.
if (q120=89 and q200=03)cand=700103.
if (q120=89 and q200=06)cand=700106.
if (q120=89 and q200=08)cand=700108.
if (q120=89 and q200=09)cand=700109.
if (q120=89 and q200=10)cand=700110.
if (q120=89 and q200=11)cand=700111.
if (q120=89 and q200=12)cand=700112.
if (q120=89 and q200=13)cand=700113.
if (q120=92 or q120=96 or q120=98)cand=999992.
if (q120=90)cand=999990.
if (q120=91)cand=999991.
if (q120=93)cand=999993.
if (q120=94)cand=999994.
if (q120=95)cand=999995.

*高雄市第三選區.
if (q122=01)cand=640301.
if (q122=02)cand=640302.
if (q122=76)cand=640376.
if (q122=84)cand=640384.
if (q122=85)cand=640385.
if (q122=88 and q198=01)cand=690101.
if (q122=88 and q198=02)cand=690102.
if (q122=88 and q198=03)cand=690103.
if (q122=88 and q198=04)cand=690104.
if (q122=88 and q198=07)cand=690107.
if (q122=88 and q198=09)cand=690109.
if (q122=88 and q198=10)cand=690110.
if (q122=88 and q198=11)cand=690111.
if (q122=88 and q198=12)cand=690112.
if (q122=89 and q200=01)cand=700101.
if (q122=89 and q200=02)cand=700102.
if (q122=89 and q200=03)cand=700103.
if (q122=89 and q200=06)cand=700106.
if (q122=89 and q200=08)cand=700108.
if (q122=89 and q200=09)cand=700109.
if (q122=89 and q200=10)cand=700110.
if (q122=89 and q200=11)cand=700111.
if (q122=89 and q200=12)cand=700112.
if (q122=89 and q200=13)cand=700113.
if (q122=92 or q122=96 or q122=98)cand=999992.
if (q122=90)cand=999990.
if (q122=91)cand=999991.
if (q122=93)cand=999993.
if (q122=94)cand=999994.
if (q122=95)cand=999995.

*高雄市第四選區.
if (q124=01)cand=640401.
if (q124=02)cand=640402.
if (q124=88 and q198=01)cand=690101.
if (q124=88 and q198=02)cand=690102.
if (q124=88 and q198=03)cand=690103.
if (q124=88 and q198=04)cand=690104.
if (q124=88 and q198=07)cand=690107.
if (q124=88 and q198=09)cand=690109.
if (q124=88 and q198=10)cand=690110.
if (q124=88 and q198=11)cand=690111.
if (q124=88 and q198=12)cand=690112.
if (q124=89 and q200=01)cand=700101.
if (q124=89 and q200=02)cand=700102.
if (q124=89 and q200=03)cand=700103.
if (q124=89 and q200=06)cand=700106.
if (q124=89 and q200=08)cand=700108.
if (q124=89 and q200=09)cand=700109.
if (q124=89 and q200=10)cand=700110.
if (q124=89 and q200=11)cand=700111.
if (q124=89 and q200=12)cand=700112.
if (q124=89 and q200=13)cand=700113.
if (q124=92 or q124=96 or q124=98)cand=999992.
if (q124=90)cand=999990.
if (q124=91)cand=999991.
if (q124=93)cand=999993.
if (q124=94)cand=999994.
if (q124=95)cand=999995.

*高雄市第五選區.
if (q126=01)cand=640501.
if (q126=02)cand=640502.
if (q126=79)cand=640579.
if (q126=84)cand=640584.
if (q126=88 and q198=01)cand=690101.
if (q126=88 and q198=02)cand=690102.
if (q126=88 and q198=03)cand=690103.
if (q126=88 and q198=04)cand=690104.
if (q126=88 and q198=07)cand=690107.
if (q126=88 and q198=09)cand=690109.
if (q126=88 and q198=10)cand=690110.
if (q126=88 and q198=11)cand=690111.
if (q126=88 and q198=12)cand=690112.
if (q126=89 and q200=01)cand=700101.
if (q126=89 and q200=02)cand=700102.
if (q126=89 and q200=03)cand=700103.
if (q126=89 and q200=06)cand=700106.
if (q126=89 and q200=08)cand=700108.
if (q126=89 and q200=09)cand=700109.
if (q126=89 and q200=10)cand=700110.
if (q126=89 and q200=11)cand=700111.
if (q126=89 and q200=12)cand=700112.
if (q126=89 and q200=13)cand=700113.
if (q126=92 or q126=96 or q126=98)cand=999992.
if (q126=90)cand=999990.
if (q126=91)cand=999991.
if (q126=93)cand=999993.
if (q126=94)cand=999994.
if (q126=95)cand=999995.


*高雄市第六選區.
if (q128=01)cand=640601.
if (q128=02)cand=640602.
if (q128=44)cand=640644.
if (q128=88 and q198=01)cand=690101.
if (q128=88 and q198=02)cand=690102.
if (q128=88 and q198=03)cand=690103.
if (q128=88 and q198=04)cand=690104.
if (q128=88 and q198=07)cand=690107.
if (q128=88 and q198=09)cand=690109.
if (q128=88 and q198=10)cand=690110.
if (q128=88 and q198=11)cand=690111.
if (q128=88 and q198=12)cand=690112.
if (q128=89 and q200=01)cand=700101.
if (q128=89 and q200=02)cand=700102.
if (q128=89 and q200=03)cand=700103.
if (q128=89 and q200=06)cand=700106.
if (q128=89 and q200=08)cand=700108.
if (q128=89 and q200=09)cand=700109.
if (q128=89 and q200=10)cand=700110.
if (q128=89 and q200=11)cand=700111.
if (q128=89 and q200=12)cand=700112.
if (q128=89 and q200=13)cand=700113.
if (q128=92 or q128=96 or q128=98)cand=999992.
if (q128=90)cand=999990.
if (q128=91)cand=999991.
if (q128=93)cand=999993.
if (q128=94)cand=999994.
if (q128=95)cand=999995.

*高雄市第七選區.
if (q130=01)cand=640701.
if (q130=02)cand=640702.
if (q130=77)cand=640777.
if (q130=84)cand=640784.
if (q130=88 and q198=01)cand=690101.
if (q130=88 and q198=02)cand=690102.
if (q130=88 and q198=03)cand=690103.
if (q130=88 and q198=04)cand=690104.
if (q130=88 and q198=07)cand=690107.
if (q130=88 and q198=09)cand=690109.
if (q130=88 and q198=10)cand=690110.
if (q130=88 and q198=11)cand=690111.
if (q130=88 and q198=12)cand=690112.
if (q130=89 and q200=01)cand=700101.
if (q130=89 and q200=02)cand=700102.
if (q130=89 and q200=03)cand=700103.
if (q130=89 and q200=06)cand=700106.
if (q130=89 and q200=08)cand=700108.
if (q130=89 and q200=09)cand=700109.
if (q130=89 and q200=10)cand=700110.
if (q130=89 and q200=11)cand=700111.
if (q130=89 and q200=12)cand=700112.
if (q130=89 and q200=13)cand=700113.
if (q130=92 or q130=96 or q130=98)cand=999992.
if (q130=90)cand=999990.
if (q130=91)cand=999991.
if (q130=93)cand=999993.
if (q130=94)cand=999994.
if (q130=95)cand=999995.


*高雄市第八選區.
if (q132=01)cand=640801.
if (q132=02)cand=640802.
if (q132=13)cand=640813.
if (q132=77)cand=640877.
if (q132=88 and q198=01)cand=690101.
if (q132=88 and q198=02)cand=690102.
if (q132=88 and q198=03)cand=690103.
if (q132=88 and q198=04)cand=690104.
if (q132=88 and q198=07)cand=690107.
if (q132=88 and q198=09)cand=690109.
if (q132=88 and q198=10)cand=690110.
if (q132=88 and q198=11)cand=690111.
if (q132=88 and q198=12)cand=690112.
if (q132=89 and q200=01)cand=700101.
if (q132=89 and q200=02)cand=700102.
if (q132=89 and q200=03)cand=700103.
if (q132=89 and q200=06)cand=700106.
if (q132=89 and q200=08)cand=700108.
if (q132=89 and q200=09)cand=700109.
if (q132=89 and q200=10)cand=700110.
if (q132=89 and q200=11)cand=700111.
if (q132=89 and q200=12)cand=700112.
if (q132=89 and q200=13)cand=700113.
if (q132=92 or q132=96 or q132=98)cand=999992.
if (q132=90)cand=999990.
if (q132=91)cand=999991.
if (q132=93)cand=999993.
if (q132=94)cand=999994.
if (q132=95)cand=999995.

*新北市第一選區.
if (q134=01)cand=650101.
if (q134=02)cand=650102.
if (q134=25)cand=650125.
if (q134=42)cand=650142.
if (q134=75)cand=650175.
if (q134=88 and q198=01)cand=690101.
if (q134=88 and q198=02)cand=690102.
if (q134=88 and q198=03)cand=690103.
if (q134=88 and q198=04)cand=690104.
if (q134=88 and q198=07)cand=690107.
if (q134=88 and q198=09)cand=690109.
if (q134=88 and q198=10)cand=690110.
if (q134=88 and q198=11)cand=690111.
if (q134=88 and q198=12)cand=690112.
if (q134=89 and q200=01)cand=700101.
if (q134=89 and q200=02)cand=700102.
if (q134=89 and q200=03)cand=700103.
if (q134=89 and q200=06)cand=700106.
if (q134=89 and q200=08)cand=700108.
if (q134=89 and q200=09)cand=700109.
if (q134=89 and q200=10)cand=700110.
if (q134=89 and q200=11)cand=700111.
if (q134=89 and q200=12)cand=700112.
if (q134=89 and q200=13)cand=700113.
if (q134=92 or q134=96 or q134=98)cand=999992.
if (q134=90)cand=999990.
if (q134=91)cand=999991.
if (q134=93)cand=999993.
if (q134=94)cand=999994.
if (q134=95)cand=999995.

*新北市第二選區.
if (q136=02)cand=650202.
if (q136=25)cand=650225.
if (q136=41)cand=650241.
if (q136=88 and q198=01)cand=690101.
if (q136=88 and q198=02)cand=690102.
if (q136=88 and q198=03)cand=690103.
if (q136=88 and q198=04)cand=690104.
if (q136=88 and q198=07)cand=690107.
if (q136=88 and q198=09)cand=690109.
if (q136=88 and q198=10)cand=690110.
if (q136=88 and q198=11)cand=690111.
if (q136=88 and q198=12)cand=690112.
if (q136=89 and q200=01)cand=700101.
if (q136=89 and q200=02)cand=700102.
if (q136=89 and q200=03)cand=700103.
if (q136=89 and q200=06)cand=700106.
if (q136=89 and q200=08)cand=700108.
if (q136=89 and q200=09)cand=700109.
if (q136=89 and q200=10)cand=700110.
if (q136=89 and q200=11)cand=700111.
if (q136=89 and q200=12)cand=700112.
if (q136=89 and q200=13)cand=700113.
if (q136=92 or q136=96 or q136=98)cand=999992.
if (q136=90)cand=999990.
if (q136=91)cand=999991.
if (q136=93)cand=999993.
if (q136=94)cand=999994.
if (q136=95)cand=999995.


*新北市第三選區.
if (q138=01)cand=650301.
if (q138=02)cand=650302.
if (q138=84)cand=650384.
if (q138=85)cand=650385.
if (q138=88 and q198=01)cand=690101.
if (q138=88 and q198=02)cand=690102.
if (q138=88 and q198=03)cand=690103.
if (q138=88 and q198=04)cand=690104.
if (q138=88 and q198=07)cand=690107.
if (q138=88 and q198=09)cand=690109.
if (q138=88 and q198=10)cand=690110.
if (q138=88 and q198=11)cand=690111.
if (q138=88 and q198=12)cand=690112.
if (q138=89 and q200=01)cand=700101.
if (q138=89 and q200=02)cand=700102.
if (q138=89 and q200=03)cand=700103.
if (q138=89 and q200=06)cand=700106.
if (q138=89 and q200=08)cand=700108.
if (q138=89 and q200=09)cand=700109.
if (q138=89 and q200=10)cand=700110.
if (q138=89 and q200=11)cand=700111.
if (q138=89 and q200=12)cand=700112.
if (q138=89 and q200=13)cand=700113.
if (q138=92 or q138=96 or q138=98)cand=999992.
if (q138=90)cand=999990.
if (q138=91)cand=999991.
if (q138=93)cand=999993.
if (q138=94)cand=999994.
if (q138=95)cand=999995.

*新北市第四選區.
if (q140=01)cand=650401.
if (q140=02)cand=650402.
if (q140=75)cand=650475.
if (q140=84)cand=650484.
if (q140=85)cand=650485.
if (q140=88 and q198=01)cand=690101.
if (q140=88 and q198=02)cand=690102.
if (q140=88 and q198=03)cand=690103.
if (q140=88 and q198=04)cand=690104.
if (q140=88 and q198=07)cand=690107.
if (q140=88 and q198=09)cand=690109.
if (q140=88 and q198=10)cand=690110.
if (q140=88 and q198=11)cand=690111.
if (q140=88 and q198=12)cand=690112.
if (q140=89 and q200=01)cand=700101.
if (q140=89 and q200=02)cand=700102.
if (q140=89 and q200=03)cand=700103.
if (q140=89 and q200=06)cand=700106.
if (q140=89 and q200=08)cand=700108.
if (q140=89 and q200=09)cand=700109.
if (q140=89 and q200=10)cand=700110.
if (q140=89 and q200=11)cand=700111.
if (q140=89 and q200=12)cand=700112.
if (q140=89 and q200=13)cand=700113.
if (q140=92 or q140=96 or q140=98)cand=999992.
if (q140=90)cand=999990.
if (q140=91)cand=999991.
if (q140=93)cand=999993.
if (q140=94)cand=999994.
if (q140=95)cand=999995.

*新北市第五選區.
if (q142=01)cand=650501.
if (q142=02)cand=650502.
if (q142=88 and q198=01)cand=690101.
if (q142=88 and q198=02)cand=690102.
if (q142=88 and q198=03)cand=690103.
if (q142=88 and q198=04)cand=690104.
if (q142=88 and q198=07)cand=690107.
if (q142=88 and q198=09)cand=690109.
if (q142=88 and q198=10)cand=690110.
if (q142=88 and q198=11)cand=690111.
if (q142=88 and q198=12)cand=690112.
if (q142=89 and q200=01)cand=700101.
if (q142=89 and q200=02)cand=700102.
if (q142=89 and q200=03)cand=700103.
if (q142=89 and q200=06)cand=700106.
if (q142=89 and q200=08)cand=700108.
if (q142=89 and q200=09)cand=700109.
if (q142=89 and q200=10)cand=700110.
if (q142=89 and q200=11)cand=700111.
if (q142=89 and q200=12)cand=700112.
if (q142=89 and q200=13)cand=700113.
if (q142=92 or q142=96 or q142=98)cand=999992.
if (q142=90)cand=999990.
if (q142=91)cand=999991.
if (q142=93)cand=999993.
if (q142=94)cand=999994.
if (q142=95)cand=999995.

*新北市第六選區.
if (q144=01)cand=650601.
if (q144=02)cand=650602.
if (q144=77)cand=650677.
if (q144=88 and q198=01)cand=690101.
if (q144=88 and q198=02)cand=690102.
if (q144=88 and q198=03)cand=690103.
if (q144=88 and q198=04)cand=690104.
if (q144=88 and q198=07)cand=690107.
if (q144=88 and q198=09)cand=690109.
if (q144=88 and q198=10)cand=690110.
if (q144=88 and q198=11)cand=690111.
if (q144=88 and q198=12)cand=690112.
if (q144=89 and q200=01)cand=700101.
if (q144=89 and q200=02)cand=700102.
if (q144=89 and q200=03)cand=700103.
if (q144=89 and q200=06)cand=700106.
if (q144=89 and q200=08)cand=700108.
if (q144=89 and q200=09)cand=700109.
if (q144=89 and q200=10)cand=700110.
if (q144=89 and q200=11)cand=700111.
if (q144=89 and q200=12)cand=700112.
if (q144=89 and q200=13)cand=700113.
if (q144=92 or q144=96 or q144=98)cand=999992.
if (q144=90)cand=999990.
if (q144=91)cand=999991.
if (q144=93)cand=999993.
if (q144=94)cand=999994.
if (q144=95)cand=999995.

*新北市第七選區.
if (q146=01)cand=650701.
if (q146=02)cand=650702.
if (q146=79)cand=650779.
if (q146=88 and q198=01)cand=690101.
if (q146=88 and q198=02)cand=690102.
if (q146=88 and q198=03)cand=690103.
if (q146=88 and q198=04)cand=690104.
if (q146=88 and q198=07)cand=690107.
if (q146=88 and q198=09)cand=690109.
if (q146=88 and q198=10)cand=690110.
if (q146=88 and q198=11)cand=690111.
if (q146=88 and q198=12)cand=690112.
if (q146=89 and q200=01)cand=700101.
if (q146=89 and q200=02)cand=700102.
if (q146=89 and q200=03)cand=700103.
if (q146=89 and q200=06)cand=700106.
if (q146=89 and q200=08)cand=700108.
if (q146=89 and q200=09)cand=700109.
if (q146=89 and q200=10)cand=700110.
if (q146=89 and q200=11)cand=700111.
if (q146=89 and q200=12)cand=700112.
if (q146=89 and q200=13)cand=700113.
if (q146=92 or q146=96 or q146=98)cand=999992.
if (q146=90)cand=999990.
if (q146=91)cand=999991.
if (q146=93)cand=999993.
if (q146=94)cand=999994.
if (q146=95)cand=999995.


*新北市第八選區.
if (q148=01)cand=650801.
if (q148=02)cand=650802.
if (q148=41)cand=650841.
if (q148=88 and q198=01)cand=690101.
if (q148=88 and q198=02)cand=690102.
if (q148=88 and q198=03)cand=690103.
if (q148=88 and q198=04)cand=690104.
if (q148=88 and q198=07)cand=690107.
if (q148=88 and q198=09)cand=690109.
if (q148=88 and q198=10)cand=690110.
if (q148=88 and q198=11)cand=690111.
if (q148=88 and q198=12)cand=690112.
if (q148=89 and q200=01)cand=700101.
if (q148=89 and q200=02)cand=700102.
if (q148=89 and q200=03)cand=700103.
if (q148=89 and q200=06)cand=700106.
if (q148=89 and q200=08)cand=700108.
if (q148=89 and q200=09)cand=700109.
if (q148=89 and q200=10)cand=700110.
if (q148=89 and q200=11)cand=700111.
if (q148=89 and q200=12)cand=700112.
if (q148=89 and q200=13)cand=700113.
if (q148=92 or q148=96 or q148=98)cand=999992.
if (q148=90)cand=999990.
if (q148=91)cand=999991.
if (q148=93)cand=999993.
if (q148=94)cand=999994.
if (q148=95)cand=999995.

*新北市第九選區.
if (q150=01)cand=650901.
if (q150=02)cand=650902.
if (q150=42)cand=650942.
if (q150=88 and q198=01)cand=690101.
if (q150=88 and q198=02)cand=690102.
if (q150=88 and q198=03)cand=690103.
if (q150=88 and q198=04)cand=690104.
if (q150=88 and q198=07)cand=690107.
if (q150=88 and q198=09)cand=690109.
if (q150=88 and q198=10)cand=690110.
if (q150=88 and q198=11)cand=690111.
if (q150=88 and q198=12)cand=690112.
if (q150=89 and q200=01)cand=700101.
if (q150=89 and q200=02)cand=700102.
if (q150=89 and q200=03)cand=700103.
if (q150=89 and q200=06)cand=700106.
if (q150=89 and q200=08)cand=700108.
if (q150=89 and q200=09)cand=700109.
if (q150=89 and q200=10)cand=700110.
if (q150=89 and q200=11)cand=700111.
if (q150=89 and q200=12)cand=700112.
if (q150=89 and q200=13)cand=700113.
if (q150=92 or q150=96 or q150=98)cand=999992.
if (q150=90)cand=999990.
if (q150=91)cand=999991.
if (q150=93)cand=999993.
if (q150=94)cand=999994.
if (q150=95)cand=999995.

*新北市第十選區.
if (q152=01)cand=651001.
if (q152=02)cand=651002.
if (q152=73)cand=651073.
if (q152=80)cand=651080.
if (q152=88 and q198=01)cand=690101.
if (q152=88 and q198=02)cand=690102.
if (q152=88 and q198=03)cand=690103.
if (q152=88 and q198=04)cand=690104.
if (q152=88 and q198=07)cand=690107.
if (q152=88 and q198=09)cand=690109.
if (q152=88 and q198=10)cand=690110.
if (q152=88 and q198=11)cand=690111.
if (q152=88 and q198=12)cand=690112.
if (q152=89 and q200=01)cand=700101.
if (q152=89 and q200=02)cand=700102.
if (q152=89 and q200=03)cand=700103.
if (q152=89 and q200=06)cand=700106.
if (q152=89 and q200=08)cand=700108.
if (q152=89 and q200=09)cand=700109.
if (q152=89 and q200=10)cand=700110.
if (q152=89 and q200=11)cand=700111.
if (q152=89 and q200=12)cand=700112.
if (q152=89 and q200=13)cand=700113.
if (q152=92 or q152=96 or q152=98)cand=999992.
if (q152=90)cand=999990.
if (q152=91)cand=999991.
if (q152=93)cand=999993.
if (q152=94)cand=999994.
if (q152=95)cand=999995.

*新北市第十一選區.
if (q154=01)cand=651101.
if (q154=02)cand=651102.
if (q154=52)cand=651152.
if (q154=73)cand=651173.
if (q154=75)cand=651175.
if (q154=84)cand=651184.
if (q154=88 and q198=01)cand=690101.
if (q154=88 and q198=02)cand=690102.
if (q154=88 and q198=03)cand=690103.
if (q154=88 and q198=04)cand=690104.
if (q154=88 and q198=07)cand=690107.
if (q154=88 and q198=09)cand=690109.
if (q154=88 and q198=10)cand=690110.
if (q154=88 and q198=11)cand=690111.
if (q154=88 and q198=12)cand=690112.
if (q154=89 and q200=01)cand=700101.
if (q154=89 and q200=02)cand=700102.
if (q154=89 and q200=03)cand=700103.
if (q154=89 and q200=06)cand=700106.
if (q154=89 and q200=08)cand=700108.
if (q154=89 and q200=09)cand=700109.
if (q154=89 and q200=10)cand=700110.
if (q154=89 and q200=11)cand=700111.
if (q154=89 and q200=12)cand=700112.
if (q154=89 and q200=13)cand=700113.
if (q154=92 or q154=96 or q154=98)cand=999992.
if (q154=90)cand=999990.
if (q154=91)cand=999991.
if (q154=93)cand=999993.
if (q154=94)cand=999994.
if (q154=95)cand=999995.

*新北市第十二選區.
if (q156=01)cand=651201.
if (q156=02)cand=651202.
if (q156=42)cand=651242.
if (q156=71)cand=651271.
if (q156=84)cand=651284.
if (q156=85)cand=651285.
if (q156=88 and q198=01)cand=690101.
if (q156=88 and q198=02)cand=690102.
if (q156=88 and q198=03)cand=690103.
if (q156=88 and q198=04)cand=690104.
if (q156=88 and q198=07)cand=690107.
if (q156=88 and q198=09)cand=690109.
if (q156=88 and q198=10)cand=690110.
if (q156=88 and q198=11)cand=690111.
if (q156=88 and q198=12)cand=690112.
if (q156=89 and q200=01)cand=700101.
if (q156=89 and q200=02)cand=700102.
if (q156=89 and q200=03)cand=700103.
if (q156=89 and q200=06)cand=700106.
if (q156=89 and q200=08)cand=700108.
if (q156=89 and q200=09)cand=700109.
if (q156=89 and q200=10)cand=700110.
if (q156=89 and q200=11)cand=700111.
if (q156=89 and q200=12)cand=700112.
if (q156=89 and q200=13)cand=700113.
if (q156=92 or q156=96 or q156=98)cand=999992.
if (q156=90)cand=999990.
if (q156=91)cand=999991.
if (q156=93)cand=999993.
if (q156=94)cand=999994.
if (q156=95)cand=999995.

*台中市第一選區.
if (q158=02)cand=660102.
if (q158=41)cand=660141.
if (q158=84)cand=660184.
if (q158=85)cand=660185.
if (q158=88 and q198=01)cand=690101.
if (q158=88 and q198=02)cand=690102.
if (q158=88 and q198=03)cand=690103.
if (q158=88 and q198=04)cand=690104.
if (q158=88 and q198=07)cand=690107.
if (q158=88 and q198=09)cand=690109.
if (q158=88 and q198=10)cand=690110.
if (q158=88 and q198=11)cand=690111.
if (q158=88 and q198=12)cand=690112.
if (q158=89 and q200=01)cand=700101.
if (q158=89 and q200=02)cand=700102.
if (q158=89 and q200=03)cand=700103.
if (q158=89 and q200=06)cand=700106.
if (q158=89 and q200=08)cand=700108.
if (q158=89 and q200=09)cand=700109.
if (q158=89 and q200=10)cand=700110.
if (q158=89 and q200=11)cand=700111.
if (q158=89 and q200=12)cand=700112.
if (q158=89 and q200=13)cand=700113.
if (q158=92 or q158=96 or q158=98)cand=999992.
if (q158=90)cand=999990.
if (q158=91)cand=999991.
if (q158=93)cand=999993.
if (q158=94)cand=999994.
if (q158=95)cand=999995.

*台中市第二選區.
if (q160=01)cand=660201.
if (q160=02)cand=660202.
if (q160=61)cand=660261.
if (q160=84)cand=660284.
if (q160=88 and q198=01)cand=690101.
if (q160=88 and q198=02)cand=690102.
if (q160=88 and q198=03)cand=690103.
if (q160=88 and q198=04)cand=690104.
if (q160=88 and q198=07)cand=690107.
if (q160=88 and q198=09)cand=690109.
if (q160=88 and q198=10)cand=690110.
if (q160=88 and q198=11)cand=690111.
if (q160=88 and q198=12)cand=690112.
if (q160=89 and q200=01)cand=700101.
if (q160=89 and q200=02)cand=700102.
if (q160=89 and q200=03)cand=700103.
if (q160=89 and q200=06)cand=700106.
if (q160=89 and q200=08)cand=700108.
if (q160=89 and q200=09)cand=700109.
if (q160=89 and q200=10)cand=700110.
if (q160=89 and q200=11)cand=700111.
if (q160=89 and q200=12)cand=700112.
if (q160=89 and q200=13)cand=700113.
if (q160=92 or q160=96 or q160=98)cand=999992.
if (q160=90)cand=999990.
if (q160=91)cand=999991.
if (q160=93)cand=999993.
if (q160=94)cand=999994.
if (q160=95)cand=999995.


*台中市第三選區.
if (q162=01)cand=660301.
if (q162=02)cand=660302.
if (q162=77)cand=660377.
if (q162=88 and q198=01)cand=690101.
if (q162=88 and q198=02)cand=690102.
if (q162=88 and q198=03)cand=690103.
if (q162=88 and q198=04)cand=690104.
if (q162=88 and q198=07)cand=690107.
if (q162=88 and q198=09)cand=690109.
if (q162=88 and q198=10)cand=690110.
if (q162=88 and q198=11)cand=690111.
if (q162=88 and q198=12)cand=690112.
if (q162=89 and q200=01)cand=700101.
if (q162=89 and q200=02)cand=700102.
if (q162=89 and q200=03)cand=700103.
if (q162=89 and q200=06)cand=700106.
if (q162=89 and q200=08)cand=700108.
if (q162=89 and q200=09)cand=700109.
if (q162=89 and q200=10)cand=700110.
if (q162=89 and q200=11)cand=700111.
if (q162=89 and q200=12)cand=700112.
if (q162=89 and q200=13)cand=700113.
if (q162=92 or q162=96 or q162=98)cand=999992.
if (q162=90)cand=999990.
if (q162=91)cand=999991.
if (q162=93)cand=999993.
if (q162=94)cand=999994.
if (q162=95)cand=999995.

*台中市第四選區.
if (q164=01)cand=660401.
if (q164=02)cand=660402.
if (q164=71)cand=660471.
if (q164=72)cand=660472.
if (q164=85)cand=660485.
if (q164=88 and q198=01)cand=690101.
if (q164=88 and q198=02)cand=690102.
if (q164=88 and q198=03)cand=690103.
if (q164=88 and q198=04)cand=690104.
if (q164=88 and q198=07)cand=690107.
if (q164=88 and q198=09)cand=690109.
if (q164=88 and q198=10)cand=690110.
if (q164=88 and q198=11)cand=690111.
if (q164=88 and q198=12)cand=690112.
if (q164=89 and q200=01)cand=700101.
if (q164=89 and q200=02)cand=700102.
if (q164=89 and q200=03)cand=700103.
if (q164=89 and q200=06)cand=700106.
if (q164=89 and q200=08)cand=700108.
if (q164=89 and q200=09)cand=700109.
if (q164=89 and q200=10)cand=700110.
if (q164=89 and q200=11)cand=700111.
if (q164=89 and q200=12)cand=700112.
if (q164=89 and q200=13)cand=700113.
if (q164=92 or q164=96 or q164=98)cand=999992.
if (q164=90)cand=999990.
if (q164=91)cand=999991.
if (q164=93)cand=999993.
if (q164=94)cand=999994.
if (q164=95)cand=999995.

*台中市第五選區.
if (q166=01)cand=660501.
if (q166=02)cand=660502.
if (q166=25)cand=660525.
if (q166=71)cand=660571.
if (q166=77)cand=660577.
if (q166=79)cand=660579.
if (q166=84)cand=660584.
if (q166=85)cand=660585.
if (q166=88 and q198=01)cand=690101.
if (q166=88 and q198=02)cand=690102.
if (q166=88 and q198=03)cand=690103.
if (q166=88 and q198=04)cand=690104.
if (q166=88 and q198=07)cand=690107.
if (q166=88 and q198=09)cand=690109.
if (q166=88 and q198=10)cand=690110.
if (q166=88 and q198=11)cand=690111.
if (q166=88 and q198=12)cand=690112.
if (q166=89 and q200=01)cand=700101.
if (q166=89 and q200=02)cand=700102.
if (q166=89 and q200=03)cand=700103.
if (q166=89 and q200=06)cand=700106.
if (q166=89 and q200=08)cand=700108.
if (q166=89 and q200=09)cand=700109.
if (q166=89 and q200=10)cand=700110.
if (q166=89 and q200=11)cand=700111.
if (q166=89 and q200=12)cand=700112.
if (q166=89 and q200=13)cand=700113.
if (q166=92 or q166=96 or q166=98)cand=999992.
if (q166=90)cand=999990.
if (q166=91)cand=999991.
if (q166=93)cand=999993.
if (q166=94)cand=999994.
if (q166=95)cand=999995.

*台中市第六選區.
if (q168=01)cand=660601.
if (q168=02)cand=660602.
if (q168=25)cand=660625.
if (q168=84)cand=660684.
if (q168=85)cand=660685.
if (q168=88 and q198=01)cand=690101.
if (q168=88 and q198=02)cand=690102.
if (q168=88 and q198=03)cand=690103.
if (q168=88 and q198=04)cand=690104.
if (q168=88 and q198=07)cand=690107.
if (q168=88 and q198=09)cand=690109.
if (q168=88 and q198=10)cand=690110.
if (q168=88 and q198=11)cand=690111.
if (q168=88 and q198=12)cand=690112.
if (q168=89 and q200=01)cand=700101.
if (q168=89 and q200=02)cand=700102.
if (q168=89 and q200=03)cand=700103.
if (q168=89 and q200=06)cand=700106.
if (q168=89 and q200=08)cand=700108.
if (q168=89 and q200=09)cand=700109.
if (q168=89 and q200=10)cand=700110.
if (q168=89 and q200=11)cand=700111.
if (q168=89 and q200=12)cand=700112.
if (q168=89 and q200=13)cand=700113.
if (q168=92 or q168=96 or q168=98)cand=999992.
if (q168=90)cand=999990.
if (q168=91)cand=999991.
if (q168=93)cand=999993.
if (q168=94)cand=999994.
if (q168=95)cand=999995.

*台中市第七選區.
if (q170=01)cand=660701.
if (q170=02)cand=660702.
if (q170=77)cand=660777.
if (q170=88 and q198=01)cand=690101.
if (q170=88 and q198=02)cand=690102.
if (q170=88 and q198=03)cand=690103.
if (q170=88 and q198=04)cand=690104.
if (q170=88 and q198=07)cand=690107.
if (q170=88 and q198=09)cand=690109.
if (q170=88 and q198=10)cand=690110.
if (q170=88 and q198=11)cand=690111.
if (q170=88 and q198=12)cand=690112.
if (q170=89 and q200=01)cand=700101.
if (q170=89 and q200=02)cand=700102.
if (q170=89 and q200=03)cand=700103.
if (q170=89 and q200=06)cand=700106.
if (q170=89 and q200=08)cand=700108.
if (q170=89 and q200=09)cand=700109.
if (q170=89 and q200=10)cand=700110.
if (q170=89 and q200=11)cand=700111.
if (q170=89 and q200=12)cand=700112.
if (q170=89 and q200=13)cand=700113.
if (q170=92 or q170=96 or q170=98)cand=999992.
if (q170=90)cand=999990.
if (q170=91)cand=999991.
if (q170=93)cand=999993.
if (q170=94)cand=999994.
if (q170=95)cand=999995.
      
*台中市第八選區.
if (q172=01)cand=660801.
if (q172=02)cand=660802.
if (q172=88 and q198=01)cand=690101.
if (q172=88 and q198=02)cand=690102.
if (q172=88 and q198=03)cand=690103.
if (q172=88 and q198=04)cand=690104.
if (q172=88 and q198=07)cand=690107.
if (q172=88 and q198=09)cand=690109.
if (q172=88 and q198=10)cand=690110.
if (q172=88 and q198=11)cand=690111.
if (q172=88 and q198=12)cand=690112.
if (q172=89 and q200=01)cand=700101.
if (q172=89 and q200=02)cand=700102.
if (q172=89 and q200=03)cand=700103.
if (q172=89 and q200=06)cand=700106.
if (q172=89 and q200=08)cand=700108.
if (q172=89 and q200=09)cand=700109.
if (q172=89 and q200=10)cand=700110.
if (q172=89 and q200=11)cand=700111.
if (q172=89 and q200=12)cand=700112.
if (q172=89 and q200=13)cand=700113.
if (q172=92 or q172=96 or q172=98)cand=999992.
if (q172=90)cand=999990.
if (q172=91)cand=999991.
if (q172=93)cand=999993.
if (q172=94)cand=999994.
if (q172=95)cand=999995.

*台南市第一選區.
if (q174=01)cand=670101.
if (q174=02)cand=670102.
if (q174=25)cand=670125.
if (q174=80)cand=670180.
if (q174=84)cand=670184.
if (q174=85)cand=670185.
if (q174=88 and q198=01)cand=690101.
if (q174=88 and q198=02)cand=690102.
if (q174=88 and q198=03)cand=690103.
if (q174=88 and q198=04)cand=690104.
if (q174=88 and q198=07)cand=690107.
if (q174=88 and q198=09)cand=690109.
if (q174=88 and q198=10)cand=690110.
if (q174=88 and q198=11)cand=690111.
if (q174=88 and q198=12)cand=690112.
if (q174=89 and q200=01)cand=700101.
if (q174=89 and q200=02)cand=700102.
if (q174=89 and q200=03)cand=700103.
if (q174=89 and q200=06)cand=700106.
if (q174=89 and q200=08)cand=700108.
if (q174=89 and q200=09)cand=700109.
if (q174=89 and q200=10)cand=700110.
if (q174=89 and q200=11)cand=700111.
if (q174=89 and q200=12)cand=700112.
if (q174=89 and q200=13)cand=700113.
if (q174=92 or q174=96 or q174=98)cand=999992.
if (q174=90)cand=999990.
if (q174=91)cand=999991.
if (q174=93)cand=999993.
if (q174=94)cand=999994.
if (q174=95)cand=999995.


*台南市第二選區.
if (q176=02)cand=670202.
if (q176=73)cand=670273.
if (q176=84)cand=670284.
if (q176=88 and q198=01)cand=690101.
if (q176=88 and q198=02)cand=690102.
if (q176=88 and q198=03)cand=690103.
if (q176=88 and q198=04)cand=690104.
if (q176=88 and q198=07)cand=690107.
if (q176=88 and q198=09)cand=690109.
if (q176=88 and q198=10)cand=690110.
if (q176=88 and q198=11)cand=690111.
if (q176=88 and q198=12)cand=690112.
if (q176=89 and q200=01)cand=700101.
if (q176=89 and q200=02)cand=700102.
if (q176=89 and q200=03)cand=700103.
if (q176=89 and q200=06)cand=700106.
if (q176=89 and q200=08)cand=700108.
if (q176=89 and q200=09)cand=700109.
if (q176=89 and q200=10)cand=700110.
if (q176=89 and q200=11)cand=700111.
if (q176=89 and q200=12)cand=700112.
if (q176=89 and q200=13)cand=700113.
if (q176=92 or q176=96 or q176=98)cand=999992.
if (q176=90)cand=999990.
if (q176=91)cand=999991.
if (q176=93)cand=999993.
if (q176=94)cand=999994.
if (q176=95)cand=999995.

*台南市第三選區.
if (q178=01)cand=670301.
if (q178=02)cand=670302.
if (q178=88 and q198=01)cand=690101.
if (q178=88 and q198=02)cand=690102.
if (q178=88 and q198=03)cand=690103.
if (q178=88 and q198=04)cand=690104.
if (q178=88 and q198=07)cand=690107.
if (q178=88 and q198=09)cand=690109.
if (q178=88 and q198=10)cand=690110.
if (q178=88 and q198=11)cand=690111.
if (q178=88 and q198=12)cand=690112.
if (q178=89 and q200=01)cand=700101.
if (q178=89 and q200=02)cand=700102.
if (q178=89 and q200=03)cand=700103.
if (q178=89 and q200=06)cand=700106.
if (q178=89 and q200=08)cand=700108.
if (q178=89 and q200=09)cand=700109.
if (q178=89 and q200=10)cand=700110.
if (q178=89 and q200=11)cand=700111.
if (q178=89 and q200=12)cand=700112.
if (q178=89 and q200=13)cand=700113.
if (q178=92 or q178=96 or q178=98)cand=999992.
if (q178=90)cand=999990.
if (q178=91)cand=999991.
if (q178=93)cand=999993.
if (q178=94)cand=999994.
if (q178=95)cand=999995.

*台南市第四選區.
if (q180=02)cand=670402.
if (q180=77)cand=670477.
if (q180=84)cand=670484.
if (q180=88 and q198=01)cand=690101.
if (q180=88 and q198=02)cand=690102.
if (q180=88 and q198=03)cand=690103.
if (q180=88 and q198=04)cand=690104.
if (q180=88 and q198=07)cand=690107.
if (q180=88 and q198=09)cand=690109.
if (q180=88 and q198=10)cand=690110.
if (q180=88 and q198=11)cand=690111.
if (q180=88 and q198=12)cand=690112.
if (q180=89 and q200=01)cand=700101.
if (q180=89 and q200=02)cand=700102.
if (q180=89 and q200=03)cand=700103.
if (q180=89 and q200=06)cand=700106.
if (q180=89 and q200=08)cand=700108.
if (q180=89 and q200=09)cand=700109.
if (q180=89 and q200=10)cand=700110.
if (q180=89 and q200=11)cand=700111.
if (q180=89 and q200=12)cand=700112.
if (q180=89 and q200=13)cand=700113.
if (q180=92 or q180=96 or q180=98)cand=999992.
if (q180=90)cand=999990.
if (q180=91)cand=999991.
if (q180=93)cand=999993.
if (q180=94)cand=999994.
if (q180=95)cand=999995.

*台南市第五選區.
if (q182=02)cand=670502.
if (q182=72)cand=670572.
if (q182=88 and q198=01)cand=690101.
if (q182=88 and q198=02)cand=690102.
if (q182=88 and q198=03)cand=690103.
if (q182=88 and q198=04)cand=690104.
if (q182=88 and q198=07)cand=690107.
if (q182=88 and q198=09)cand=690109.
if (q182=88 and q198=10)cand=690110.
if (q182=88 and q198=11)cand=690111.
if (q182=88 and q198=12)cand=690112.
if (q182=89 and q200=01)cand=700101.
if (q182=89 and q200=02)cand=700102.
if (q182=89 and q200=03)cand=700103.
if (q182=89 and q200=06)cand=700106.
if (q182=89 and q200=08)cand=700108.
if (q182=89 and q200=09)cand=700109.
if (q182=89 and q200=10)cand=700110.
if (q182=89 and q200=11)cand=700111.
if (q182=89 and q200=12)cand=700112.
if (q182=89 and q200=13)cand=700113.
if (q182=92 or q182=96 or q182=98)cand=999992.
if (q182=90)cand=999990.
if (q182=91)cand=999991.
if (q182=93)cand=999993.
if (q182=94)cand=999994.
if (q182=95)cand=999995.

*台南市第六選區.
if (q184=01)cand=670601.
if (q184=02)cand=670602.
if (q184=84)cand=670684.
if (q184=88 and q198=01)cand=690101.
if (q184=88 and q198=02)cand=690102.
if (q184=88 and q198=03)cand=690103.
if (q184=88 and q198=04)cand=690104.
if (q184=88 and q198=07)cand=690107.
if (q184=88 and q198=09)cand=690109.
if (q184=88 and q198=10)cand=690110.
if (q184=88 and q198=11)cand=690111.
if (q184=88 and q198=12)cand=690112.
if (q184=89 and q200=01)cand=700101.
if (q184=89 and q200=02)cand=700102.
if (q184=89 and q200=03)cand=700103.
if (q184=89 and q200=06)cand=700106.
if (q184=89 and q200=08)cand=700108.
if (q184=89 and q200=09)cand=700109.
if (q184=89 and q200=10)cand=700110.
if (q184=89 and q200=11)cand=700111.
if (q184=89 and q200=12)cand=700112.
if (q184=89 and q200=13)cand=700113.
if (q184=92 or q184=96 or q184=98)cand=999992.
if (q184=90)cand=999990.
if (q184=91)cand=999991.
if (q184=93)cand=999993.
if (q184=94)cand=999994.
if (q184=95)cand=999995.

*金門縣.
if (q98=01)cand=280101.
if (q98=41)cand=280141.
if (q98=84)cand=280184.
if (q98=88 and q198=01)cand=690101.
if (q98=88 and q198=02)cand=690102.
if (q98=88 and q198=03)cand=690103.
if (q98=88 and q198=04)cand=690104.
if (q98=88 and q198=07)cand=690107.
if (q98=88 and q198=09)cand=690109.
if (q98=88 and q198=10)cand=690110.
if (q98=88 and q198=11)cand=690111.
if (q98=88 and q198=12)cand=690112.
if (q98=89 and q200=01)cand=700101.
if (q98=89 and q200=02)cand=700102.
if (q98=89 and q200=03)cand=700103.
if (q98=89 and q200=06)cand=700106.
if (q98=89 and q200=08)cand=700108.
if (q98=89 and q200=09)cand=700109.
if (q98=89 and q200=10)cand=700110.
if (q98=89 and q200=11)cand=700111.
if (q98=89 and q200=12)cand=700112.
if (q98=89 and q200=13)cand=700113.
if (q98=92 or q98=96 or q98=98)cand=999992.
if (q98=90)cand=999990.
if (q98=91)cand=999991.
if (q98=93)cand=999993.
if (q98=94)cand=999994.
if (q98=95)cand=999995.


*連江縣.
if (q100=01)cand=290101.
if (q100=02)cand=290102.
if (q100=41)cand=290141.
if (q100=88 and q198=01)cand=690101.
if (q100=88 and q198=02)cand=690102.
if (q100=88 and q198=03)cand=690103.
if (q100=88 and q198=04)cand=690104.
if (q100=88 and q198=07)cand=690107.
if (q100=88 and q198=09)cand=690109.
if (q100=88 and q198=10)cand=690110.
if (q100=88 and q198=11)cand=690111.
if (q100=88 and q198=12)cand=690112.
if (q100=89 and q200=01)cand=700101.
if (q100=89 and q200=02)cand=700102.
if (q100=89 and q200=03)cand=700103.
if (q100=89 and q200=06)cand=700106.
if (q100=89 and q200=08)cand=700108.
if (q100=89 and q200=09)cand=700109.
if (q100=89 and q200=10)cand=700110.
if (q100=89 and q200=11)cand=700111.
if (q100=89 and q200=12)cand=700112.
if (q100=89 and q200=13)cand=700113.
if (q100=92 or q100=96 or q100=98)cand=999992.
if (q100=90)cand=999990.
if (q100=91)cand=999991.
if (q100=93)cand=999993.
if (q100=94)cand=999994.
if (q100=95)cand=999995.

*平地原住民.
if (q198=92 or q198=96 or q198=98)cand=999992.
if (q198=90)cand=999990.
if (q198=91)cand=999991.
if (q198=93)cand=999993.
if (q198=94)cand=999994.
if (q198=95)cand=999995.

*山地原住民.
if (q200=92 or q200=96 or q200=98)cand=999992.
if (q200=90)cand=999990.
if (q200=91)cand=999991.
if (q200=93)cand=999993.
if (q200=94)cand=999994.
if (q200=95)cand=999995.

var lab Cand "投票對象".

val lab Cand
630101 "張斯綱/男/中國國民黨"
630102 "吳思瑤/女/民主進步黨"
630148 "賴宗育/男/人民民主黨"
630171 "陳執中/男/台灣雙語無法黨"
630173 "張臺勝/男/人民最大黨"
630174 "胡金城/男/人民最大黨"
630184 "許盛鋒/男/無"
630185 "侯漢廷/男/無"
630201 "游淑慧/女/中國國民黨"
630202 "王世堅/男/民主進步黨"
630225 "郭啟源/男/中華統一促進黨"
630273 "何梅娟/女/人民最大黨"
630275 "熊嘉玲/女/制度救世島"
630301 "王鴻薇/女/中國國民黨"
630302 "謝佩芬/女/民主進步黨"
630342 "楊時睿/男/台灣維新"
630371 "陳一郎/男/台灣雙語無法黨"
630373 "余新造/男/人民最大黨"
630375 "高士恩/男/制度救世島"
630384 "陳源發/男/無"
630401 "李彥秀/女/中國國民黨"
630402 "高嘉瑜/女/民主進步黨"
630417 "吳欣岱/女/台灣基進"
630459 "林秋彤/女/台灣整復師聯盟工黨"
630475 "黃啟彬/男/制度救世島"
630501 "鍾小平/男/中國國民黨"
630502 "吳沛憶/女/民主進步黨"
630538 "許敬民/男/合一行動聯盟"
630576 "張華特/男/台灣麻將最大黨"
630577 "李慧曦/女/司法改革黨"
630578 "蘇諍/男/經濟黨"
630584 "于美人/女/無"
630585 "林志成/男/無"
630586 "陳燕玉/女/無"
630587 "孫智麗/女/無"
630601 "羅智強/男/中國國民黨"
630624 "苗博雅/女/社會民主黨"
630642 "朱翊銘/男/台灣維新"
630671 "崔建章/男/台灣雙語無法黨"
630675 "張雪卿/女/制度救世島"
630701 "徐巧芯/女/中國國民黨"
630702 "許淑華/女/民主進步黨"
630742 "羅丹/男/台灣維新"
630753 "李承龍/男/中華愛國同心黨"
630784 "陳韋安/男/無"
630801 "賴士葆/男/中國國民黨"
630802 "王閔生/男/民主進步黨"
630841 "張其祿/男/台灣民眾黨"
630842 "劉佩玲/女/台灣維新"
630867 "胡之壯/男/興中同盟會"
630879 "賴宣任/女/小民參政歐巴桑聯盟"
630884 "夏萬浪/男/無"
630885 "張維學/男/無"
650101 "洪孟楷/男/中國國民黨"
650102 "何博文/男/民主進步黨"
650125 "翁藤原/男/中華統一促進黨"
650142 "徐百弟/男/台灣維新"
650175 "游清池/男/制度救世島"
650202 "林淑芬/女/民主進步黨"
650225 "何淯笙/男/中華統一促進黨"
650241 "李有宜/女/台灣民眾黨"
650301 "蔡明堂/男/中國國民黨"
650302 "李坤城/男/民主進步黨"
650384 "陳東雲/男/無"
650385 "蘇卿彥/男/無"
650401 "蔣欣璋/男/中國國民黨"
650402 "吳秉叡/男/民主進步黨"
650475 "邱吉均/男/制度救世島"
650484 "蘇輝湟/男/無"
650485 "洪懿馥/女/無"
650501 "洪佳君/女/中國國民黨"
650502 "蘇巧慧/女/民主進步黨"
650601 "林國春/男/中國國民黨"
650602 "張宏陸/男/民主進步黨"
650677 "黃淑珍/女/司法改革黨"
650701 "葉元之/男/中國國民黨"
650702 "羅致政/男/民主進步黨"
650779 "劉書婷/女/小民參政歐巴桑聯盟"
650801 "張智倫/男/中國國民黨"
650802 "吳崢/男/民主進步黨"
650841 "邱臣遠/男/台灣民眾黨"
650901 "林德福/男/中國國民黨"
650902 "莊銘淵/男/民主進步黨"
650942 "陳愷寧/女/台灣維新"
651001 "林金結/男/中國國民黨"
651002 "吳琪銘/男/民主進步黨"
651073 "孟藹倫/女/人民最大黨"
651080 "袁興/男/復康聯盟黨"
651101 "羅明才/男/中國國民黨"
651102 "曾柏瑜/女/民主進步黨"
651152 "陳聖/男/中華婦女黨"
651173 "張家榛/女/人民最大黨"
651175 "魏趨安/男/制度救世島"
651184 "鄭添泉/男/無"
651201 "廖先翔/男/中國國民黨"
651202 "賴品妤/女/民主進步黨"
651242 "陳長志/男/台灣維新"
651271 "李佳蒨/女/台灣雙語無法黨"
651284 "黃瑞傳/男/無"
651285 "楊木火/男/無"
680101 "牛煦庭/男/中國國民黨"
680102 "鄭運鵬/男/民主進步黨"
680184 "馬治薇/女/無"
680201 "涂權吉/男/中國國民黨"
680202 "黃世杰/男/民主進步黨"
680225 "陳志豪/男/中華統一促進黨"
680284 "王思玟/男/無"
680301 "魯明哲/男/中國國民黨"
680302 "彭俊豪/男/民主進步黨"
680303 "游智彬/男/新黨"
680375 "戴浙/男/制度救世島"
680379 "徐鶯慈/女/小民參政歐巴桑聯盟"
680401 "萬美玲/女/中國國民黨"
680402 "范綱祥/男/民主進步黨"
680481 "甘乃迪/男/台灣國民黨"
680484 "黃明莉/女/無"
680501 "呂玉玲/女/中國國民黨"
680502 "劉仁照/男/民主進步黨"
680541 "賴香伶/女/台灣民眾黨"
680577 "易乃文/男/司法改革黨"
680601 "邱若華/女/中國國民黨"
680641 "李慕妍/女/台灣民眾黨"
680673 "翁紹庭/女/人民最大黨"
680680 "劉睿宸/男/復康聯盟黨"
680684 "葉堂宇/男/無"
680685 "趙正宇/男/無"
660102 "蔡其昌/男/民主進步黨"
660141 "蔡壁如/女/台灣民眾黨"
660184 "賴信全/男/無"
660185 "劉燈鐘/男/無"
660201 "顏寬恆/男/中國國民黨"
660202 "林靜儀/女/民主進步黨"
660261 "洪麗華/女/司法正義黨"
660284 "紀銘修/男/無"
660301 "楊瓊瓔/女/中國國民黨"
660302 "謝子涵/女/民主進步黨"
660377 "張炯春/男/司法改革黨"
660401 "廖偉翔/男/中國國民黨"
660402 "張廖萬堅/男/民主進步黨"
660471 "李海碩/男/台灣雙語無法黨"
660472 "林中翊/男/台灣雙語無法黨"
660485 "陳志彬/男/無"
660501 "黃健豪/男/中國國民黨"
660502 "莊競程/男/民主進步黨"
660525 "林澤培/女/中華統一促進黨"
660571 "謝旻汎/男/台灣雙語無法黨"
660577 "彭振芳/男/司法改革黨"
660579 "蔡善雯/女/小民參政歐巴桑聯盟"
660584 "苗豐隆/男/無"
660585 "陳維新/女/無"
660601 "羅廷瑋/男/中國國民黨"
660602 "江肇國/男/民主進步黨"
660625 "黃千庭/女/中華統一促進黨"
660684 "賀姿華/女/無"
660685 "紀文清/男/無"
660701 "林家興/男/中國國民黨"
660702 "何欣純/女/民主進步黨"
660777 "林振東/男/司法改革黨"
660801 "江啟臣/男/中國國民黨"
660802 "謝志忠/男/民主進步黨"
670101 "周宏昌/男/中國國民黨"
670102 "賴惠員/女/民主進步黨"
670125 "林芳竹/女/中華統一促進黨"
670180 "蔡承攸/男/復康聯盟黨"
670184 "侯陸太/男/無"
670185 "魏耀乾/男/無"
670202 "郭國文/男/民主進步黨"
670273 "詹秋嫻/女/人民最大黨"
670284 "陳昆和/男/無"
670301 "姚正玉/女/中國國民黨"
670302 "陳亭妃/女/民主進步黨"
670402 "林宜瑾/女/民主進步黨"
670477 "劉清田/男/司法改革黨"
670484 "李全教/男/無"
670502 "林俊憲/男/民主進步黨"
670572 "蕭燐洪/男/台灣雙語無法黨"
670601 "陳以信/男/中國國民黨"
670602 "王定宇/男/民主進步黨"
670684 "陳永和/男/無"
640102 "邱議瑩/女/民主進步黨"
640141 "曾尹儷/女/台灣民眾黨"
640173 "劉承智/男/人民最大黨"
640184 "林義迪/男/無"
640201 "曹桓榮/男/中國國民黨"
640202 "邱志偉/男/民主進步黨"
640301 "李眉蓁/女/中國國民黨"
640302 "李柏毅/男/民主進步黨"
640376 "郭璽/男/台灣麻將最大黨"
640384 "張正達/男/無"
640385 "陳銓霖/男/無"
640401 "陳若翠/女/中國國民黨"
640402 "林岱樺/女/民主進步黨"
640501 "黃柏霖/男/中國國民黨"
640502 "李昆澤/男/民主進步黨"
640579 "張芳愉/女/小民參政歐巴桑聯盟"
640584 "楊椒喬/男/無"
640601 "陳美雅/女/中國國民黨"
640602 "黃捷/女/民主進步黨"
640644 "郭倍宏/男/喜樂島聯盟"
640701 "鍾易仲/男/中國國民黨"
640702 "許智傑/男/民主進步黨"
640777 "王和平統一/男/司法改革黨"
640784 "洪啟修/男/無"
640801 "李明璇/女/中國國民黨"
640802 "賴瑞隆/男/民主進步黨"
640813 "湛秀英/女/勞動黨"
640877 "李政憲/男/司法改革黨"
040101 "徐欣瑩/女/中國國民黨"
040102 "詹紀緹/女/民主進步黨"
040109 "余筱菁/女/台灣綠黨"
040142 "劉復嵐/男/台灣維新"
040179 "劉台穠/女/小民參政歐巴桑聯盟"
040201 "林思銘/男/中國國民黨"
040202 "曾聖凱/男/民主進步黨"
040219 "王婉諭/女/時代力量"
050102 "康世明/男/民主進步黨"
050184 "陳超明/男/無"
050201 "邱鎮軍/男/中國國民黨"
050284 "曾玟學/男/無"
070101 "阮厚爵/男/中國國民黨"
070102 "陳秀寶/女/民主進步黨"
070184 "蘇群傑/男/無"
070201 "楊曜聰/男/中國國民黨"
070202 "黃秀芳/女/民主進步黨"
070301 "謝衣鳳/女/中國國民黨"
070302 "吳音寧/女/民主進步黨"
070325 "桂麗娜/女/中華統一促進黨"
070384 "洪建興/男/無"
070401 "鄭俊雄/男/中國國民黨"
070402 "陳素月/女/民主進步黨"
070471 "鄭錫懋/男/台灣雙語無法黨"
070482 "蔡念諶/男/中華文化共和黨"
080101 "馬文君/女/中國國民黨"
080102 "蔡銘軒/男/民主進步黨"
080113 "許文忠/男/勞動黨"
080179 "李圓恩/女/小民參政歐巴桑聯盟"
080184 "林金潭/男/無"
080201 "游顥/男/中國國民黨"
080202 "蔡培慧/女/民主進步黨"
080284 "陳癸佑/男/無"
090101 "丁學忠/男/中國國民黨"
090102 "蘇治芬/女/民主進步黨"
090125 "郭炳宏/男/中華統一促進黨"
090170 "李昭儀/女/台灣革命黨"
090184 "吳炳輝/男/無"
090185 "陳俊龍/男/無"
090201 "邱良閱/男/中國國民黨"
090202 "劉建國/男/民主進步黨"
100101 "詹琬蓁/女/中國國民黨"
100102 "蔡易餘/男/民主進步黨"
100202 "陳冠廷/男/民主進步黨"
100242 "黃一哲/男/台灣維新"
100275 "簡銘傑/男/制度救世島"
100284 "林國慶/男/無"
100285 "廖昱婧/女/無"
130101 "黃明賢/男/中國國民黨"
130102 "鍾佳濱/男/民主進步黨"
130125 "李孟翰/男/中華統一促進黨"
130142 "張庭源/男/台灣維新"
130184 "蔣月惠/女/無"
130185 "曾鈺庭/男/無"
130202 "徐富癸/男/民主進步黨"
130256 "吳媚宮/女/中華聯合黨"
130273 "何秋葺/女/人民最大黨"
130284 "蘇孟淳/男/無"
020101 "黃琤婷/女/中國國民黨"
020102 "陳俊宇/男/民主進步黨"
020117 "林意評/男/台灣基進"
020141 "陳琬惠/女/台灣民眾黨"
020175 "邱介勳/男/制度救世島"
020184 "林錦坤/男/無"
150101 "傅崑萁/男/中國國民黨"
150102 "張美慧/女/民主進步黨"
150175 "周玉梅/女/制度救世島"
150184 "許願神/男/無"
140101 "黃建賓/男/中國國民黨"
140102 "賴坤成/男/民主進步黨"
140179 "黃婉茹/女/小民參政歐巴桑聯盟"
140184 "許瑞貴/男/無"
140185 "劉櫂豪/男/無"
140186 "陳長宏/男/無"
160101 "吳政杰/男/中國國民黨"
160102 "楊曜/男/民主進步黨"
160184 "陳慧娟/女/無"
280101 "陳玉珍/女/中國國民黨"
280141 "尚文凱/女/台灣民眾黨"
280184 "洪和成/男/無"
290101 "陳雪生/男/中國國民黨"
290102 "李問/男/民主進步黨"
290141 "曹爾凱/男/台灣民眾黨"
170101 "林沛祥/男/中國國民黨"
170102 "鄭文婷/女/民主進步黨"
170179 "謝海菁/女/小民參政歐巴桑聯盟"
170181 "邱紹祐/男/家庭基本收入"
170183 "黃傑陽/男/無"
170185 "王醒之/男/無"
180101 "鄭正鈐/男/中國國民黨"
180102 "林志潔/女/民主進步黨"
180119 "邱顯智/男/時代力量"
180175 "趙福龍/男/制度救世島"
180177 "楊清華/男/司法改革黨"
180184 "柯美蘭/女/無"
180185 "王榮德/男/無"
200101 "張秀華/女/中國國民黨"
200102 "王美惠/女/民主進步黨"
200171 "林智勳/男/台灣雙語無法黨"
200179 "陳玥妗/女/小民參政歐巴桑聯盟"
200180 "蔡松益/男/復康聯盟黨"
200184 "簡明廉/男/無"
690101 "黃仁/男/中國國民黨"
690102 "鄭天財 Sra-Kacaw/男/中國國民黨"
690103 "陳瑩/女/民主進步黨"
690104 "米甘幹-理佛克/男/新黨"
690107 "陳國榮/男/台灣維新"
690109 "陳政宗/男/無"
690110 "忠仁-達祿斯/男/無"
690111 "高美珠/女/無"
690112 "吳建智咖啡哥/男/無"
700101 "孔文吉/男/中國國民黨"
700102 "盧縣一/男/中國國民黨"
700103 "伍麗華 Saidhai-Tahovecahe/女/民主進步黨"
700106 "胡黃廣文/男/台灣民眾黨"
700108 "高畹芯/女/司法改革黨"
700109 "張子孝/男/無"
700110 "高金素梅/女/無"
700111 "林果/女/無"
700112 "林世偉/男/無"
700113 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
999990 "無投票權"
999991 "不領票"
999992 "還沒決定"
999993 "不會去投"
999994 "投廢票"
999995 "拒答"
999996 "看情形"
999998 "不知道".                      

fre cand.
*建立選區投票對象(以政黨歸類）vt_dtc.
compute VT_dtc=cand.
recode VT_dtc (630101 630201 630301 630401 630501 630601 630701 630801 650101 650301 650401 650501 650601 650701 650801 650901 651001 651101
               651201 680101 680201 680301 680401 680501 680601 660201 660301 660401 660501 660601 660701 660801 670101 670301 670601 640201 
               640301 640401 640501 640601 640701 640801 040101 040201 050201 070101 070201 070301 070401 080101 080201 090101 090201 100101
               130101 020101 150101 140101 160101 280101 290101 170101 180101 200101 690101 690102 700101 700102=01)
              (630102 630202 630302 630402 630502 630702 630802 650102 650202 650302 650402 650502 650602 650702 650802 650902 651002 651102
               651202 680102 680202 680302 680402 680502 660102 660202 660302 660402 660502 660602 660702 660802 670102 670202 670302 670402 
               670502 670602 640102 640202 640302 640402 640502 640602 640702 640802 040102 040202 050102 070102 070202 070302 070402 080102
               080202 090102 090202 100102 100202 130102 130202 020102 150102 140102 160102 290102 170102 180102 200102 690103 700103=02)
              (680303 690104=03)
              (040109=09)
              (640813 080113=13)
              (630417 020117=17)
              (040219 180119=19)
              (630624=24)
              (630225 650125 650225 680225 660525 660625 670125 070325 090125 130125=25)
              (630538=38)
              (630841 650241 650841 680541 680641 660141 640141 020141 280141 290141 700106=41)
              (630342 630642 630742 630842 650142 650942 651242 040142 100242 130142 690107=42)
              (640644=44)
              (630148=48)
              (651152=52)
              (630753=53)
              (130256=56)
              (630459=59)
              (660261=61)
              (630867=67)
              (090170=70)
              (630171 630371 630671 651271 660471 660571 070471 200171 660472 670572=71)
              (630173 630174 630273 630373 651073 651173 680673 670273 640173 130273=73)
              (630275 630375 630475 630675 650175 650475 651175 680375 100275 020175 150175 180175=75)
              (630576 640376=76)
              (630577 650677 680577 660377 660577 660777 670477 640777 640877 180177 700108=77)
              (630578=78)
              (630879 650779 680379 660579 640579 040179 080179 140179 170179 200179=79)
              (651080 680680 670180 200180=80)
              (680481=81)
              (070482=82)
              (170183 170181=83)
              (630184 630185 630384 630584 630585 630586 630587 630784 630884 630885 650384 650385 650484 650485 651184 651284 651285 680184
               680284 680484 680684 680685 660184 660185 660284 660485 660584 660585 660684 660685 670184 670185 670284 670484 670684 640184 
               640384 640385 640584 640784 050184 050284 070184 070384 080184 080284 090184 090185 100284 100285 130184 130185 130285 130284 020184 
               150184 140184 140185 140186 160184 280184 170185 180184 180185 200184 690109 690110 690111 690112 700109 700110 700111 700112=84)
              (999989=89)(999990=90)(999991=91)(999992=92)(999993=93)(999994=94)(999995=95).        

var lab VT_dtc "選民區域投票候選人之政黨".
val lab VT_dtc  01 "國民黨"             02 "民進黨"          03 "新黨"               09 "台灣綠黨"         13 "勞動黨"
                17 "台灣基進"           19 "時代力量"        24 "社會民主黨"         25 "中華統一促進黨"   38 "合一行動聯盟"
                41 "台灣民眾黨"         42 "台灣維新"        44 "喜樂島聯盟"         48 "人民民主黨"       52 "中華婦女黨"
                53 "中華愛國同心黨"     56 "中華聯合黨"      59 "台灣整復師聯盟工黨" 61 "司法正義黨"       67 "興中同盟會"
                70 "台灣革命黨"         71 "台灣雙語無法黨"  73 "人民最大黨"         75 "制度救世島"       76 "台灣麻將最大黨"  
                77 "司法改革黨"         78 "經濟黨"          79 "小民參政歐巴桑聯盟" 80 "復康聯盟黨"       81 "台灣國民黨"      
                82 "中華文化共和黨"     83 "家庭基本收入"    84 "無黨籍"
                90"無投票權"            91"不領票 "          92"還沒決定"            93"不會去投"          94"投廢票"
                95"拒答"         .


*選區(村里).
recode q35 (5 thru 6=6801)(10 15 38=6801)(45 thru 47=6801)(57 58 76 77 78 79 81 82 83=6801)(1 2 3 4 7 8 9=6804)(1 thru 14=6804)(16 thru 37=6804)
           (39 thru 44=6804)(48 thru 56=6804)(59 thru 75=6804)(80 84=6804)(999=9999)(else=906) into dq35. 
cross dq35 by q35.


recode q36 (1 2=6803)(4 thru 8=6803)(11 12=6803)(14 thru 18=6803)(21 22=6803)(24 thru 29=6803)(31 thru 66=6803)(69 70 72 73 74=6803)
           (76 thru 89=6803)(3 9 10 13 19 20 23 30 67 68 71 75 90=6806)(999=9999)(else=906) into dq36.
cross dq36 by q36.

recode q25 (2 thru 17=6303)(19 20 21 35 36=6303)(18 22=6307)(24 thru 34=6307)(37=6307)(999=9999)(else=906) into dq25.
cross dq25 by q25.


recode q26 (11 thru 31=6305)(32=6305)(1 thru 10=6308)(33=6308)(999=9999)(else=906)into dq26. 
cross dq26 by q26.


recode q27 (27 28 30=6301)(33 thru 42=6301)(52=6301)(1 thru 26=6302)(29 31 32=6302)(43 thru 51=6302)(53=6302)(999=9999)(else=906) into dq27.
cross dq27 by q27.


recode q28 (37 41 42 62 63 64 67 68 88=6405)(1 thru 36=6406)(38 thru 40=6406)(43 thru 61=6406)(65 66 69 89=6406)(999=9999)(else=906) into dq28.
cross dq28 by q28.


recode q29 (1 thru 50=6506)(59 61 62=6506)(101 thru 106=6506)(114 thru 119=6506)(121 127=6506)(51 thru 58=6507)
           (60=6507)(63 thru 100=6507)(107 thru 113=6507)(122 thru 126=6507)(120 128=6507)(999=9999)(else=906) into dq29. 
cross dq29 by q29. 


recode q30 (89 90 96=6502)(98 thru 108=6502)(114 118 120=6502)(1 thru 88=6503)(91 thru 95=6503)(97=6503)
           (109 thru 113=6503)(115 116 117 119 121=6503)(999=9999)(else=906) into dq30. 
cross dq30 by q30.


recode q31 (1 thru 19=6508)(25 26=6508)(34 thru 71=6508)(78 thru 93=6508)(73 94=6508)(20 thru 24=6509)(27 thru 33=6509)
           (72 74 75 76 77 95=6509)(999=9999)(else=906) into dq31.       
cross dq31 by q31. 


recode q32 (1 thru 14=6504)(16 thru 31=6504)(33 34 36 37 39 40 42 43 85=6504)(45 thru 81=6504)(15 32 35 38 41 44 82 83 84 86=6505)
           (999=9999)(else=906) into dq32.
cross dq32 by q32. 


recode q33 (11 thru 20=0401)(22 23 32=0401)(1 thru 10=0402)(24 thru 31=0402)(21 33=0402)(999=9999)(else=916)into dq33. 
cross dq33 by q33. 


recode q34 (4 5 10 11 15 16 21 23 24 28 29 36 37 38 39 40 46=6705)(1 thru 3=6706)(6 thru 9=6706)(12 thru 14=6706)(17 thru 20=6706)
           (22 25 26 27=6706)(30 thru 35=6706)(41 thru 45=6706)(47=6706)(999=9999)(else=916) into dq34. 
cross dq34 by q34. 


compute E_dist=0.
if (q22=05 or q22=07 or q22=14 or dq35=6801) e_dist=6801.
if (q22=04 or q22=06 or q22=11 or q22=12 or q22=15 ) e_dist=6802.
if (q22=16 or dq36=6803) e_dist=6803.
if (q22=17 or dq35=6804) e_dist=6804.
if (q22=09 or q22=10 or q22=18) e_dist=6805.
if (q22=03 or q22=08 or q22=13 or q22=19 or dq36=6806) e_dist=6806.

if (q4=03 or q4=04 or q4=05 or q4=06 or q4=07 or q4=12 or q4=14 or dq33=0401) e_dist=0401.
if (q4=02 or q4=08 or q4=09 or q4=10 or q4=11 or q4=13 or q4=15 or dq33=0402) e_dist=0402. 

if (q5=02 or q5=03 or q5=04 or q5=06 or q5=10 or q5=13 or q5=14 or q5=15 or q5=19) e_dist=0501.
if (q5=01 or q5=05 or q5=07 or q5=08 or q5=09 or q5=11 or q5=12 or q5=16 or q5=17 or q5=18 or q5=20) e_dist=0502.

if (q6=02 or q6=03 or q6=04 or q6=05 or q6=06 or q6=07 or q6=27) e_dist=0701. 
if (q6=01 or q6=08 or q6=09 or q6=28) e_dist=0702.  
if (q6=11 or q6=14 or q6=15 or q6=19 or q6=20 or q6=22 or q6=23 or q6=24 or q6=25 or q6=26 or q6=29) e_dist=0703.
if (q6=10 or q6=12 or q6=13 or q6=16 or q6=17 or q6=18 or q6=21 or q6=30) e_dist=0704.

if (q7=02 or q7=03 or q7=08 or q7=09 or q7=10 or q7=13 or q7=14 ) e_dist=0801.  
if (q7=01 or q7=04 or q7=05 or q7=06 or q7=07 or q7=11 or q7=12 or q7=15) e_dist=0802.

if (q8=03 or q8=05 or q8=06 or q8=13 or q8=14 or q8=15 or q8=16 or q8=17 or q8=18 or q8=19 or q8=20 or q8=21) e_dist=0901. 
if (q8=01 or q8=02 or q8=04 or q8=07 or q8=08 or q8=09 or q8=10 or q8=11 or q8=12 or q8=22) e_dist=0902.

if (q9=01 or q9=02 or q9=03 or q9=08 or q9=09 or q9=10 or q9=11 or q9=12 or q9=19) e_dist=1001. 
if (q9=04 or q9=05 or q9=06 or q9=07 or q9=13 or q9=14 or q9=15 or q9=16 or q9=17 or q9=18 or q9=20) e_dist=1002.

if (q10=01 or q10=06 or q10=07 or q10=08 or q10=09 or q10=10 or q10=11 or q10=13 or q10=26 or q10=27 or q10=28 or q10=34) e_dist=1301.
if (q10=02 or q10=03 or q10=04 or q10=05 or q10=12 or q10=14 or q10=15 or q10=16 or q10=17 or q10=18 or q10=19 or q10=20 or q10=21 or q10=22 or q10=23 or q10=24 or q10=25 or q10=29 or q10=30 or q10=31 or q10=31 or q10=33 or q10=35) e_dist=1302.   

if (q17=12 or q17=13) e_dist=6301.
if (dq27=6301) e_dist=6301.
if (q17=06 or q17=14) e_dist=6302.
if (dq27=6302) e_dist=6302.
if (q17=04 or q17=15) e_dist=6303.
if (dq25=6303) e_dist=6303.
if (q17=09 or q17=10  or q17=16) e_dist=6304.
if (q17=07 or q17=17) e_dist=6305.
if (dq26=6305) e_dist=6305.
if (q17=03 or q17=18) e_dist=6306.
if (q17=02 or q17=19) e_dist=6307.
if (dq25=6307) e_dist=6307.
if (q17=08 or q17=20) e_dist=6308.
if (dq26=6308) e_dist=6308.

if (q18=15 or q18=16 or q18=21 or q18=22 or q18=23 or q18=30 or q18=31 or q18=32 or q18=33 or q18=34 or q18=35 or q18=36 or q18=37 or q18=38 or q18=39) e_dist=6401.
if (q18=19 or q18=20 or q18=24 or q18=25 or q18=26 or q18=27 or q18=28 or q18=29 or q18=40) e_dist=6402.
if (q18=03 or q18=04 or q18=41) e_dist=6403.
if (q18=13 or q18=14 or q18=17 or q18=18 or q18=42) e_dist=6404.
if (q18=05 or q18=43 or dq28=6405)e_dist=6405.
if (q18=01 or q18=02 or q18=06 or q18=07 or q18=44 or dq28=6406) e_dist=6406.
if (q18=12 or q18=45) e_dist=6407.
if (q18=09 or q18=10 or q18=11 or q18=46) e_dist=6408.

if (q19=10 or q19=16 or q19=17 or q19=21 or q19=22 or q19=23 or q19=30) e_dist=6501.
if (q19=14 or q19=15 or q19=31) e_dist=6502.
if (dq30=6502) e_dist=6502.
if (q19=32) e_dist=6503.
if (dq30=6503) e_dist=6503.
if (q19=33) e_dist=6504.
if (dq32=6504) e_dist=6504.
if (q19=07 or q19=08 or q19=34) e_dist=6505.
if (dq32=6505) e_dist=6505.
if (q19=35) e_dist=6506.
if (dq29=6506) e_dist=6506.
if (q19=36) e_dist=6507.
if (dq29=6507) e_dist=6507.
if (q19=37) e_dist=6508.
if (dq31=6508) e_dist=6508.
if (q19=04 or q19=38) e_dist=6509.
if (dq31=6509) e_dist=6509.
if (q19=09 or q19=13 or q19=39) e_dist=6510.
if (q19=06 or q19=18 or q19=19 or q19=20 or q19=29 or q19=40) e_dist=6511.
if (q19=11 or q19=12 or q19=24 or q19=25 or q19=26 or q19=27 or q19=28 or q19=41) e_dist=6512.        

if (q20=11 or q20=12 or q20=14 or q20=21 or q20=22 or q20=30) e_dist=6601.
if (q20=13 or q20=23 or q20=24 or q20=25 or q20=26 or q20=31) e_dist=6602.
if (q20=15 or q20=16 or q20=17 or q20=18 or q20=32) e_dist=6603.
if (q20=06 or q20=07 or q20=33) e_dist=6604.
if (q20=05 or q20=08 or q20=34) e_dist=6605.
if (q20=01 or q20=02 or q20=03 or q20=04 or q20=35) e_dist=6606.
if (q20=27 or q20=28 or q20=36) e_dist=6607.
if (q20=09 or q20=10 or q20=19 or q20=20 or q20=29 or q20=37) e_dist=6608.    


if (q21=01 or q21=02 or q21=03 or q21=04 or q21=05 or q21=06 or q21=08 or q21=09 or q21=13 or q21=16 or q21=17 or q21=38) e_dist=6701.
if (q21=07 or q21=10 or q21=11 or q21=12 or q21=14 or q21=15 or q21=19 or q21=21 or q21=22 or q21=23 or q21=24 or q21=25 or q21=26 or q21=39) e_dist=6702.
if (q21=34 or q21=35 or q21=40) e_dist=6703.
if (q21=18 or q21=20 or q21=31 or q21=41) e_dist=6704. 
if (q21=33 or q21=36 or q21=37 or q21=42 or dq34=6705) e_dist=6705.
if (q21=27 or q21=28 or q21=29 or q21=30 or dq34=6706) e_dist=6706.   

 
if (q2=02) e_dist=0201.
if (q2=14) e_dist=1401.
if (q2=15) e_dist=1501.
if (q2=16) e_dist=1601.
if (q2=17) e_dist=1701.
if (q2=18) e_dist=1801.
if (q2=20) e_dist=2001.
if (q2=28) e_dist=2801.
if (q2=29) e_dist=2901.
if (q198 ne 99) e_dist=6901.
if (q200 ne 99) e_dist=7001.
recode e_dist (0=9990)(else=copy).

var lab E_dist "選區".
val lab E_dist
0201 "宜蘭縣單一選區"   6801 "桃園市第一選區"   6802 "桃園市第二選區"   6803 "桃園市第三選區"   6804 "桃園市第四選區"
6805 "桃園市第五選區"   6806 "桃園市第六選區"   0401 "新竹縣第一選區"   0402 "新竹縣第二選區"   0501 "苗栗縣第一選區"   
0502 "苗栗縣第二選區"   0701 "彰化縣第一選區"   0702 "彰化縣第二選區"   0703 "彰化縣第三選區"   0704 "彰化縣第四選區"   
0801 "南投縣第一選區"   0802 "南投縣第二選區"   0901 "雲林縣第一選區"   0902 "雲林縣第二選區"   1001 "嘉義縣第一選區"   
1002 "嘉義縣第二選區"   1301 "屏東縣第一選區"   1302 "屏東縣第二選區"   1401 "台東縣單一選區"   1501 "花蓮縣單一選區"
1601 "澎湖縣單一選區"   1701 "基隆市單一選區"   1801 "新竹市單一選區"   2001 "嘉義市單一選區"   6301 "台北市第一選區"
6302 "台北市第二選區"   6303 "台北市第三選區"   6304 "台北市第四選區"   6305 "台北市第五選區"   6306 "台北市第六選區"
6307 "台北市第七選區"   6308 "台北市第八選區"   6401 "高雄市第一選區"   6402 "高雄市第二選區"   6403 "高雄市第三選區"
6404 "高雄市第四選區"   6405 "高雄市第五選區"   6406 "高雄市第六選區"   6407 "高雄市第七選區"   6408 "高雄市第八選區"
6501 "新北市第一選區"   6502 "新北市第二選區"   6503 "新北市第三選區"   6504 "新北市第四選區"   6505 "新北市第五選區"   
6506 "新北市第六選區"   6507 "新北市第七選區"   6508 "新北市第八選區"   6509 "新北市第九選區"   6510 "新北市第十選區"   
6511 "新北市第十一選區" 6512 "新北市第十二選區" 6601 "台中市第一選區"   6602 "台中市第二選區"   6603 "台中市第三選區"   
6604 "台中市第四選區"   6605 "台中市第五選區"   6606 "台中市第六選區"   6607 "台中市第七選區"   6608 "台中市第八選區"   
6701 "台南市第一選區"   6702 "台南市第二選區"   6703 "台南市第三選區"   6704 "台南市第四選區"   6705 "台南市第五選區"   
6706 "台南市第六選區"   2801 "金門縣單一選區"   2901 "連江縣單一選區"   6901 "平地原住民選區"   7001 "山地原住民選區"   .  

fre e_dist.
DELETE VARIABLES dq35 dq36 dq25 dq26 dq27 dq28 dq29 dq30 dq31 dq32 dq33 dq34.


compute Cand_elected=0.
*宜蘭縣.
if (q53=01)cand_elected=020101.
if (q53=02)cand_elected=020102.
if (q53=17)cand_elected=020117.
if (q53=41)cand_elected=020141.
if (q53=75)cand_elected=020175.
if (q53=84)cand_elected=020184.
if (q53=88 and q199=01)cand_elected=690101.
if (q53=88 and q199=02)cand_elected=690102.
if (q53=88 and q199=03)cand_elected=690103.
if (q53=88 and q199=04)cand_elected=690104.
if (q53=88 and q199=07)cand_elected=690107.
if (q53=88 and q199=09)cand_elected=690109.
if (q53=88 and q199=10)cand_elected=690110.
if (q53=88 and q199=11)cand_elected=690111.
if (q53=88 and q199=12)cand_elected=690112.
if (q53=89 and q201=01)cand_elected=700101.
if (q53=89 and q201=02)cand_elected=700102.
if (q53=89 and q201=03)cand_elected=700103.
if (q53=89 and q201=06)cand_elected=700106.
if (q53=89 and q201=08)cand_elected=700108.
if (q53=89 and q201=09)cand_elected=700109.
if (q53=89 and q201=10)cand_elected=700110.
if (q53=89 and q201=11)cand_elected=700111.
if (q53=89 and q201=12)cand_elected=700112.
if (q53=89 and q201=13)cand_elected=700113.
if (q53=95)cand_elected=999995.
if (q53=96)cand_elected=999996.
if (q53=98)cand_elected=999998.

*桃園市第一選區.
if (q187=01)cand_elected=680101.
if (q187=02)cand_elected=680102.
if (q187=84)cand_elected=680184.
if (q187=88 and q199=01)cand_elected=690101.
if (q187=88 and q199=02)cand_elected=690102.
if (q187=88 and q199=03)cand_elected=690103.
if (q187=88 and q199=04)cand_elected=690104.
if (q187=88 and q199=07)cand_elected=690107.
if (q187=88 and q199=09)cand_elected=690109.
if (q187=88 and q199=10)cand_elected=690110.
if (q187=88 and q199=11)cand_elected=690111.
if (q187=88 and q199=12)cand_elected=690112.
if (q187=89 and q201=01)cand_elected=700101.
if (q187=89 and q201=02)cand_elected=700102.
if (q187=89 and q201=03)cand_elected=700103.
if (q187=89 and q201=06)cand_elected=700106.
if (q187=89 and q201=08)cand_elected=700108.
if (q187=89 and q201=09)cand_elected=700109.
if (q187=89 and q201=10)cand_elected=700110.
if (q187=89 and q201=11)cand_elected=700111.
if (q187=89 and q201=12)cand_elected=700112.
if (q187=89 and q201=13)cand_elected=700113.
if (q187=95)cand_elected=999995.
if (q187=96)cand_elected=999996.
if (q187=98)cand_elected=999998.

*桃園市第二選區.
if (q189=01)cand_elected=680201.
if (q189=02)cand_elected=680202.
if (q189=25)cand_elected=680225.
if (q189=84)cand_elected=680284.
if (q189=88 and q199=01)cand_elected=690101.
if (q189=88 and q199=02)cand_elected=690102.
if (q189=88 and q199=03)cand_elected=690103.
if (q189=88 and q199=04)cand_elected=690104.
if (q189=88 and q199=07)cand_elected=690107.
if (q189=88 and q199=09)cand_elected=690109.
if (q189=88 and q199=10)cand_elected=690110.
if (q189=88 and q199=11)cand_elected=690111.
if (q189=88 and q199=12)cand_elected=690112.
if (q189=89 and q201=01)cand_elected=700101.
if (q189=89 and q201=02)cand_elected=700102.
if (q189=89 and q201=03)cand_elected=700103.
if (q189=89 and q201=06)cand_elected=700106.
if (q189=89 and q201=08)cand_elected=700108.
if (q189=89 and q201=09)cand_elected=700109.
if (q189=89 and q201=10)cand_elected=700110.
if (q189=89 and q201=11)cand_elected=700111.
if (q189=89 and q201=12)cand_elected=700112.
if (q189=89 and q201=13)cand_elected=700113.
if (q189=95)cand_elected=999995.
if (q189=96)cand_elected=999996.
if (q189=98)cand_elected=999998.

*桃園市第三選區.
if (q191=01)cand_elected=680301.
if (q191=02)cand_elected=680302.
if (q191=03)cand_elected=680303.
if (q191=75)cand_elected=680375.
if (q191=79)cand_elected=680379.
if (q191=88 and q199=01)cand_elected=690101.
if (q191=88 and q199=02)cand_elected=690102.
if (q191=88 and q199=03)cand_elected=690103.
if (q191=88 and q199=04)cand_elected=690104.
if (q191=88 and q199=07)cand_elected=690107.
if (q191=88 and q199=09)cand_elected=690109.
if (q191=88 and q199=10)cand_elected=690110.
if (q191=88 and q199=11)cand_elected=690111.
if (q191=88 and q199=12)cand_elected=690112.
if (q191=89 and q201=01)cand_elected=700101.
if (q191=89 and q201=02)cand_elected=700102.
if (q191=89 and q201=03)cand_elected=700103.
if (q191=89 and q201=06)cand_elected=700106.
if (q191=89 and q201=08)cand_elected=700108.
if (q191=89 and q201=09)cand_elected=700109.
if (q191=89 and q201=10)cand_elected=700110.
if (q191=89 and q201=11)cand_elected=700111.
if (q191=89 and q201=12)cand_elected=700112.
if (q191=89 and q201=13)cand_elected=700113.
if (q191=95)cand_elected=999995.
if (q191=96)cand_elected=999996.
if (q191=98)cand_elected=999998.

*桃園市第四選區.
if (q193=01)cand_elected=680401.
if (q193=02)cand_elected=680402.
if (q193=81)cand_elected=680481.
if (q193=84)cand_elected=680484.
if (q193=88 and q199=01)cand_elected=690101.
if (q193=88 and q199=02)cand_elected=690102.
if (q193=88 and q199=03)cand_elected=690103.
if (q193=88 and q199=04)cand_elected=690104.
if (q193=88 and q199=07)cand_elected=690107.
if (q193=88 and q199=09)cand_elected=690109.
if (q193=88 and q199=10)cand_elected=690110.
if (q193=88 and q199=11)cand_elected=690111.
if (q193=88 and q199=12)cand_elected=690112.
if (q193=89 and q201=01)cand_elected=700101.
if (q193=89 and q201=02)cand_elected=700102.
if (q193=89 and q201=03)cand_elected=700103.
if (q193=89 and q201=06)cand_elected=700106.
if (q193=89 and q201=08)cand_elected=700108.
if (q193=89 and q201=09)cand_elected=700109.
if (q193=89 and q201=10)cand_elected=700110.
if (q193=89 and q201=11)cand_elected=700111.
if (q193=89 and q201=12)cand_elected=700112.
if (q193=89 and q201=13)cand_elected=700113.
if (q193=95)cand_elected=999995.
if (q193=96)cand_elected=999996.
if (q193=98)cand_elected=999998.
       
*桃園市第五選區.
if (q195=01)cand_elected=680501.
if (q195=02)cand_elected=680502.
if (q195=41)cand_elected=680541.
if (q195=77)cand_elected=680577.
if (q195=88 and q199=01)cand_elected=690101.
if (q195=88 and q199=02)cand_elected=690102.
if (q195=88 and q199=03)cand_elected=690103.
if (q195=88 and q199=04)cand_elected=690104.
if (q195=88 and q199=07)cand_elected=690107.
if (q195=88 and q199=09)cand_elected=690109.
if (q195=88 and q199=10)cand_elected=690110.
if (q195=88 and q199=11)cand_elected=690111.
if (q195=88 and q199=12)cand_elected=690112.
if (q195=89 and q201=01)cand_elected=700101.
if (q195=89 and q201=02)cand_elected=700102.
if (q195=89 and q201=03)cand_elected=700103.
if (q195=89 and q201=06)cand_elected=700106.
if (q195=89 and q201=08)cand_elected=700108.
if (q195=89 and q201=09)cand_elected=700109.
if (q195=89 and q201=10)cand_elected=700110.
if (q195=89 and q201=11)cand_elected=700111.
if (q195=89 and q201=12)cand_elected=700112.
if (q195=89 and q201=13)cand_elected=700113.
if (q195=95)cand_elected=999995.
if (q195=96)cand_elected=999996.
if (q195=98)cand_elected=999998.


*桃園市第六選區.
if (q197=01)cand_elected=680601.
if (q197=41)cand_elected=680641.
if (q197=73)cand_elected=680673.
if (q197=80)cand_elected=680680.
if (q197=84)cand_elected=680684.
if (q197=85)cand_elected=680685.
if (q197=88 and q199=01)cand_elected=690101.
if (q197=88 and q199=02)cand_elected=690102.
if (q197=88 and q199=03)cand_elected=690103.
if (q197=88 and q199=04)cand_elected=690104.
if (q197=88 and q199=07)cand_elected=690107.
if (q197=88 and q199=09)cand_elected=690109.
if (q197=88 and q199=10)cand_elected=690110.
if (q197=88 and q199=11)cand_elected=690111.
if (q197=88 and q199=12)cand_elected=690112.
if (q197=89 and q201=01)cand_elected=700101.
if (q197=89 and q201=02)cand_elected=700102.
if (q197=89 and q201=03)cand_elected=700103.
if (q197=89 and q201=06)cand_elected=700106.
if (q197=89 and q201=08)cand_elected=700108.
if (q197=89 and q201=09)cand_elected=700109.
if (q197=89 and q201=10)cand_elected=700110.
if (q197=89 and q201=11)cand_elected=700111.
if (q197=89 and q201=12)cand_elected=700112.
if (q197=89 and q201=13)cand_elected=700113.
if (q197=95)cand_elected=999995.
if (q197=96)cand_elected=999996.
if (q197=98)cand_elected=999998.

*新竹縣第一選區.   
if (q55=01)cand_elected=040101.
if (q55=02)cand_elected=040102.
if (q55=09)cand_elected=040109.
if (q55=42)cand_elected=040142.
if (q55=79)cand_elected=040179.
if (q55=88 and q199=01)cand_elected=690101.
if (q55=88 and q199=02)cand_elected=690102.
if (q55=88 and q199=03)cand_elected=690103.
if (q55=88 and q199=04)cand_elected=690104.
if (q55=88 and q199=07)cand_elected=690107.
if (q55=88 and q199=09)cand_elected=690109.
if (q55=88 and q199=10)cand_elected=690110.
if (q55=88 and q199=11)cand_elected=690111.
if (q55=88 and q199=12)cand_elected=690112.
if (q55=89 and q201=01)cand_elected=700101.
if (q55=89 and q201=02)cand_elected=700102.
if (q55=89 and q201=03)cand_elected=700103.
if (q55=89 and q201=06)cand_elected=700106.
if (q55=89 and q201=08)cand_elected=700108.
if (q55=89 and q201=09)cand_elected=700109.
if (q55=89 and q201=10)cand_elected=700110.
if (q55=89 and q201=11)cand_elected=700111.
if (q55=89 and q201=12)cand_elected=700112.
if (q55=89 and q201=13)cand_elected=700113.
if (q55=95)cand_elected=999995.
if (q55=96)cand_elected=999996.
if (q55=98)cand_elected=999998.


*新竹縣第二選區. 
if (q57=01)cand_elected=040201.
if (q57=02)cand_elected=040202.
if (q57=19)cand_elected=040219.
if (q57=88 and q199=01)cand_elected=690101.
if (q57=88 and q199=02)cand_elected=690102.
if (q57=88 and q199=03)cand_elected=690103.
if (q57=88 and q199=04)cand_elected=690104.
if (q57=88 and q199=07)cand_elected=690107.
if (q57=88 and q199=09)cand_elected=690109.
if (q57=88 and q199=10)cand_elected=690110.
if (q57=88 and q199=11)cand_elected=690111.
if (q57=88 and q199=12)cand_elected=690112.
if (q57=89 and q201=01)cand_elected=700101.
if (q57=89 and q201=02)cand_elected=700102.
if (q57=89 and q201=03)cand_elected=700103.
if (q57=89 and q201=06)cand_elected=700106.
if (q57=89 and q201=08)cand_elected=700108.
if (q57=89 and q201=09)cand_elected=700109.
if (q57=89 and q201=10)cand_elected=700110.
if (q57=89 and q201=11)cand_elected=700111.
if (q57=89 and q201=12)cand_elected=700112.
if (q57=89 and q201=13)cand_elected=700113.
if (q57=95)cand_elected=999995.
if (q57=96)cand_elected=999996.
if (q57=98)cand_elected=999998.


*苗栗縣第一選區.   
if (q59=02)cand_elected=050102.
if (q59=84)cand_elected=050184.
if (q59=88 and q199=01)cand_elected=690101.
if (q59=88 and q199=02)cand_elected=690102.
if (q59=88 and q199=03)cand_elected=690103.
if (q59=88 and q199=04)cand_elected=690104.
if (q59=88 and q199=07)cand_elected=690107.
if (q59=88 and q199=09)cand_elected=690109.
if (q59=88 and q199=10)cand_elected=690110.
if (q59=88 and q199=11)cand_elected=690111.
if (q59=88 and q199=12)cand_elected=690112.
if (q59=89 and q201=01)cand_elected=700101.
if (q59=89 and q201=02)cand_elected=700102.
if (q59=89 and q201=03)cand_elected=700103.
if (q59=89 and q201=06)cand_elected=700106.
if (q59=89 and q201=08)cand_elected=700108.
if (q59=89 and q201=09)cand_elected=700109.
if (q59=89 and q201=10)cand_elected=700110.
if (q59=89 and q201=11)cand_elected=700111.
if (q59=89 and q201=12)cand_elected=700112.
if (q59=89 and q201=13)cand_elected=700113.
if (q59=95)cand_elected=999995.
if (q59=96)cand_elected=999996.
if (q59=98)cand_elected=999998.

*苗栗縣第二選區.
if (q61=01)cand_elected=050201.
if (q61=84)cand_elected=050284.
if (q61=88 and q199=01)cand_elected=690101.
if (q61=88 and q199=02)cand_elected=690102.
if (q61=88 and q199=03)cand_elected=690103.
if (q61=88 and q199=04)cand_elected=690104.
if (q61=88 and q199=07)cand_elected=690107.
if (q61=88 and q199=09)cand_elected=690109.
if (q61=88 and q199=10)cand_elected=690110.
if (q61=88 and q199=11)cand_elected=690111.
if (q61=88 and q199=12)cand_elected=690112.
if (q61=89 and q201=01)cand_elected=700101.
if (q61=89 and q201=02)cand_elected=700102.
if (q61=89 and q201=03)cand_elected=700103.
if (q61=89 and q201=06)cand_elected=700106.
if (q61=89 and q201=08)cand_elected=700108.
if (q61=89 and q201=09)cand_elected=700109.
if (q61=89 and q201=10)cand_elected=700110.
if (q61=89 and q201=11)cand_elected=700111.
if (q61=89 and q201=12)cand_elected=700112.
if (q61=89 and q201=13)cand_elected=700113.
if (q61=95)cand_elected=999995.
if (q61=96)cand_elected=999996.
if (q61=98)cand_elected=999998.

*彰化縣第一選區.   
if (q63=01)cand_elected=070101.
if (q63=02)cand_elected=070102.
if (q63=84)cand_elected=070184.
if (q63=88 and q199=01)cand_elected=690101.
if (q63=88 and q199=02)cand_elected=690102.
if (q63=88 and q199=03)cand_elected=690103.
if (q63=88 and q199=04)cand_elected=690104.
if (q63=88 and q199=07)cand_elected=690107.
if (q63=88 and q199=09)cand_elected=690109.
if (q63=88 and q199=10)cand_elected=690110.
if (q63=88 and q199=11)cand_elected=690111.
if (q63=88 and q199=12)cand_elected=690112.
if (q63=89 and q201=01)cand_elected=700101.
if (q63=89 and q201=02)cand_elected=700102.
if (q63=89 and q201=03)cand_elected=700103.
if (q63=89 and q201=06)cand_elected=700106.
if (q63=89 and q201=08)cand_elected=700108.
if (q63=89 and q201=09)cand_elected=700109.
if (q63=89 and q201=10)cand_elected=700110.
if (q63=89 and q201=11)cand_elected=700111.
if (q63=89 and q201=12)cand_elected=700112.
if (q63=89 and q201=13)cand_elected=700113.
if (q63=95)cand_elected=999995.
if (q63=96)cand_elected=999996.
if (q63=98)cand_elected=999998.

*彰化縣第二選區.
if (q65=01)cand_elected=070201.
if (q65=02)cand_elected=070202.
if (q65=88 and q199=01)cand_elected=690101.
if (q65=88 and q199=02)cand_elected=690102.
if (q65=88 and q199=03)cand_elected=690103.
if (q65=88 and q199=04)cand_elected=690104.
if (q65=88 and q199=07)cand_elected=690107.
if (q65=88 and q199=09)cand_elected=690109.
if (q65=88 and q199=10)cand_elected=690110.
if (q65=88 and q199=11)cand_elected=690111.
if (q65=88 and q199=12)cand_elected=690112.
if (q65=89 and q201=01)cand_elected=700101.
if (q65=89 and q201=02)cand_elected=700102.
if (q65=89 and q201=03)cand_elected=700103.
if (q65=89 and q201=06)cand_elected=700106.
if (q65=89 and q201=08)cand_elected=700108.
if (q65=89 and q201=09)cand_elected=700109.
if (q65=89 and q201=10)cand_elected=700110.
if (q65=89 and q201=11)cand_elected=700111.
if (q65=89 and q201=12)cand_elected=700112.
if (q65=89 and q201=13)cand_elected=700113.
if (q65=95)cand_elected=999995.
if (q65=96)cand_elected=999996.
if (q65=98)cand_elected=999998.

*彰化縣第三選區.   
if (q67=01)cand_elected=070301.
if (q67=02)cand_elected=070302.
if (q67=25)cand_elected=070325.
if (q67=84)cand_elected=070384.
if (q67=88 and q199=01)cand_elected=690101.
if (q67=88 and q199=02)cand_elected=690102.
if (q67=88 and q199=03)cand_elected=690103.
if (q67=88 and q199=04)cand_elected=690104.
if (q67=88 and q199=07)cand_elected=690107.
if (q67=88 and q199=09)cand_elected=690109.
if (q67=88 and q199=10)cand_elected=690110.
if (q67=88 and q199=11)cand_elected=690111.
if (q67=88 and q199=12)cand_elected=690112.
if (q67=89 and q201=01)cand_elected=700101.
if (q67=89 and q201=02)cand_elected=700102.
if (q67=89 and q201=03)cand_elected=700103.
if (q67=89 and q201=06)cand_elected=700106.
if (q67=89 and q201=08)cand_elected=700108.
if (q67=89 and q201=09)cand_elected=700109.
if (q67=89 and q201=10)cand_elected=700110.
if (q67=89 and q201=11)cand_elected=700111.
if (q67=89 and q201=12)cand_elected=700112.
if (q67=89 and q201=13)cand_elected=700113.
if (q67=95)cand_elected=999995.
if (q67=96)cand_elected=999996.
if (q67=98)cand_elected=999998.

*彰化縣第四選區.
if (q69=01)cand_elected=070401.
if (q69=02)cand_elected=070402.
if (q69=71)cand_elected=070471.
if (q69=82)cand_elected=070482.
if (q69=88 and q199=01)cand_elected=690101.
if (q69=88 and q199=02)cand_elected=690102.
if (q69=88 and q199=03)cand_elected=690103.
if (q69=88 and q199=04)cand_elected=690104.
if (q69=88 and q199=07)cand_elected=690107.
if (q69=88 and q199=09)cand_elected=690109.
if (q69=88 and q199=10)cand_elected=690110.
if (q69=88 and q199=11)cand_elected=690111.
if (q69=88 and q199=12)cand_elected=690112.
if (q69=89 and q201=01)cand_elected=700101.
if (q69=89 and q201=02)cand_elected=700102.
if (q69=89 and q201=03)cand_elected=700103.
if (q69=89 and q201=06)cand_elected=700106.
if (q69=89 and q201=08)cand_elected=700108.
if (q69=89 and q201=09)cand_elected=700109.
if (q69=89 and q201=10)cand_elected=700110.
if (q69=89 and q201=11)cand_elected=700111.
if (q69=89 and q201=12)cand_elected=700112.
if (q69=89 and q201=13)cand_elected=700113.
if (q69=95)cand_elected=999995.
if (q69=96)cand_elected=999996.
if (q69=98)cand_elected=999998.

*南投縣第一選區.   
if (q71=01)cand_elected=080101.
if (q71=02)cand_elected=080102.
if (q71=13)cand_elected=080113.
if (q71=79)cand_elected=080179.
if (q71=84)cand_elected=080184.
if (q71=88 and q199=01)cand_elected=690101.
if (q71=88 and q199=02)cand_elected=690102.
if (q71=88 and q199=03)cand_elected=690103.
if (q71=88 and q199=04)cand_elected=690104.
if (q71=88 and q199=07)cand_elected=690107.
if (q71=88 and q199=09)cand_elected=690109.
if (q71=88 and q199=10)cand_elected=690110.
if (q71=88 and q199=11)cand_elected=690111.
if (q71=88 and q199=12)cand_elected=690112.
if (q71=89 and q201=01)cand_elected=700101.
if (q71=89 and q201=02)cand_elected=700102.
if (q71=89 and q201=03)cand_elected=700103.
if (q71=89 and q201=06)cand_elected=700106.
if (q71=89 and q201=08)cand_elected=700108.
if (q71=89 and q201=09)cand_elected=700109.
if (q71=89 and q201=10)cand_elected=700110.
if (q71=89 and q201=11)cand_elected=700111.
if (q71=89 and q201=12)cand_elected=700112.
if (q71=89 and q201=13)cand_elected=700113.
if (q71=95)cand_elected=999995.
if (q71=96)cand_elected=999996.
if (q71=98)cand_elected=999998.

*南投縣第二選區.
if (q73=01)cand_elected=080201.
if (q73=02)cand_elected=080202.
if (q73=84)cand_elected=080284.
if (q73=88 and q199=01)cand_elected=690101.
if (q73=88 and q199=02)cand_elected=690102.
if (q73=88 and q199=03)cand_elected=690103.
if (q73=88 and q199=04)cand_elected=690104.
if (q73=88 and q199=07)cand_elected=690107.
if (q73=88 and q199=09)cand_elected=690109.
if (q73=88 and q199=10)cand_elected=690110.
if (q73=88 and q199=11)cand_elected=690111.
if (q73=88 and q199=12)cand_elected=690112.
if (q73=89 and q201=01)cand_elected=700101.
if (q73=89 and q201=02)cand_elected=700102.
if (q73=89 and q201=03)cand_elected=700103.
if (q73=89 and q201=06)cand_elected=700106.
if (q73=89 and q201=08)cand_elected=700108.
if (q73=89 and q201=09)cand_elected=700109.
if (q73=89 and q201=10)cand_elected=700110.
if (q73=89 and q201=11)cand_elected=700111.
if (q73=89 and q201=12)cand_elected=700112.
if (q73=89 and q201=13)cand_elected=700113.
if (q73=95)cand_elected=999995.
if (q73=96)cand_elected=999996.
if (q73=98)cand_elected=999998.

*雲林縣第一選區.   
if (q75=01)cand_elected=090101.
if (q75=02)cand_elected=090102.
if (q75=25)cand_elected=090125.
if (q75=70)cand_elected=090170.
if (q75=84)cand_elected=090184.
if (q75=85)cand_elected=090185.
if (q75=88 and q199=01)cand_elected=690101.
if (q75=88 and q199=02)cand_elected=690102.
if (q75=88 and q199=03)cand_elected=690103.
if (q75=88 and q199=04)cand_elected=690104.
if (q75=88 and q199=07)cand_elected=690107.
if (q75=88 and q199=09)cand_elected=690109.
if (q75=88 and q199=10)cand_elected=690110.
if (q75=88 and q199=11)cand_elected=690111.
if (q75=88 and q199=12)cand_elected=690112.
if (q75=89 and q201=01)cand_elected=700101.
if (q75=89 and q201=02)cand_elected=700102.
if (q75=89 and q201=03)cand_elected=700103.
if (q75=89 and q201=06)cand_elected=700106.
if (q75=89 and q201=08)cand_elected=700108.
if (q75=89 and q201=09)cand_elected=700109.
if (q75=89 and q201=10)cand_elected=700110.
if (q75=89 and q201=11)cand_elected=700111.
if (q75=89 and q201=12)cand_elected=700112.
if (q75=89 and q201=13)cand_elected=700113.
if (q75=95)cand_elected=999995.
if (q75=96)cand_elected=999996.
if (q75=98)cand_elected=999998.

*雲林縣第二選區.
if (q77=01)cand_elected=090201.
if (q77=02)cand_elected=090202.
if (q77=88 and q199=01)cand_elected=690101.
if (q77=88 and q199=02)cand_elected=690102.
if (q77=88 and q199=03)cand_elected=690103.
if (q77=88 and q199=04)cand_elected=690104.
if (q77=88 and q199=07)cand_elected=690107.
if (q77=88 and q199=09)cand_elected=690109.
if (q77=88 and q199=10)cand_elected=690110.
if (q77=88 and q199=11)cand_elected=690111.
if (q77=88 and q199=12)cand_elected=690112.
if (q77=89 and q201=01)cand_elected=700101.
if (q77=89 and q201=02)cand_elected=700102.
if (q77=89 and q201=03)cand_elected=700103.
if (q77=89 and q201=06)cand_elected=700106.
if (q77=89 and q201=08)cand_elected=700108.
if (q77=89 and q201=09)cand_elected=700109.
if (q77=89 and q201=10)cand_elected=700110.
if (q77=89 and q201=11)cand_elected=700111.
if (q77=89 and q201=12)cand_elected=700112.
if (q77=89 and q201=13)cand_elected=700113.
if (q77=95)cand_elected=999995.
if (q77=96)cand_elected=999996.
if (q77=98)cand_elected=999998.

*嘉義縣第一選區.   
if (q79=01)cand_elected=100101.
if (q79=02)cand_elected=100102.
if (q79=88 and q199=01)cand_elected=690101.
if (q79=88 and q199=02)cand_elected=690102.
if (q79=88 and q199=03)cand_elected=690103.
if (q79=88 and q199=04)cand_elected=690104.
if (q79=88 and q199=07)cand_elected=690107.
if (q79=88 and q199=09)cand_elected=690109.
if (q79=88 and q199=10)cand_elected=690110.
if (q79=88 and q199=11)cand_elected=690111.
if (q79=88 and q199=12)cand_elected=690112.
if (q79=89 and q201=01)cand_elected=700101.
if (q79=89 and q201=02)cand_elected=700102.
if (q79=89 and q201=03)cand_elected=700103.
if (q79=89 and q201=06)cand_elected=700106.
if (q79=89 and q201=08)cand_elected=700108.
if (q79=89 and q201=09)cand_elected=700109.
if (q79=89 and q201=10)cand_elected=700110.
if (q79=89 and q201=11)cand_elected=700111.
if (q79=89 and q201=12)cand_elected=700112.
if (q79=89 and q201=13)cand_elected=700113.
if (q79=95)cand_elected=999995.
if (q79=96)cand_elected=999996.
if (q79=98)cand_elected=999998.

*嘉義縣第二選區.
if (q81=02)cand_elected=100202.
if (q81=42)cand_elected=100242.
if (q81=75)cand_elected=100275.
if (q81=84)cand_elected=100284.
if (q81=85)cand_elected=100285.
if (q81=88 and q199=01)cand_elected=690101.
if (q81=88 and q199=02)cand_elected=690102.
if (q81=88 and q199=03)cand_elected=690103.
if (q81=88 and q199=04)cand_elected=690104.
if (q81=88 and q199=07)cand_elected=690107.
if (q81=88 and q199=09)cand_elected=690109.
if (q81=88 and q199=10)cand_elected=690110.
if (q81=88 and q199=11)cand_elected=690111.
if (q81=88 and q199=12)cand_elected=690112.
if (q81=89 and q201=01)cand_elected=700101.
if (q81=89 and q201=02)cand_elected=700102.
if (q81=89 and q201=03)cand_elected=700103.
if (q81=89 and q201=06)cand_elected=700106.
if (q81=89 and q201=08)cand_elected=700108.
if (q81=89 and q201=09)cand_elected=700109.
if (q81=89 and q201=10)cand_elected=700110.
if (q81=89 and q201=11)cand_elected=700111.
if (q81=89 and q201=12)cand_elected=700112.
if (q81=89 and q201=13)cand_elected=700113.
if (q81=95)cand_elected=999995.
if (q81=96)cand_elected=999996.
if (q81=98)cand_elected=999998.

*屏東縣第一選區.   
if (q83=01)cand_elected=130101.
if (q83=02)cand_elected=130102.
if (q83=25)cand_elected=130125.
if (q83=42)cand_elected=130142.
if (q83=84)cand_elected=130184.
if (q83=85)cand_elected=130185.
if (q83=88 and q199=01)cand_elected=690101.
if (q83=88 and q199=02)cand_elected=690102.
if (q83=88 and q199=03)cand_elected=690103.
if (q83=88 and q199=04)cand_elected=690104.
if (q83=88 and q199=07)cand_elected=690107.
if (q83=88 and q199=09)cand_elected=690109.
if (q83=88 and q199=10)cand_elected=690110.
if (q83=88 and q199=11)cand_elected=690111.
if (q83=88 and q199=12)cand_elected=690112.
if (q83=89 and q201=01)cand_elected=700101.
if (q83=89 and q201=02)cand_elected=700102.
if (q83=89 and q201=03)cand_elected=700103.
if (q83=89 and q201=06)cand_elected=700106.
if (q83=89 and q201=08)cand_elected=700108.
if (q83=89 and q201=09)cand_elected=700109.
if (q83=89 and q201=10)cand_elected=700110.
if (q83=89 and q201=11)cand_elected=700111.
if (q83=89 and q201=12)cand_elected=700112.
if (q83=89 and q201=13)cand_elected=700113.
if (q83=95)cand_elected=999995.
if (q83=96)cand_elected=999996.
if (q83=98)cand_elected=999998.

*屏東縣第二選區.
if (q85=02)cand_elected=130202.
if (q85=56)cand_elected=130256.
if (q85=73)cand_elected=130273.
if (q85=84)cand_elected=130284.
if (q85=88 and q199=01)cand_elected=690101.
if (q85=88 and q199=02)cand_elected=690102.
if (q85=88 and q199=03)cand_elected=690103.
if (q85=88 and q199=04)cand_elected=690104.
if (q85=88 and q199=07)cand_elected=690107.
if (q85=88 and q199=09)cand_elected=690109.
if (q85=88 and q199=10)cand_elected=690110.
if (q85=88 and q199=11)cand_elected=690111.
if (q85=88 and q199=12)cand_elected=690112.
if (q85=89 and q201=01)cand_elected=700101.
if (q85=89 and q201=02)cand_elected=700102.
if (q85=89 and q201=03)cand_elected=700103.
if (q85=89 and q201=06)cand_elected=700106.
if (q85=89 and q201=08)cand_elected=700108.
if (q85=89 and q201=09)cand_elected=700109.
if (q85=89 and q201=10)cand_elected=700110.
if (q85=89 and q201=11)cand_elected=700111.
if (q85=89 and q201=12)cand_elected=700112.
if (q85=89 and q201=13)cand_elected=700113.
if (q85=95)cand_elected=999995.
if (q85=96)cand_elected=999996.
if (q85=98)cand_elected=999998.

*台東縣.   
if (q87=01)cand_elected=140101.
if (q87=02)cand_elected=140102.
if (q87=79)cand_elected=140179.
if (q87=84)cand_elected=140184.
if (q87=85)cand_elected=140185.
if (q87=86)cand_elected=140186.
if (q87=88 and q199=01)cand_elected=690101.
if (q87=88 and q199=02)cand_elected=690102.
if (q87=88 and q199=03)cand_elected=690103.
if (q87=88 and q199=04)cand_elected=690104.
if (q87=88 and q199=07)cand_elected=690107.
if (q87=88 and q199=09)cand_elected=690109.
if (q87=88 and q199=10)cand_elected=690110.
if (q87=88 and q199=11)cand_elected=690111.
if (q87=88 and q199=12)cand_elected=690112.
if (q87=89 and q201=01)cand_elected=700101.
if (q87=89 and q201=02)cand_elected=700102.
if (q87=89 and q201=03)cand_elected=700103.
if (q87=89 and q201=06)cand_elected=700106.
if (q87=89 and q201=08)cand_elected=700108.
if (q87=89 and q201=09)cand_elected=700109.
if (q87=89 and q201=10)cand_elected=700110.
if (q87=89 and q201=11)cand_elected=700111.
if (q87=89 and q201=12)cand_elected=700112.
if (q87=89 and q201=13)cand_elected=700113.
if (q87=95)cand_elected=999995.
if (q87=96)cand_elected=999996.
if (q87=98)cand_elected=999998.


*花蓮縣.   
if (q89=01)cand_elected=150101.
if (q89=02)cand_elected=150102.
if (q89=75)cand_elected=150175.
if (q89=84)cand_elected=150184.
if (q89=88 and q199=01)cand_elected=690101.
if (q89=88 and q199=02)cand_elected=690102.
if (q89=88 and q199=03)cand_elected=690103.
if (q89=88 and q199=04)cand_elected=690104.
if (q89=88 and q199=07)cand_elected=690107.
if (q89=88 and q199=09)cand_elected=690109.
if (q89=88 and q199=10)cand_elected=690110.
if (q89=88 and q199=11)cand_elected=690111.
if (q89=88 and q199=12)cand_elected=690112.
if (q89=89 and q201=01)cand_elected=700101.
if (q89=89 and q201=02)cand_elected=700102.
if (q89=89 and q201=03)cand_elected=700103.
if (q89=89 and q201=06)cand_elected=700106.
if (q89=89 and q201=08)cand_elected=700108.
if (q89=89 and q201=09)cand_elected=700109.
if (q89=89 and q201=10)cand_elected=700110.
if (q89=89 and q201=11)cand_elected=700111.
if (q89=89 and q201=12)cand_elected=700112.
if (q89=89 and q201=13)cand_elected=700113.
if (q89=95)cand_elected=999995.
if (q89=96)cand_elected=999996.
if (q89=98)cand_elected=999998.

*澎湖縣.   
if (q91=01)cand_elected=160101.
if (q91=02)cand_elected=160102.
if (q91=84)cand_elected=160184.
if (q91=88 and q199=01)cand_elected=690101.
if (q91=88 and q199=02)cand_elected=690102.
if (q91=88 and q199=03)cand_elected=690103.
if (q91=88 and q199=04)cand_elected=690104.
if (q91=88 and q199=07)cand_elected=690107.
if (q91=88 and q199=09)cand_elected=690109.
if (q91=88 and q199=10)cand_elected=690110.
if (q91=88 and q199=11)cand_elected=690111.
if (q91=88 and q199=12)cand_elected=690112.
if (q91=89 and q201=01)cand_elected=700101.
if (q91=89 and q201=02)cand_elected=700102.
if (q91=89 and q201=03)cand_elected=700103.
if (q91=89 and q201=06)cand_elected=700106.
if (q91=89 and q201=08)cand_elected=700108.
if (q91=89 and q201=09)cand_elected=700109.
if (q91=89 and q201=10)cand_elected=700110.
if (q91=89 and q201=11)cand_elected=700111.
if (q91=89 and q201=12)cand_elected=700112.
if (q91=89 and q201=13)cand_elected=700113.
if (q91=95)cand_elected=999995.
if (q91=96)cand_elected=999996.
if (q91=98)cand_elected=999998.


*基隆市.   
if (q93=01)cand_elected=170101.
if (q93=02)cand_elected=170102.
if (q93=79)cand_elected=170179.
if (q93=81)cand_elected=170181.
if (q93=83)cand_elected=170183.
if (q93=85)cand_elected=170185.
if (q93=88 and q199=01)cand_elected=690101.
if (q93=88 and q199=02)cand_elected=690102.
if (q93=88 and q199=03)cand_elected=690103.
if (q93=88 and q199=04)cand_elected=690104.
if (q93=88 and q199=07)cand_elected=690107.
if (q93=88 and q199=09)cand_elected=690109.
if (q93=88 and q199=10)cand_elected=690110.
if (q93=88 and q199=11)cand_elected=690111.
if (q93=88 and q199=12)cand_elected=690112.
if (q93=89 and q201=01)cand_elected=700101.
if (q93=89 and q201=02)cand_elected=700102.
if (q93=89 and q201=03)cand_elected=700103.
if (q93=89 and q201=06)cand_elected=700106.
if (q93=89 and q201=08)cand_elected=700108.
if (q93=89 and q201=09)cand_elected=700109.
if (q93=89 and q201=10)cand_elected=700110.
if (q93=89 and q201=11)cand_elected=700111.
if (q93=89 and q201=12)cand_elected=700112.
if (q93=89 and q201=13)cand_elected=700113.
if (q93=95)cand_elected=999995.
if (q93=96)cand_elected=999996.
if (q93=98)cand_elected=999998.

*新竹市.   
if (q95=01)cand_elected=180101.
if (q95=02)cand_elected=180102.
if (q95=19)cand_elected=180119.
if (q95=75)cand_elected=180175.
if (q95=77)cand_elected=180177.
if (q95=84)cand_elected=180184.
if (q95=85)cand_elected=180185.
if (q95=88 and q199=01)cand_elected=690101.
if (q95=88 and q199=02)cand_elected=690102.
if (q95=88 and q199=03)cand_elected=690103.
if (q95=88 and q199=04)cand_elected=690104.
if (q95=88 and q199=07)cand_elected=690107.
if (q95=88 and q199=09)cand_elected=690109.
if (q95=88 and q199=10)cand_elected=690110.
if (q95=88 and q199=11)cand_elected=690111.
if (q95=88 and q199=12)cand_elected=690112.
if (q95=89 and q201=01)cand_elected=700101.
if (q95=89 and q201=02)cand_elected=700102.
if (q95=89 and q201=03)cand_elected=700103.
if (q95=89 and q201=06)cand_elected=700106.
if (q95=89 and q201=08)cand_elected=700108.
if (q95=89 and q201=09)cand_elected=700109.
if (q95=89 and q201=10)cand_elected=700110.
if (q95=89 and q201=11)cand_elected=700111.
if (q95=89 and q201=12)cand_elected=700112.
if (q95=89 and q201=13)cand_elected=700113.
if (q95=95)cand_elected=999995.
if (q95=96)cand_elected=999996.
if (q95=98)cand_elected=999998.

*嘉義市.   
if (q97=01)cand_elected=200101.
if (q97=02)cand_elected=200102.
if (q97=71)cand_elected=200171.
if (q97=79)cand_elected=200179.
if (q97=80)cand_elected=200180.
if (q97=84)cand_elected=200184.
if (q97=88 and q199=01)cand_elected=690101.
if (q97=88 and q199=02)cand_elected=690102.
if (q97=88 and q199=03)cand_elected=690103.
if (q97=88 and q199=04)cand_elected=690104.
if (q97=88 and q199=07)cand_elected=690107.
if (q97=88 and q199=09)cand_elected=690109.
if (q97=88 and q199=10)cand_elected=690110.
if (q97=88 and q199=11)cand_elected=690111.
if (q97=88 and q199=12)cand_elected=690112.
if (q97=89 and q201=01)cand_elected=700101.
if (q97=89 and q201=02)cand_elected=700102.
if (q97=89 and q201=03)cand_elected=700103.
if (q97=89 and q201=06)cand_elected=700106.
if (q97=89 and q201=08)cand_elected=700108.
if (q97=89 and q201=09)cand_elected=700109.
if (q97=89 and q201=10)cand_elected=700110.
if (q97=89 and q201=11)cand_elected=700111.
if (q97=89 and q201=12)cand_elected=700112.
if (q97=89 and q201=13)cand_elected=700113.
if (q97=95)cand_elected=999995.
if (q97=96)cand_elected=999996.
if (q97=98)cand_elected=999998.

*台北市第一選區.
if (q103=01)cand_elected=630101.
if (q103=02)cand_elected=630102.
if (q103=48)cand_elected=630148.
if (q103=71)cand_elected=630171.
if (q103=73)cand_elected=630173.
if (q103=74)cand_elected=630174.
if (q103=84)cand_elected=630184.
if (q103=85)cand_elected=630185.
if (q103=88 and q199=01)cand_elected=690101.
if (q103=88 and q199=02)cand_elected=690102.
if (q103=88 and q199=03)cand_elected=690103.
if (q103=88 and q199=04)cand_elected=690104.
if (q103=88 and q199=07)cand_elected=690107.
if (q103=88 and q199=09)cand_elected=690109.
if (q103=88 and q199=10)cand_elected=690110.
if (q103=88 and q199=11)cand_elected=690111.
if (q103=88 and q199=12)cand_elected=690112.
if (q103=89 and q201=01)cand_elected=700101.
if (q103=89 and q201=02)cand_elected=700102.
if (q103=89 and q201=03)cand_elected=700103.
if (q103=89 and q201=06)cand_elected=700106.
if (q103=89 and q201=08)cand_elected=700108.
if (q103=89 and q201=09)cand_elected=700109.
if (q103=89 and q201=10)cand_elected=700110.
if (q103=89 and q201=11)cand_elected=700111.
if (q103=89 and q201=12)cand_elected=700112.
if (q103=89 and q201=13)cand_elected=700113.
if (q103=95)cand_elected=999995.
if (q103=96)cand_elected=999996.
if (q103=98)cand_elected=999998.

*台北市第二選區.
if (q105=01)cand_elected=630201.
if (q105=02)cand_elected=630202.
if (q105=25)cand_elected=630225.
if (q105=73)cand_elected=630273.
if (q105=75)cand_elected=630275.
if (q105=88 and q199=01)cand_elected=690101.
if (q105=88 and q199=02)cand_elected=690102.
if (q105=88 and q199=03)cand_elected=690103.
if (q105=88 and q199=04)cand_elected=690104.
if (q105=88 and q199=07)cand_elected=690107.
if (q105=88 and q199=09)cand_elected=690109.
if (q105=88 and q199=10)cand_elected=690110.
if (q105=88 and q199=11)cand_elected=690111.
if (q105=88 and q199=12)cand_elected=690112.
if (q105=89 and q201=01)cand_elected=700101.
if (q105=89 and q201=02)cand_elected=700102.
if (q105=89 and q201=03)cand_elected=700103.
if (q105=89 and q201=06)cand_elected=700106.
if (q105=89 and q201=08)cand_elected=700108.
if (q105=89 and q201=09)cand_elected=700109.
if (q105=89 and q201=10)cand_elected=700110.
if (q105=89 and q201=11)cand_elected=700111.
if (q105=89 and q201=12)cand_elected=700112.
if (q105=89 and q201=13)cand_elected=700113.
if (q105=95)cand_elected=999995.
if (q105=96)cand_elected=999996.
if (q105=98)cand_elected=999998.


*台北市第三選區.
if (q107=01)cand_elected=630301.
if (q107=02)cand_elected=630302.
if (q107=42)cand_elected=630342.
if (q107=71)cand_elected=630371.
if (q107=73)cand_elected=630373.
if (q107=75)cand_elected=630375.
if (q107=84)cand_elected=630384.
if (q107=88 and q199=01)cand_elected=690101.
if (q107=88 and q199=02)cand_elected=690102.
if (q107=88 and q199=03)cand_elected=690103.
if (q107=88 and q199=04)cand_elected=690104.
if (q107=88 and q199=07)cand_elected=690107.
if (q107=88 and q199=09)cand_elected=690109.
if (q107=88 and q199=10)cand_elected=690110.
if (q107=88 and q199=11)cand_elected=690111.
if (q107=88 and q199=12)cand_elected=690112.
if (q107=89 and q201=01)cand_elected=700101.
if (q107=89 and q201=02)cand_elected=700102.
if (q107=89 and q201=03)cand_elected=700103.
if (q107=89 and q201=06)cand_elected=700106.
if (q107=89 and q201=08)cand_elected=700108.
if (q107=89 and q201=09)cand_elected=700109.
if (q107=89 and q201=10)cand_elected=700110.
if (q107=89 and q201=11)cand_elected=700111.
if (q107=89 and q201=12)cand_elected=700112.
if (q107=89 and q201=13)cand_elected=700113.
if (q107=95)cand_elected=999995.
if (q107=96)cand_elected=999996.
if (q107=98)cand_elected=999998.

*台北市第四選區.
if (q109=01)cand_elected=630401.
if (q109=02)cand_elected=630402.
if (q109=17)cand_elected=630417.
if (q109=59)cand_elected=630459.
if (q109=75)cand_elected=630475.
if (q109=88 and q199=01)cand_elected=690101.
if (q109=88 and q199=02)cand_elected=690102.
if (q109=88 and q199=03)cand_elected=690103.
if (q109=88 and q199=04)cand_elected=690104.
if (q109=88 and q199=07)cand_elected=690107.
if (q109=88 and q199=09)cand_elected=690109.
if (q109=88 and q199=10)cand_elected=690110.
if (q109=88 and q199=11)cand_elected=690111.
if (q109=88 and q199=12)cand_elected=690112.
if (q109=89 and q201=01)cand_elected=700101.
if (q109=89 and q201=02)cand_elected=700102.
if (q109=89 and q201=03)cand_elected=700103.
if (q109=89 and q201=06)cand_elected=700106.
if (q109=89 and q201=08)cand_elected=700108.
if (q109=89 and q201=09)cand_elected=700109.
if (q109=89 and q201=10)cand_elected=700110.
if (q109=89 and q201=11)cand_elected=700111.
if (q109=89 and q201=12)cand_elected=700112.
if (q109=89 and q201=13)cand_elected=700113.
if (q109=95)cand_elected=999995.
if (q109=96)cand_elected=999996.
if (q109=98)cand_elected=999998.

*台北市第五選區.
if (q111=01)cand_elected=630501.
if (q111=02)cand_elected=630502.
if (q111=38)cand_elected=630538.
if (q111=76)cand_elected=630576.
if (q111=77)cand_elected=630577.
if (q111=78)cand_elected=630578.
if (q111=84)cand_elected=630584.
if (q111=85)cand_elected=630585.
if (q111=86)cand_elected=630586.
if (q111=87)cand_elected=630587.
if (q111=88 and q199=01)cand_elected=690101.
if (q111=88 and q199=02)cand_elected=690102.
if (q111=88 and q199=03)cand_elected=690103.
if (q111=88 and q199=04)cand_elected=690104.
if (q111=88 and q199=07)cand_elected=690107.
if (q111=88 and q199=09)cand_elected=690109.
if (q111=88 and q199=10)cand_elected=690110.
if (q111=88 and q199=11)cand_elected=690111.
if (q111=88 and q199=12)cand_elected=690112.
if (q111=89 and q201=01)cand_elected=700101.
if (q111=89 and q201=02)cand_elected=700102.
if (q111=89 and q201=03)cand_elected=700103.
if (q111=89 and q201=06)cand_elected=700106.
if (q111=89 and q201=08)cand_elected=700108.
if (q111=89 and q201=09)cand_elected=700109.
if (q111=89 and q201=10)cand_elected=700110.
if (q111=89 and q201=11)cand_elected=700111.
if (q111=89 and q201=12)cand_elected=700112.
if (q111=89 and q201=13)cand_elected=700113.
if (q111=95)cand_elected=999995.
if (q111=96)cand_elected=999996.
if (q111=98)cand_elected=999998.


*台北市第六選區.
if (q113=01)cand_elected=630601.
if (q113=24)cand_elected=630624.
if (q113=42)cand_elected=630642.
if (q113=71)cand_elected=630671.
if (q113=75)cand_elected=630675.
if (q113=88 and q199=01)cand_elected=690101.
if (q113=88 and q199=02)cand_elected=690102.
if (q113=88 and q199=03)cand_elected=690103.
if (q113=88 and q199=04)cand_elected=690104.
if (q113=88 and q199=07)cand_elected=690107.
if (q113=88 and q199=09)cand_elected=690109.
if (q113=88 and q199=10)cand_elected=690110.
if (q113=88 and q199=11)cand_elected=690111.
if (q113=88 and q199=12)cand_elected=690112.
if (q113=89 and q201=01)cand_elected=700101.
if (q113=89 and q201=02)cand_elected=700102.
if (q113=89 and q201=03)cand_elected=700103.
if (q113=89 and q201=06)cand_elected=700106.
if (q113=89 and q201=08)cand_elected=700108.
if (q113=89 and q201=09)cand_elected=700109.
if (q113=89 and q201=10)cand_elected=700110.
if (q113=89 and q201=11)cand_elected=700111.
if (q113=89 and q201=12)cand_elected=700112.
if (q113=89 and q201=13)cand_elected=700113.
if (q113=95)cand_elected=999995.
if (q113=96)cand_elected=999996.
if (q113=98)cand_elected=999998.

*台北市第七選區.
if (q115=01)cand_elected=630701.
if (q115=02)cand_elected=630702.
if (q115=42)cand_elected=630742.
if (q115=53)cand_elected=630753.
if (q115=84)cand_elected=630784.
if (q115=88 and q199=01)cand_elected=690101.
if (q115=88 and q199=02)cand_elected=690102.
if (q115=88 and q199=03)cand_elected=690103.
if (q115=88 and q199=04)cand_elected=690104.
if (q115=88 and q199=07)cand_elected=690107.
if (q115=88 and q199=09)cand_elected=690109.
if (q115=88 and q199=10)cand_elected=690110.
if (q115=88 and q199=11)cand_elected=690111.
if (q115=88 and q199=12)cand_elected=690112.
if (q115=89 and q201=01)cand_elected=700101.
if (q115=89 and q201=02)cand_elected=700102.
if (q115=89 and q201=03)cand_elected=700103.
if (q115=89 and q201=06)cand_elected=700106.
if (q115=89 and q201=08)cand_elected=700108.
if (q115=89 and q201=09)cand_elected=700109.
if (q115=89 and q201=10)cand_elected=700110.
if (q115=89 and q201=11)cand_elected=700111.
if (q115=89 and q201=12)cand_elected=700112.
if (q115=89 and q201=13)cand_elected=700113.
if (q115=95)cand_elected=999995.
if (q115=96)cand_elected=999996.
if (q115=98)cand_elected=999998.

*台北市第八選區.
if (q117=01)cand_elected=630801.
if (q117=02)cand_elected=630802.
if (q117=41)cand_elected=630841.
if (q117=42)cand_elected=630842.
if (q117=67)cand_elected=630867.
if (q117=79)cand_elected=630879.
if (q117=84)cand_elected=630884.
if (q117=85)cand_elected=630885.
if (q117=88 and q199=01)cand_elected=690101.
if (q117=88 and q199=02)cand_elected=690102.
if (q117=88 and q199=03)cand_elected=690103.
if (q117=88 and q199=04)cand_elected=690104.
if (q117=88 and q199=07)cand_elected=690107.
if (q117=88 and q199=09)cand_elected=690109.
if (q117=88 and q199=10)cand_elected=690110.
if (q117=88 and q199=11)cand_elected=690111.
if (q117=88 and q199=12)cand_elected=690112.
if (q117=89 and q201=01)cand_elected=700101.
if (q117=89 and q201=02)cand_elected=700102.
if (q117=89 and q201=03)cand_elected=700103.
if (q117=89 and q201=06)cand_elected=700106.
if (q117=89 and q201=08)cand_elected=700108.
if (q117=89 and q201=09)cand_elected=700109.
if (q117=89 and q201=10)cand_elected=700110.
if (q117=89 and q201=11)cand_elected=700111.
if (q117=89 and q201=12)cand_elected=700112.
if (q117=89 and q201=13)cand_elected=700113.
if (q117=95)cand_elected=999995.
if (q117=96)cand_elected=999996.
if (q117=98)cand_elected=999998.

*高雄市第一選區.
if (q119=02)cand_elected=640102.
if (q119=41)cand_elected=640141.
if (q119=73)cand_elected=640173.
if (q119=84)cand_elected=640184.
if (q119=88 and q199=01)cand_elected=690101.
if (q119=88 and q199=02)cand_elected=690102.
if (q119=88 and q199=03)cand_elected=690103.
if (q119=88 and q199=04)cand_elected=690104.
if (q119=88 and q199=07)cand_elected=690107.
if (q119=88 and q199=09)cand_elected=690109.
if (q119=88 and q199=10)cand_elected=690110.
if (q119=88 and q199=11)cand_elected=690111.
if (q119=88 and q199=12)cand_elected=690112.
if (q119=89 and q201=01)cand_elected=700101.
if (q119=89 and q201=02)cand_elected=700102.
if (q119=89 and q201=03)cand_elected=700103.
if (q119=89 and q201=06)cand_elected=700106.
if (q119=89 and q201=08)cand_elected=700108.
if (q119=89 and q201=09)cand_elected=700109.
if (q119=89 and q201=10)cand_elected=700110.
if (q119=89 and q201=11)cand_elected=700111.
if (q119=89 and q201=12)cand_elected=700112.
if (q119=89 and q201=13)cand_elected=700113.
if (q119=95)cand_elected=999995.
if (q119=96)cand_elected=999996.
if (q119=98)cand_elected=999998.


*高雄市第二選區.
if (q121=01)cand_elected=640201.
if (q121=02)cand_elected=640202.
if (q121=88 and q199=01)cand_elected=690101.
if (q121=88 and q199=02)cand_elected=690102.
if (q121=88 and q199=03)cand_elected=690103.
if (q121=88 and q199=04)cand_elected=690104.
if (q121=88 and q199=07)cand_elected=690107.
if (q121=88 and q199=09)cand_elected=690109.
if (q121=88 and q199=10)cand_elected=690110.
if (q121=88 and q199=11)cand_elected=690111.
if (q121=88 and q199=12)cand_elected=690112.
if (q121=89 and q201=01)cand_elected=700101.
if (q121=89 and q201=02)cand_elected=700102.
if (q121=89 and q201=03)cand_elected=700103.
if (q121=89 and q201=06)cand_elected=700106.
if (q121=89 and q201=08)cand_elected=700108.
if (q121=89 and q201=09)cand_elected=700109.
if (q121=89 and q201=10)cand_elected=700110.
if (q121=89 and q201=11)cand_elected=700111.
if (q121=89 and q201=12)cand_elected=700112.
if (q121=89 and q201=13)cand_elected=700113.
if (q121=95)cand_elected=999995.
if (q121=96)cand_elected=999996.
if (q121=98)cand_elected=999998.

*高雄市第三選區.
if (q123=01)cand_elected=640301.
if (q123=02)cand_elected=640302.
if (q123=76)cand_elected=640376.
if (q123=84)cand_elected=640384.
if (q123=85)cand_elected=640385.
if (q123=88 and q199=01)cand_elected=690101.
if (q123=88 and q199=02)cand_elected=690102.
if (q123=88 and q199=03)cand_elected=690103.
if (q123=88 and q199=04)cand_elected=690104.
if (q123=88 and q199=07)cand_elected=690107.
if (q123=88 and q199=09)cand_elected=690109.
if (q123=88 and q199=10)cand_elected=690110.
if (q123=88 and q199=11)cand_elected=690111.
if (q123=88 and q199=12)cand_elected=690112.
if (q123=89 and q201=01)cand_elected=700101.
if (q123=89 and q201=02)cand_elected=700102.
if (q123=89 and q201=03)cand_elected=700103.
if (q123=89 and q201=06)cand_elected=700106.
if (q123=89 and q201=08)cand_elected=700108.
if (q123=89 and q201=09)cand_elected=700109.
if (q123=89 and q201=10)cand_elected=700110.
if (q123=89 and q201=11)cand_elected=700111.
if (q123=89 and q201=12)cand_elected=700112.
if (q123=89 and q201=13)cand_elected=700113.
if (q123=95)cand_elected=999995.
if (q123=96)cand_elected=999996.
if (q123=98)cand_elected=999998.

*高雄市第四選區.
if (q125=01)cand_elected=640401.
if (q125=02)cand_elected=640402.
if (q125=88 and q199=01)cand_elected=690101.
if (q125=88 and q199=02)cand_elected=690102.
if (q125=88 and q199=03)cand_elected=690103.
if (q125=88 and q199=04)cand_elected=690104.
if (q125=88 and q199=07)cand_elected=690107.
if (q125=88 and q199=09)cand_elected=690109.
if (q125=88 and q199=10)cand_elected=690110.
if (q125=88 and q199=11)cand_elected=690111.
if (q125=88 and q199=12)cand_elected=690112.
if (q125=89 and q201=01)cand_elected=700101.
if (q125=89 and q201=02)cand_elected=700102.
if (q125=89 and q201=03)cand_elected=700103.
if (q125=89 and q201=06)cand_elected=700106.
if (q125=89 and q201=08)cand_elected=700108.
if (q125=89 and q201=09)cand_elected=700109.
if (q125=89 and q201=10)cand_elected=700110.
if (q125=89 and q201=11)cand_elected=700111.
if (q125=89 and q201=12)cand_elected=700112.
if (q125=89 and q201=13)cand_elected=700113.
if (q125=95)cand_elected=999995.
if (q125=96)cand_elected=999996.
if (q125=98)cand_elected=999998.

*高雄市第五選區.
if (q127=01)cand_elected=640501.
if (q127=02)cand_elected=640502.
if (q127=79)cand_elected=640579.
if (q127=84)cand_elected=640584.
if (q127=88 and q199=01)cand_elected=690101.
if (q127=88 and q199=02)cand_elected=690102.
if (q127=88 and q199=03)cand_elected=690103.
if (q127=88 and q199=04)cand_elected=690104.
if (q127=88 and q199=07)cand_elected=690107.
if (q127=88 and q199=09)cand_elected=690109.
if (q127=88 and q199=10)cand_elected=690110.
if (q127=88 and q199=11)cand_elected=690111.
if (q127=88 and q199=12)cand_elected=690112.
if (q127=89 and q201=01)cand_elected=700101.
if (q127=89 and q201=02)cand_elected=700102.
if (q127=89 and q201=03)cand_elected=700103.
if (q127=89 and q201=06)cand_elected=700106.
if (q127=89 and q201=08)cand_elected=700108.
if (q127=89 and q201=09)cand_elected=700109.
if (q127=89 and q201=10)cand_elected=700110.
if (q127=89 and q201=11)cand_elected=700111.
if (q127=89 and q201=12)cand_elected=700112.
if (q127=89 and q201=13)cand_elected=700113.
if (q127=95)cand_elected=999995.
if (q127=96)cand_elected=999996.
if (q127=98)cand_elected=999998.


*高雄市第六選區.
if (q129=01)cand_elected=640601.
if (q129=02)cand_elected=640602.
if (q129=44)cand_elected=640644.
if (q129=88 and q199=01)cand_elected=690101.
if (q129=88 and q199=02)cand_elected=690102.
if (q129=88 and q199=03)cand_elected=690103.
if (q129=88 and q199=04)cand_elected=690104.
if (q129=88 and q199=07)cand_elected=690107.
if (q129=88 and q199=09)cand_elected=690109.
if (q129=88 and q199=10)cand_elected=690110.
if (q129=88 and q199=11)cand_elected=690111.
if (q129=88 and q199=12)cand_elected=690112.
if (q129=89 and q201=01)cand_elected=700101.
if (q129=89 and q201=02)cand_elected=700102.
if (q129=89 and q201=03)cand_elected=700103.
if (q129=89 and q201=06)cand_elected=700106.
if (q129=89 and q201=08)cand_elected=700108.
if (q129=89 and q201=09)cand_elected=700109.
if (q129=89 and q201=10)cand_elected=700110.
if (q129=89 and q201=11)cand_elected=700111.
if (q129=89 and q201=12)cand_elected=700112.
if (q129=89 and q201=13)cand_elected=700113.
if (q129=95)cand_elected=999995.
if (q129=96)cand_elected=999996.
if (q129=98)cand_elected=999998.

*高雄市第七選區.
if (q131=01)cand_elected=640701.
if (q131=02)cand_elected=640702.
if (q131=77)cand_elected=640777.
if (q131=84)cand_elected=640784.
if (q131=88 and q199=01)cand_elected=690101.
if (q131=88 and q199=02)cand_elected=690102.
if (q131=88 and q199=03)cand_elected=690103.
if (q131=88 and q199=04)cand_elected=690104.
if (q131=88 and q199=07)cand_elected=690107.
if (q131=88 and q199=09)cand_elected=690109.
if (q131=88 and q199=10)cand_elected=690110.
if (q131=88 and q199=11)cand_elected=690111.
if (q131=88 and q199=12)cand_elected=690112.
if (q131=89 and q201=01)cand_elected=700101.
if (q131=89 and q201=02)cand_elected=700102.
if (q131=89 and q201=03)cand_elected=700103.
if (q131=89 and q201=06)cand_elected=700106.
if (q131=89 and q201=08)cand_elected=700108.
if (q131=89 and q201=09)cand_elected=700109.
if (q131=89 and q201=10)cand_elected=700110.
if (q131=89 and q201=11)cand_elected=700111.
if (q131=89 and q201=12)cand_elected=700112.
if (q131=89 and q201=13)cand_elected=700113.
if (q131=95)cand_elected=999995.
if (q131=96)cand_elected=999996.
if (q131=98)cand_elected=999998.


*高雄市第八選區.
if (q133=01)cand_elected=640801.
if (q133=02)cand_elected=640802.
if (q133=13)cand_elected=640813.
if (q133=77)cand_elected=640877.
if (q133=88 and q199=01)cand_elected=690101.
if (q133=88 and q199=02)cand_elected=690102.
if (q133=88 and q199=03)cand_elected=690103.
if (q133=88 and q199=04)cand_elected=690104.
if (q133=88 and q199=07)cand_elected=690107.
if (q133=88 and q199=09)cand_elected=690109.
if (q133=88 and q199=10)cand_elected=690110.
if (q133=88 and q199=11)cand_elected=690111.
if (q133=88 and q199=12)cand_elected=690112.
if (q133=89 and q201=01)cand_elected=700101.
if (q133=89 and q201=02)cand_elected=700102.
if (q133=89 and q201=03)cand_elected=700103.
if (q133=89 and q201=06)cand_elected=700106.
if (q133=89 and q201=08)cand_elected=700108.
if (q133=89 and q201=09)cand_elected=700109.
if (q133=89 and q201=10)cand_elected=700110.
if (q133=89 and q201=11)cand_elected=700111.
if (q133=89 and q201=12)cand_elected=700112.
if (q133=89 and q201=13)cand_elected=700113.
if (q133=95)cand_elected=999995.
if (q133=96)cand_elected=999996.
if (q133=98)cand_elected=999998.

*新北市第一選區.
if (q135=01)cand_elected=650101.
if (q135=02)cand_elected=650102.
if (q135=25)cand_elected=650125.
if (q135=42)cand_elected=650142.
if (q135=75)cand_elected=650175.
if (q135=88 and q199=01)cand_elected=690101.
if (q135=88 and q199=02)cand_elected=690102.
if (q135=88 and q199=03)cand_elected=690103.
if (q135=88 and q199=04)cand_elected=690104.
if (q135=88 and q199=07)cand_elected=690107.
if (q135=88 and q199=09)cand_elected=690109.
if (q135=88 and q199=10)cand_elected=690110.
if (q135=88 and q199=11)cand_elected=690111.
if (q135=88 and q199=12)cand_elected=690112.
if (q135=89 and q201=01)cand_elected=700101.
if (q135=89 and q201=02)cand_elected=700102.
if (q135=89 and q201=03)cand_elected=700103.
if (q135=89 and q201=06)cand_elected=700106.
if (q135=89 and q201=08)cand_elected=700108.
if (q135=89 and q201=09)cand_elected=700109.
if (q135=89 and q201=10)cand_elected=700110.
if (q135=89 and q201=11)cand_elected=700111.
if (q135=89 and q201=12)cand_elected=700112.
if (q135=89 and q201=13)cand_elected=700113.
if (q135=95)cand_elected=999995.
if (q135=96)cand_elected=999996.
if (q135=98)cand_elected=999998.

*新北市第二選區.
if (q137=02)cand_elected=650202.
if (q137=25)cand_elected=650225.
if (q137=41)cand_elected=650241.
if (q137=88 and q199=01)cand_elected=690101.
if (q137=88 and q199=02)cand_elected=690102.
if (q137=88 and q199=03)cand_elected=690103.
if (q137=88 and q199=04)cand_elected=690104.
if (q137=88 and q199=07)cand_elected=690107.
if (q137=88 and q199=09)cand_elected=690109.
if (q137=88 and q199=10)cand_elected=690110.
if (q137=88 and q199=11)cand_elected=690111.
if (q137=88 and q199=12)cand_elected=690112.
if (q137=89 and q201=01)cand_elected=700101.
if (q137=89 and q201=02)cand_elected=700102.
if (q137=89 and q201=03)cand_elected=700103.
if (q137=89 and q201=06)cand_elected=700106.
if (q137=89 and q201=08)cand_elected=700108.
if (q137=89 and q201=09)cand_elected=700109.
if (q137=89 and q201=10)cand_elected=700110.
if (q137=89 and q201=11)cand_elected=700111.
if (q137=89 and q201=12)cand_elected=700112.
if (q137=89 and q201=13)cand_elected=700113.
if (q137=95)cand_elected=999995.
if (q137=96)cand_elected=999996.
if (q137=98)cand_elected=999998.


*新北市第三選區.
if (q139=01)cand_elected=650301.
if (q139=02)cand_elected=650302.
if (q139=84)cand_elected=650384.
if (q139=85)cand_elected=650385.
if (q139=88 and q199=01)cand_elected=690101.
if (q139=88 and q199=02)cand_elected=690102.
if (q139=88 and q199=03)cand_elected=690103.
if (q139=88 and q199=04)cand_elected=690104.
if (q139=88 and q199=07)cand_elected=690107.
if (q139=88 and q199=09)cand_elected=690109.
if (q139=88 and q199=10)cand_elected=690110.
if (q139=88 and q199=11)cand_elected=690111.
if (q139=88 and q199=12)cand_elected=690112.
if (q139=89 and q201=01)cand_elected=700101.
if (q139=89 and q201=02)cand_elected=700102.
if (q139=89 and q201=03)cand_elected=700103.
if (q139=89 and q201=06)cand_elected=700106.
if (q139=89 and q201=08)cand_elected=700108.
if (q139=89 and q201=09)cand_elected=700109.
if (q139=89 and q201=10)cand_elected=700110.
if (q139=89 and q201=11)cand_elected=700111.
if (q139=89 and q201=12)cand_elected=700112.
if (q139=89 and q201=13)cand_elected=700113.
if (q139=95)cand_elected=999995.
if (q139=96)cand_elected=999996.
if (q139=98)cand_elected=999998.

*新北市第四選區.
if (q141=01)cand_elected=650401.
if (q141=02)cand_elected=650402.
if (q141=75)cand_elected=650475.
if (q141=84)cand_elected=650484.
if (q141=85)cand_elected=650485.
if (q141=88 and q199=01)cand_elected=690101.
if (q141=88 and q199=02)cand_elected=690102.
if (q141=88 and q199=03)cand_elected=690103.
if (q141=88 and q199=04)cand_elected=690104.
if (q141=88 and q199=07)cand_elected=690107.
if (q141=88 and q199=09)cand_elected=690109.
if (q141=88 and q199=10)cand_elected=690110.
if (q141=88 and q199=11)cand_elected=690111.
if (q141=88 and q199=12)cand_elected=690112.
if (q141=89 and q201=01)cand_elected=700101.
if (q141=89 and q201=02)cand_elected=700102.
if (q141=89 and q201=03)cand_elected=700103.
if (q141=89 and q201=06)cand_elected=700106.
if (q141=89 and q201=08)cand_elected=700108.
if (q141=89 and q201=09)cand_elected=700109.
if (q141=89 and q201=10)cand_elected=700110.
if (q141=89 and q201=11)cand_elected=700111.
if (q141=89 and q201=12)cand_elected=700112.
if (q141=89 and q201=13)cand_elected=700113.
if (q141=95)cand_elected=999995.
if (q141=96)cand_elected=999996.
if (q141=98)cand_elected=999998.

*新北市第五選區.
if (q143=01)cand_elected=650501.
if (q143=02)cand_elected=650502.
if (q143=88 and q199=01)cand_elected=690101.
if (q143=88 and q199=02)cand_elected=690102.
if (q143=88 and q199=03)cand_elected=690103.
if (q143=88 and q199=04)cand_elected=690104.
if (q143=88 and q199=07)cand_elected=690107.
if (q143=88 and q199=09)cand_elected=690109.
if (q143=88 and q199=10)cand_elected=690110.
if (q143=88 and q199=11)cand_elected=690111.
if (q143=88 and q199=12)cand_elected=690112.
if (q143=89 and q201=01)cand_elected=700101.
if (q143=89 and q201=02)cand_elected=700102.
if (q143=89 and q201=03)cand_elected=700103.
if (q143=89 and q201=06)cand_elected=700106.
if (q143=89 and q201=08)cand_elected=700108.
if (q143=89 and q201=09)cand_elected=700109.
if (q143=89 and q201=10)cand_elected=700110.
if (q143=89 and q201=11)cand_elected=700111.
if (q143=89 and q201=12)cand_elected=700112.
if (q143=89 and q201=13)cand_elected=700113.
if (q143=95)cand_elected=999995.
if (q143=96)cand_elected=999996.
if (q143=98)cand_elected=999998.

*新北市第六選區.
if (q145=01)cand_elected=650601.
if (q145=02)cand_elected=650602.
if (q145=77)cand_elected=650677.
if (q145=88 and q199=01)cand_elected=690101.
if (q145=88 and q199=02)cand_elected=690102.
if (q145=88 and q199=03)cand_elected=690103.
if (q145=88 and q199=04)cand_elected=690104.
if (q145=88 and q199=07)cand_elected=690107.
if (q145=88 and q199=09)cand_elected=690109.
if (q145=88 and q199=10)cand_elected=690110.
if (q145=88 and q199=11)cand_elected=690111.
if (q145=88 and q199=12)cand_elected=690112.
if (q145=89 and q201=01)cand_elected=700101.
if (q145=89 and q201=02)cand_elected=700102.
if (q145=89 and q201=03)cand_elected=700103.
if (q145=89 and q201=06)cand_elected=700106.
if (q145=89 and q201=08)cand_elected=700108.
if (q145=89 and q201=09)cand_elected=700109.
if (q145=89 and q201=10)cand_elected=700110.
if (q145=89 and q201=11)cand_elected=700111.
if (q145=89 and q201=12)cand_elected=700112.
if (q145=89 and q201=13)cand_elected=700113.
if (q145=95)cand_elected=999995.
if (q145=96)cand_elected=999996.
if (q145=98)cand_elected=999998.

*新北市第七選區.
if (q147=01)cand_elected=650701.
if (q147=02)cand_elected=650702.
if (q147=79)cand_elected=650779.
if (q147=88 and q199=01)cand_elected=690101.
if (q147=88 and q199=02)cand_elected=690102.
if (q147=88 and q199=03)cand_elected=690103.
if (q147=88 and q199=04)cand_elected=690104.
if (q147=88 and q199=07)cand_elected=690107.
if (q147=88 and q199=09)cand_elected=690109.
if (q147=88 and q199=10)cand_elected=690110.
if (q147=88 and q199=11)cand_elected=690111.
if (q147=88 and q199=12)cand_elected=690112.
if (q147=89 and q201=01)cand_elected=700101.
if (q147=89 and q201=02)cand_elected=700102.
if (q147=89 and q201=03)cand_elected=700103.
if (q147=89 and q201=06)cand_elected=700106.
if (q147=89 and q201=08)cand_elected=700108.
if (q147=89 and q201=09)cand_elected=700109.
if (q147=89 and q201=10)cand_elected=700110.
if (q147=89 and q201=11)cand_elected=700111.
if (q147=89 and q201=12)cand_elected=700112.
if (q147=89 and q201=13)cand_elected=700113.
if (q147=95)cand_elected=999995.
if (q147=96)cand_elected=999996.
if (q147=98)cand_elected=999998.


*新北市第八選區.
if (q149=01)cand_elected=650801.
if (q149=02)cand_elected=650802.
if (q149=41)cand_elected=650841.
if (q149=88 and q199=01)cand_elected=690101.
if (q149=88 and q199=02)cand_elected=690102.
if (q149=88 and q199=03)cand_elected=690103.
if (q149=88 and q199=04)cand_elected=690104.
if (q149=88 and q199=07)cand_elected=690107.
if (q149=88 and q199=09)cand_elected=690109.
if (q149=88 and q199=10)cand_elected=690110.
if (q149=88 and q199=11)cand_elected=690111.
if (q149=88 and q199=12)cand_elected=690112.
if (q149=89 and q201=01)cand_elected=700101.
if (q149=89 and q201=02)cand_elected=700102.
if (q149=89 and q201=03)cand_elected=700103.
if (q149=89 and q201=06)cand_elected=700106.
if (q149=89 and q201=08)cand_elected=700108.
if (q149=89 and q201=09)cand_elected=700109.
if (q149=89 and q201=10)cand_elected=700110.
if (q149=89 and q201=11)cand_elected=700111.
if (q149=89 and q201=12)cand_elected=700112.
if (q149=89 and q201=13)cand_elected=700113.
if (q149=95)cand_elected=999995.
if (q149=96)cand_elected=999996.
if (q149=98)cand_elected=999998.

*新北市第九選區.
if (q151=01)cand_elected=650901.
if (q151=02)cand_elected=650902.
if (q151=42)cand_elected=650942.
if (q151=88 and q199=01)cand_elected=690101.
if (q151=88 and q199=02)cand_elected=690102.
if (q151=88 and q199=03)cand_elected=690103.
if (q151=88 and q199=04)cand_elected=690104.
if (q151=88 and q199=07)cand_elected=690107.
if (q151=88 and q199=09)cand_elected=690109.
if (q151=88 and q199=10)cand_elected=690110.
if (q151=88 and q199=11)cand_elected=690111.
if (q151=88 and q199=12)cand_elected=690112.
if (q151=89 and q201=01)cand_elected=700101.
if (q151=89 and q201=02)cand_elected=700102.
if (q151=89 and q201=03)cand_elected=700103.
if (q151=89 and q201=06)cand_elected=700106.
if (q151=89 and q201=08)cand_elected=700108.
if (q151=89 and q201=09)cand_elected=700109.
if (q151=89 and q201=10)cand_elected=700110.
if (q151=89 and q201=11)cand_elected=700111.
if (q151=89 and q201=12)cand_elected=700112.
if (q151=89 and q201=13)cand_elected=700113.
if (q151=95)cand_elected=999995.
if (q151=96)cand_elected=999996.
if (q151=98)cand_elected=999998.

*新北市第十選區.
if (q153=01)cand_elected=651001.
if (q153=02)cand_elected=651002.
if (q153=73)cand_elected=651073.
if (q153=80)cand_elected=651080.
if (q153=88 and q199=01)cand_elected=690101.
if (q153=88 and q199=02)cand_elected=690102.
if (q153=88 and q199=03)cand_elected=690103.
if (q153=88 and q199=04)cand_elected=690104.
if (q153=88 and q199=07)cand_elected=690107.
if (q153=88 and q199=09)cand_elected=690109.
if (q153=88 and q199=10)cand_elected=690110.
if (q153=88 and q199=11)cand_elected=690111.
if (q153=88 and q199=12)cand_elected=690112.
if (q153=89 and q201=01)cand_elected=700101.
if (q153=89 and q201=02)cand_elected=700102.
if (q153=89 and q201=03)cand_elected=700103.
if (q153=89 and q201=06)cand_elected=700106.
if (q153=89 and q201=08)cand_elected=700108.
if (q153=89 and q201=09)cand_elected=700109.
if (q153=89 and q201=10)cand_elected=700110.
if (q153=89 and q201=11)cand_elected=700111.
if (q153=89 and q201=12)cand_elected=700112.
if (q153=89 and q201=13)cand_elected=700113.
if (q153=95)cand_elected=999995.
if (q153=96)cand_elected=999996.
if (q153=98)cand_elected=999998.

*新北市第十一選區.
if (q155=01)cand_elected=651101.
if (q155=02)cand_elected=651102.
if (q155=52)cand_elected=651152.
if (q155=73)cand_elected=651173.
if (q155=75)cand_elected=651175.
if (q155=84)cand_elected=651184.
if (q155=88 and q199=01)cand_elected=690101.
if (q155=88 and q199=02)cand_elected=690102.
if (q155=88 and q199=03)cand_elected=690103.
if (q155=88 and q199=04)cand_elected=690104.
if (q155=88 and q199=07)cand_elected=690107.
if (q155=88 and q199=09)cand_elected=690109.
if (q155=88 and q199=10)cand_elected=690110.
if (q155=88 and q199=11)cand_elected=690111.
if (q155=88 and q199=12)cand_elected=690112.
if (q155=89 and q201=01)cand_elected=700101.
if (q155=89 and q201=02)cand_elected=700102.
if (q155=89 and q201=03)cand_elected=700103.
if (q155=89 and q201=06)cand_elected=700106.
if (q155=89 and q201=08)cand_elected=700108.
if (q155=89 and q201=09)cand_elected=700109.
if (q155=89 and q201=10)cand_elected=700110.
if (q155=89 and q201=11)cand_elected=700111.
if (q155=89 and q201=12)cand_elected=700112.
if (q155=89 and q201=13)cand_elected=700113.
if (q155=95)cand_elected=999995.
if (q155=96)cand_elected=999996.
if (q155=98)cand_elected=999998.

*新北市第十二選區.
if (q157=01)cand_elected=651201.
if (q157=02)cand_elected=651202.
if (q157=42)cand_elected=651242.
if (q157=71)cand_elected=651271.
if (q157=84)cand_elected=651284.
if (q157=85)cand_elected=651285.
if (q157=88 and q199=01)cand_elected=690101.
if (q157=88 and q199=02)cand_elected=690102.
if (q157=88 and q199=03)cand_elected=690103.
if (q157=88 and q199=04)cand_elected=690104.
if (q157=88 and q199=07)cand_elected=690107.
if (q157=88 and q199=09)cand_elected=690109.
if (q157=88 and q199=10)cand_elected=690110.
if (q157=88 and q199=11)cand_elected=690111.
if (q157=88 and q199=12)cand_elected=690112.
if (q157=89 and q201=01)cand_elected=700101.
if (q157=89 and q201=02)cand_elected=700102.
if (q157=89 and q201=03)cand_elected=700103.
if (q157=89 and q201=06)cand_elected=700106.
if (q157=89 and q201=08)cand_elected=700108.
if (q157=89 and q201=09)cand_elected=700109.
if (q157=89 and q201=10)cand_elected=700110.
if (q157=89 and q201=11)cand_elected=700111.
if (q157=89 and q201=12)cand_elected=700112.
if (q157=89 and q201=13)cand_elected=700113.
if (q157=95)cand_elected=999995.
if (q157=96)cand_elected=999996.
if (q157=98)cand_elected=999998.

*台中市第一選區.
if (q159=02)cand_elected=660102.
if (q159=41)cand_elected=660141.
if (q159=84)cand_elected=660184.
if (q159=85)cand_elected=660185.
if (q159=88 and q199=01)cand_elected=690101.
if (q159=88 and q199=02)cand_elected=690102.
if (q159=88 and q199=03)cand_elected=690103.
if (q159=88 and q199=04)cand_elected=690104.
if (q159=88 and q199=07)cand_elected=690107.
if (q159=88 and q199=09)cand_elected=690109.
if (q159=88 and q199=10)cand_elected=690110.
if (q159=88 and q199=11)cand_elected=690111.
if (q159=88 and q199=12)cand_elected=690112.
if (q159=89 and q201=01)cand_elected=700101.
if (q159=89 and q201=02)cand_elected=700102.
if (q159=89 and q201=03)cand_elected=700103.
if (q159=89 and q201=06)cand_elected=700106.
if (q159=89 and q201=08)cand_elected=700108.
if (q159=89 and q201=09)cand_elected=700109.
if (q159=89 and q201=10)cand_elected=700110.
if (q159=89 and q201=11)cand_elected=700111.
if (q159=89 and q201=12)cand_elected=700112.
if (q159=89 and q201=13)cand_elected=700113.
if (q159=95)cand_elected=999995.
if (q159=96)cand_elected=999996.
if (q159=98)cand_elected=999998.

*台中市第二選區.
if (q161=01)cand_elected=660201.
if (q161=02)cand_elected=660202.
if (q161=61)cand_elected=660261.
if (q161=84)cand_elected=660284.
if (q161=88 and q199=01)cand_elected=690101.
if (q161=88 and q199=02)cand_elected=690102.
if (q161=88 and q199=03)cand_elected=690103.
if (q161=88 and q199=04)cand_elected=690104.
if (q161=88 and q199=07)cand_elected=690107.
if (q161=88 and q199=09)cand_elected=690109.
if (q161=88 and q199=10)cand_elected=690110.
if (q161=88 and q199=11)cand_elected=690111.
if (q161=88 and q199=12)cand_elected=690112.
if (q161=89 and q201=01)cand_elected=700101.
if (q161=89 and q201=02)cand_elected=700102.
if (q161=89 and q201=03)cand_elected=700103.
if (q161=89 and q201=06)cand_elected=700106.
if (q161=89 and q201=08)cand_elected=700108.
if (q161=89 and q201=09)cand_elected=700109.
if (q161=89 and q201=10)cand_elected=700110.
if (q161=89 and q201=11)cand_elected=700111.
if (q161=89 and q201=12)cand_elected=700112.
if (q161=89 and q201=13)cand_elected=700113.
if (q161=95)cand_elected=999995.
if (q161=96)cand_elected=999996.
if (q161=98)cand_elected=999998.


*台中市第三選區.
if (q163=01)cand_elected=660301.
if (q163=02)cand_elected=660302.
if (q163=77)cand_elected=660377.
if (q163=88 and q199=01)cand_elected=690101.
if (q163=88 and q199=02)cand_elected=690102.
if (q163=88 and q199=03)cand_elected=690103.
if (q163=88 and q199=04)cand_elected=690104.
if (q163=88 and q199=07)cand_elected=690107.
if (q163=88 and q199=09)cand_elected=690109.
if (q163=88 and q199=10)cand_elected=690110.
if (q163=88 and q199=11)cand_elected=690111.
if (q163=88 and q199=12)cand_elected=690112.
if (q163=89 and q201=01)cand_elected=700101.
if (q163=89 and q201=02)cand_elected=700102.
if (q163=89 and q201=03)cand_elected=700103.
if (q163=89 and q201=06)cand_elected=700106.
if (q163=89 and q201=08)cand_elected=700108.
if (q163=89 and q201=09)cand_elected=700109.
if (q163=89 and q201=10)cand_elected=700110.
if (q163=89 and q201=11)cand_elected=700111.
if (q163=89 and q201=12)cand_elected=700112.
if (q163=89 and q201=13)cand_elected=700113.
if (q163=95)cand_elected=999995.
if (q163=96)cand_elected=999996.
if (q163=98)cand_elected=999998.

*台中市第四選區.
if (q165=01)cand_elected=660401.
if (q165=02)cand_elected=660402.
if (q165=71)cand_elected=660471.
if (q165=72)cand_elected=660472.
if (q165=85)cand_elected=660485.
if (q165=88 and q199=01)cand_elected=690101.
if (q165=88 and q199=02)cand_elected=690102.
if (q165=88 and q199=03)cand_elected=690103.
if (q165=88 and q199=04)cand_elected=690104.
if (q165=88 and q199=07)cand_elected=690107.
if (q165=88 and q199=09)cand_elected=690109.
if (q165=88 and q199=10)cand_elected=690110.
if (q165=88 and q199=11)cand_elected=690111.
if (q165=88 and q199=12)cand_elected=690112.
if (q165=89 and q201=01)cand_elected=700101.
if (q165=89 and q201=02)cand_elected=700102.
if (q165=89 and q201=03)cand_elected=700103.
if (q165=89 and q201=06)cand_elected=700106.
if (q165=89 and q201=08)cand_elected=700108.
if (q165=89 and q201=09)cand_elected=700109.
if (q165=89 and q201=10)cand_elected=700110.
if (q165=89 and q201=11)cand_elected=700111.
if (q165=89 and q201=12)cand_elected=700112.
if (q165=89 and q201=13)cand_elected=700113.
if (q165=95)cand_elected=999995.
if (q165=96)cand_elected=999996.
if (q165=98)cand_elected=999998.

*台中市第五選區.
if (q167=01)cand_elected=660501.
if (q167=02)cand_elected=660502.
if (q167=25)cand_elected=660525.
if (q167=71)cand_elected=660571.
if (q167=77)cand_elected=660577.
if (q167=79)cand_elected=660579.
if (q167=84)cand_elected=660584.
if (q167=85)cand_elected=660585.
if (q167=88 and q199=01)cand_elected=690101.
if (q167=88 and q199=02)cand_elected=690102.
if (q167=88 and q199=03)cand_elected=690103.
if (q167=88 and q199=04)cand_elected=690104.
if (q167=88 and q199=07)cand_elected=690107.
if (q167=88 and q199=09)cand_elected=690109.
if (q167=88 and q199=10)cand_elected=690110.
if (q167=88 and q199=11)cand_elected=690111.
if (q167=88 and q199=12)cand_elected=690112.
if (q167=89 and q201=01)cand_elected=700101.
if (q167=89 and q201=02)cand_elected=700102.
if (q167=89 and q201=03)cand_elected=700103.
if (q167=89 and q201=06)cand_elected=700106.
if (q167=89 and q201=08)cand_elected=700108.
if (q167=89 and q201=09)cand_elected=700109.
if (q167=89 and q201=10)cand_elected=700110.
if (q167=89 and q201=11)cand_elected=700111.
if (q167=89 and q201=12)cand_elected=700112.
if (q167=89 and q201=13)cand_elected=700113.
if (q167=95)cand_elected=999995.
if (q167=96)cand_elected=999996.
if (q167=98)cand_elected=999998.

*台中市第六選區.
if (q169=01)cand_elected=660601.
if (q169=02)cand_elected=660602.
if (q169=25)cand_elected=660625.
if (q169=84)cand_elected=660684.
if (q169=85)cand_elected=660685.
if (q169=88 and q199=01)cand_elected=690101.
if (q169=88 and q199=02)cand_elected=690102.
if (q169=88 and q199=03)cand_elected=690103.
if (q169=88 and q199=04)cand_elected=690104.
if (q169=88 and q199=07)cand_elected=690107.
if (q169=88 and q199=09)cand_elected=690109.
if (q169=88 and q199=10)cand_elected=690110.
if (q169=88 and q199=11)cand_elected=690111.
if (q169=88 and q199=12)cand_elected=690112.
if (q169=89 and q201=01)cand_elected=700101.
if (q169=89 and q201=02)cand_elected=700102.
if (q169=89 and q201=03)cand_elected=700103.
if (q169=89 and q201=06)cand_elected=700106.
if (q169=89 and q201=08)cand_elected=700108.
if (q169=89 and q201=09)cand_elected=700109.
if (q169=89 and q201=10)cand_elected=700110.
if (q169=89 and q201=11)cand_elected=700111.
if (q169=89 and q201=12)cand_elected=700112.
if (q169=89 and q201=13)cand_elected=700113.
if (q169=95)cand_elected=999995.
if (q169=96)cand_elected=999996.
if (q169=98)cand_elected=999998.

*台中市第七選區.
if (q171=01)cand_elected=660701.
if (q171=02)cand_elected=660702.
if (q171=77)cand_elected=660777.
if (q171=88 and q199=01)cand_elected=690101.
if (q171=88 and q199=02)cand_elected=690102.
if (q171=88 and q199=03)cand_elected=690103.
if (q171=88 and q199=04)cand_elected=690104.
if (q171=88 and q199=07)cand_elected=690107.
if (q171=88 and q199=09)cand_elected=690109.
if (q171=88 and q199=10)cand_elected=690110.
if (q171=88 and q199=11)cand_elected=690111.
if (q171=88 and q199=12)cand_elected=690112.
if (q171=89 and q201=01)cand_elected=700101.
if (q171=89 and q201=02)cand_elected=700102.
if (q171=89 and q201=03)cand_elected=700103.
if (q171=89 and q201=06)cand_elected=700106.
if (q171=89 and q201=08)cand_elected=700108.
if (q171=89 and q201=09)cand_elected=700109.
if (q171=89 and q201=10)cand_elected=700110.
if (q171=89 and q201=11)cand_elected=700111.
if (q171=89 and q201=12)cand_elected=700112.
if (q171=89 and q201=13)cand_elected=700113.
if (q171=95)cand_elected=999995.
if (q171=96)cand_elected=999996.
if (q171=98)cand_elected=999998.
      
*台中市第八選區.
if (q173=01)cand_elected=660801.
if (q173=02)cand_elected=660802.
if (q173=88 and q199=01)cand_elected=690101.
if (q173=88 and q199=02)cand_elected=690102.
if (q173=88 and q199=03)cand_elected=690103.
if (q173=88 and q199=04)cand_elected=690104.
if (q173=88 and q199=07)cand_elected=690107.
if (q173=88 and q199=09)cand_elected=690109.
if (q173=88 and q199=10)cand_elected=690110.
if (q173=88 and q199=11)cand_elected=690111.
if (q173=88 and q199=12)cand_elected=690112.
if (q173=89 and q201=01)cand_elected=700101.
if (q173=89 and q201=02)cand_elected=700102.
if (q173=89 and q201=03)cand_elected=700103.
if (q173=89 and q201=06)cand_elected=700106.
if (q173=89 and q201=08)cand_elected=700108.
if (q173=89 and q201=09)cand_elected=700109.
if (q173=89 and q201=10)cand_elected=700110.
if (q173=89 and q201=11)cand_elected=700111.
if (q173=89 and q201=12)cand_elected=700112.
if (q173=89 and q201=13)cand_elected=700113.
if (q173=95)cand_elected=999995.
if (q173=96)cand_elected=999996.
if (q173=98)cand_elected=999998.

*台南市第一選區.
if (q175=01)cand_elected=670101.
if (q175=02)cand_elected=670102.
if (q175=25)cand_elected=670125.
if (q175=80)cand_elected=670180.
if (q175=84)cand_elected=670184.
if (q175=85)cand_elected=670185.
if (q175=88 and q199=01)cand_elected=690101.
if (q175=88 and q199=02)cand_elected=690102.
if (q175=88 and q199=03)cand_elected=690103.
if (q175=88 and q199=04)cand_elected=690104.
if (q175=88 and q199=07)cand_elected=690107.
if (q175=88 and q199=09)cand_elected=690109.
if (q175=88 and q199=10)cand_elected=690110.
if (q175=88 and q199=11)cand_elected=690111.
if (q175=88 and q199=12)cand_elected=690112.
if (q175=89 and q201=01)cand_elected=700101.
if (q175=89 and q201=02)cand_elected=700102.
if (q175=89 and q201=03)cand_elected=700103.
if (q175=89 and q201=06)cand_elected=700106.
if (q175=89 and q201=08)cand_elected=700108.
if (q175=89 and q201=09)cand_elected=700109.
if (q175=89 and q201=10)cand_elected=700110.
if (q175=89 and q201=11)cand_elected=700111.
if (q175=89 and q201=12)cand_elected=700112.
if (q175=89 and q201=13)cand_elected=700113.
if (q175=95)cand_elected=999995.
if (q175=96)cand_elected=999996.
if (q175=98)cand_elected=999998.


*台南市第二選區.
if (q177=02)cand_elected=670202.
if (q177=73)cand_elected=670273.
if (q177=84)cand_elected=670284.
if (q177=88 and q199=01)cand_elected=690101.
if (q177=88 and q199=02)cand_elected=690102.
if (q177=88 and q199=03)cand_elected=690103.
if (q177=88 and q199=04)cand_elected=690104.
if (q177=88 and q199=07)cand_elected=690107.
if (q177=88 and q199=09)cand_elected=690109.
if (q177=88 and q199=10)cand_elected=690110.
if (q177=88 and q199=11)cand_elected=690111.
if (q177=88 and q199=12)cand_elected=690112.
if (q177=89 and q201=01)cand_elected=700101.
if (q177=89 and q201=02)cand_elected=700102.
if (q177=89 and q201=03)cand_elected=700103.
if (q177=89 and q201=06)cand_elected=700106.
if (q177=89 and q201=08)cand_elected=700108.
if (q177=89 and q201=09)cand_elected=700109.
if (q177=89 and q201=10)cand_elected=700110.
if (q177=89 and q201=11)cand_elected=700111.
if (q177=89 and q201=12)cand_elected=700112.
if (q177=89 and q201=13)cand_elected=700113.
if (q177=95)cand_elected=999995.
if (q177=96)cand_elected=999996.
if (q177=98)cand_elected=999998.

*台南市第三選區.
if (q179=01)cand_elected=670301.
if (q179=02)cand_elected=670302.
if (q179=88 and q199=01)cand_elected=690101.
if (q179=88 and q199=02)cand_elected=690102.
if (q179=88 and q199=03)cand_elected=690103.
if (q179=88 and q199=04)cand_elected=690104.
if (q179=88 and q199=07)cand_elected=690107.
if (q179=88 and q199=09)cand_elected=690109.
if (q179=88 and q199=10)cand_elected=690110.
if (q179=88 and q199=11)cand_elected=690111.
if (q179=88 and q199=12)cand_elected=690112.
if (q179=89 and q201=01)cand_elected=700101.
if (q179=89 and q201=02)cand_elected=700102.
if (q179=89 and q201=03)cand_elected=700103.
if (q179=89 and q201=06)cand_elected=700106.
if (q179=89 and q201=08)cand_elected=700108.
if (q179=89 and q201=09)cand_elected=700109.
if (q179=89 and q201=10)cand_elected=700110.
if (q179=89 and q201=11)cand_elected=700111.
if (q179=89 and q201=12)cand_elected=700112.
if (q179=89 and q201=13)cand_elected=700113.
if (q179=95)cand_elected=999995.
if (q179=96)cand_elected=999996.
if (q179=98)cand_elected=999998.

*台南市第四選區.
if (q181=02)cand_elected=670402.
if (q181=77)cand_elected=670477.
if (q181=84)cand_elected=670484.
if (q181=88 and q199=01)cand_elected=690101.
if (q181=88 and q199=02)cand_elected=690102.
if (q181=88 and q199=03)cand_elected=690103.
if (q181=88 and q199=04)cand_elected=690104.
if (q181=88 and q199=07)cand_elected=690107.
if (q181=88 and q199=09)cand_elected=690109.
if (q181=88 and q199=10)cand_elected=690110.
if (q181=88 and q199=11)cand_elected=690111.
if (q181=88 and q199=12)cand_elected=690112.
if (q181=89 and q201=01)cand_elected=700101.
if (q181=89 and q201=02)cand_elected=700102.
if (q181=89 and q201=03)cand_elected=700103.
if (q181=89 and q201=06)cand_elected=700106.
if (q181=89 and q201=08)cand_elected=700108.
if (q181=89 and q201=09)cand_elected=700109.
if (q181=89 and q201=10)cand_elected=700110.
if (q181=89 and q201=11)cand_elected=700111.
if (q181=89 and q201=12)cand_elected=700112.
if (q181=89 and q201=13)cand_elected=700113.
if (q181=95)cand_elected=999995.
if (q181=96)cand_elected=999996.
if (q181=98)cand_elected=999998.

*台南市第五選區.
if (q183=02)cand_elected=670502.
if (q183=72)cand_elected=670572.
if (q183=88 and q199=01)cand_elected=690101.
if (q183=88 and q199=02)cand_elected=690102.
if (q183=88 and q199=03)cand_elected=690103.
if (q183=88 and q199=04)cand_elected=690104.
if (q183=88 and q199=07)cand_elected=690107.
if (q183=88 and q199=09)cand_elected=690109.
if (q183=88 and q199=10)cand_elected=690110.
if (q183=88 and q199=11)cand_elected=690111.
if (q183=88 and q199=12)cand_elected=690112.
if (q183=89 and q201=01)cand_elected=700101.
if (q183=89 and q201=02)cand_elected=700102.
if (q183=89 and q201=03)cand_elected=700103.
if (q183=89 and q201=06)cand_elected=700106.
if (q183=89 and q201=08)cand_elected=700108.
if (q183=89 and q201=09)cand_elected=700109.
if (q183=89 and q201=10)cand_elected=700110.
if (q183=89 and q201=11)cand_elected=700111.
if (q183=89 and q201=12)cand_elected=700112.
if (q183=89 and q201=13)cand_elected=700113.
if (q183=95)cand_elected=999995.
if (q183=96)cand_elected=999996.
if (q183=98)cand_elected=999998.

*台南市第六選區.
if (q185=01)cand_elected=670601.
if (q185=02)cand_elected=670602.
if (q185=84)cand_elected=670684.
if (q185=88 and q199=01)cand_elected=690101.
if (q185=88 and q199=02)cand_elected=690102.
if (q185=88 and q199=03)cand_elected=690103.
if (q185=88 and q199=04)cand_elected=690104.
if (q185=88 and q199=07)cand_elected=690107.
if (q185=88 and q199=09)cand_elected=690109.
if (q185=88 and q199=10)cand_elected=690110.
if (q185=88 and q199=11)cand_elected=690111.
if (q185=88 and q199=12)cand_elected=690112.
if (q185=89 and q201=01)cand_elected=700101.
if (q185=89 and q201=02)cand_elected=700102.
if (q185=89 and q201=03)cand_elected=700103.
if (q185=89 and q201=06)cand_elected=700106.
if (q185=89 and q201=08)cand_elected=700108.
if (q185=89 and q201=09)cand_elected=700109.
if (q185=89 and q201=10)cand_elected=700110.
if (q185=89 and q201=11)cand_elected=700111.
if (q185=89 and q201=12)cand_elected=700112.
if (q185=89 and q201=13)cand_elected=700113.
if (q185=95)cand_elected=999995.
if (q185=96)cand_elected=999996.
if (q185=98)cand_elected=999998.

*金門縣.
if (q99=01)cand_elected=280101.
if (q99=41)cand_elected=280141.
if (q99=84)cand_elected=280184.
if (q99=88 and q199=01)cand_elected=690101.
if (q99=88 and q199=02)cand_elected=690102.
if (q99=88 and q199=03)cand_elected=690103.
if (q99=88 and q199=04)cand_elected=690104.
if (q99=88 and q199=07)cand_elected=690107.
if (q99=88 and q199=09)cand_elected=690109.
if (q99=88 and q199=10)cand_elected=690110.
if (q99=88 and q199=11)cand_elected=690111.
if (q99=88 and q199=12)cand_elected=690112.
if (q99=89 and q201=01)cand_elected=700101.
if (q99=89 and q201=02)cand_elected=700102.
if (q99=89 and q201=03)cand_elected=700103.
if (q99=89 and q201=06)cand_elected=700106.
if (q99=89 and q201=08)cand_elected=700108.
if (q99=89 and q201=09)cand_elected=700109.
if (q99=89 and q201=10)cand_elected=700110.
if (q99=89 and q201=11)cand_elected=700111.
if (q99=89 and q201=12)cand_elected=700112.
if (q99=89 and q201=13)cand_elected=700113.
if (q99=95)cand_elected=999995.
if (q99=96)cand_elected=999996.
if (q99=98)cand_elected=999998.


*連江縣.
if (q101=01)cand_elected=290101.
if (q101=02)cand_elected=290102.
if (q101=41)cand_elected=290141.
if (q101=88 and q199=01)cand_elected=690101.
if (q101=88 and q199=02)cand_elected=690102.
if (q101=88 and q199=03)cand_elected=690103.
if (q101=88 and q199=04)cand_elected=690104.
if (q101=88 and q199=07)cand_elected=690107.
if (q101=88 and q199=09)cand_elected=690109.
if (q101=88 and q199=10)cand_elected=690110.
if (q101=88 and q199=11)cand_elected=690111.
if (q101=88 and q199=12)cand_elected=690112.
if (q101=89 and q201=01)cand_elected=700101.
if (q101=89 and q201=02)cand_elected=700102.
if (q101=89 and q201=03)cand_elected=700103.
if (q101=89 and q201=06)cand_elected=700106.
if (q101=89 and q201=08)cand_elected=700108.
if (q101=89 and q201=09)cand_elected=700109.
if (q101=89 and q201=10)cand_elected=700110.
if (q101=89 and q201=11)cand_elected=700111.
if (q101=89 and q201=12)cand_elected=700112.
if (q101=89 and q201=13)cand_elected=700113.
if (q101=95)cand_elected=999995.
if (q101=96)cand_elected=999996.
if (q101=98)cand_elected=999998.

*平地原住民.
if (q199=01)cand_elected=690101.
if (q199=02)cand_elected=690102.
if (q199=03)cand_elected=690103.
if (q199=04)cand_elected=690104.
if (q199=09)cand_elected=690109.
if (q199=10)cand_elected=690110.
if (q199=11)cand_elected=690111.
if (q199=12)cand_elected=690112.
if (q199=92 or q199=96 or q199=98)cand_elected=999992.
if (q199=95)cand_elected=999995.
if (q199=96)cand_elected=999996.
if (q199=98)cand_elected=999998.

*山地原住民.
if (q201=01)cand_elected=700101.
if (q201=02)cand_elected=700102.
if (q201=03)cand_elected=700103.
if (q201=06)cand_elected=700106.
if (q201=08)cand_elected=700108.
if (q201=09)cand_elected=700109.
if (q201=10)cand_elected=700110.
if (q201=11)cand_elected=700111.
if (q201=12)cand_elected=700112.
if (q201=12)cand_elected=700113.
if (q201=92 or q201=96 or q201=98)cand_elected=999992.
if (q201=95)cand_elected=999995.
if (q201=96)cand_elected=999996.
if (q201=98)cand_elected=999998.

var lab cand_elected "哪一位候選人比較可能會當選？".  

val lab cand_elected
630101 "張斯綱/男/中國國民黨"
630102 "吳思瑤/女/民主進步黨"
630148 "賴宗育/男/人民民主黨"
630171 "陳執中/男/台灣雙語無法黨"
630173 "張臺勝/男/人民最大黨"
630174 "胡金城/男/人民最大黨"
630184 "許盛鋒/男/無"
630185 "侯漢廷/男/無"
630201 "游淑慧/女/中國國民黨"
630202 "王世堅/男/民主進步黨"
630225 "郭啟源/男/中華統一促進黨"
630273 "何梅娟/女/人民最大黨"
630275 "熊嘉玲/女/制度救世島"
630301 "王鴻薇/女/中國國民黨"
630302 "謝佩芬/女/民主進步黨"
630342 "楊時睿/男/台灣維新"
630371 "陳一郎/男/台灣雙語無法黨"
630373 "余新造/男/人民最大黨"
630375 "高士恩/男/制度救世島"
630384 "陳源發/男/無"
630401 "李彥秀/女/中國國民黨"
630402 "高嘉瑜/女/民主進步黨"
630417 "吳欣岱/女/台灣基進"
630459 "林秋彤/女/台灣整復師聯盟工黨"
630475 "黃啟彬/男/制度救世島"
630501 "鍾小平/男/中國國民黨"
630502 "吳沛憶/女/民主進步黨"
630538 "許敬民/男/合一行動聯盟"
630576 "張華特/男/台灣麻將最大黨"
630577 "李慧曦/女/司法改革黨"
630578 "蘇諍/男/經濟黨"
630584 "于美人/女/無"
630585 "林志成/男/無"
630586 "陳燕玉/女/無"
630587 "孫智麗/女/無"
630601 "羅智強/男/中國國民黨"
630624 "苗博雅/女/社會民主黨"
630642 "朱翊銘/男/台灣維新"
630671 "崔建章/男/台灣雙語無法黨"
630675 "張雪卿/女/制度救世島"
630701 "徐巧芯/女/中國國民黨"
630702 "許淑華/女/民主進步黨"
630742 "羅丹/男/台灣維新"
630753 "李承龍/男/中華愛國同心黨"
630784 "陳韋安/男/無"
630801 "賴士葆/男/中國國民黨"
630802 "王閔生/男/民主進步黨"
630841 "張其祿/男/台灣民眾黨"
630842 "劉佩玲/女/台灣維新"
630867 "胡之壯/男/興中同盟會"
630879 "賴宣任/女/小民參政歐巴桑聯盟"
630884 "夏萬浪/男/無"
630885 "張維學/男/無"
650101 "洪孟楷/男/中國國民黨"
650102 "何博文/男/民主進步黨"
650125 "翁藤原/男/中華統一促進黨"
650142 "徐百弟/男/台灣維新"
650175 "游清池/男/制度救世島"
650202 "林淑芬/女/民主進步黨"
650225 "何淯笙/男/中華統一促進黨"
650241 "李有宜/女/台灣民眾黨"
650301 "蔡明堂/男/中國國民黨"
650302 "李坤城/男/民主進步黨"
650384 "陳東雲/男/無"
650385 "蘇卿彥/男/無"
650401 "蔣欣璋/男/中國國民黨"
650402 "吳秉叡/男/民主進步黨"
650475 "邱吉均/男/制度救世島"
650484 "蘇輝湟/男/無"
650485 "洪懿馥/女/無"
650501 "洪佳君/女/中國國民黨"
650502 "蘇巧慧/女/民主進步黨"
650601 "林國春/男/中國國民黨"
650602 "張宏陸/男/民主進步黨"
650677 "黃淑珍/女/司法改革黨"
650701 "葉元之/男/中國國民黨"
650702 "羅致政/男/民主進步黨"
650779 "劉書婷/女/小民參政歐巴桑聯盟"
650801 "張智倫/男/中國國民黨"
650802 "吳崢/男/民主進步黨"
650841 "邱臣遠/男/台灣民眾黨"
650901 "林德福/男/中國國民黨"
650902 "莊銘淵/男/民主進步黨"
650942 "陳愷寧/女/台灣維新"
651001 "林金結/男/中國國民黨"
651002 "吳琪銘/男/民主進步黨"
651073 "孟藹倫/女/人民最大黨"
651080 "袁興/男/復康聯盟黨"
651101 "羅明才/男/中國國民黨"
651102 "曾柏瑜/女/民主進步黨"
651152 "陳聖/男/中華婦女黨"
651173 "張家榛/女/人民最大黨"
651175 "魏趨安/男/制度救世島"
651184 "鄭添泉/男/無"
651201 "廖先翔/男/中國國民黨"
651202 "賴品妤/女/民主進步黨"
651242 "陳長志/男/台灣維新"
651271 "李佳蒨/女/台灣雙語無法黨"
651284 "黃瑞傳/男/無"
651285 "楊木火/男/無"
680101 "牛煦庭/男/中國國民黨"
680102 "鄭運鵬/男/民主進步黨"
680184 "馬治薇/女/無"
680201 "涂權吉/男/中國國民黨"
680202 "黃世杰/男/民主進步黨"
680225 "陳志豪/男/中華統一促進黨"
680284 "王思玟/男/無"
680301 "魯明哲/男/中國國民黨"
680302 "彭俊豪/男/民主進步黨"
680303 "游智彬/男/新黨"
680375 "戴浙/男/制度救世島"
680379 "徐鶯慈/女/小民參政歐巴桑聯盟"
680401 "萬美玲/女/中國國民黨"
680402 "范綱祥/男/民主進步黨"
680481 "甘乃迪/男/台灣國民黨"
680484 "黃明莉/女/無"
680501 "呂玉玲/女/中國國民黨"
680502 "劉仁照/男/民主進步黨"
680541 "賴香伶/女/台灣民眾黨"
680577 "易乃文/男/司法改革黨"
680601 "邱若華/女/中國國民黨"
680641 "李慕妍/女/台灣民眾黨"
680673 "翁紹庭/女/人民最大黨"
680680 "劉睿宸/男/復康聯盟黨"
680684 "葉堂宇/男/無"
680685 "趙正宇/男/無"
660102 "蔡其昌/男/民主進步黨"
660141 "蔡壁如/女/台灣民眾黨"
660184 "賴信全/男/無"
660185 "劉燈鐘/男/無"
660201 "顏寬恆/男/中國國民黨"
660202 "林靜儀/女/民主進步黨"
660261 "洪麗華/女/司法正義黨"
660284 "紀銘修/男/無"
660301 "楊瓊瓔/女/中國國民黨"
660302 "謝子涵/女/民主進步黨"
660377 "張炯春/男/司法改革黨"
660401 "廖偉翔/男/中國國民黨"
660402 "張廖萬堅/男/民主進步黨"
660471 "李海碩/男/台灣雙語無法黨"
660472 "林中翊/男/台灣雙語無法黨"
660485 "陳志彬/男/無"
660501 "黃健豪/男/中國國民黨"
660502 "莊競程/男/民主進步黨"
660525 "林澤培/女/中華統一促進黨"
660571 "謝旻汎/男/台灣雙語無法黨"
660577 "彭振芳/男/司法改革黨"
660579 "蔡善雯/女/小民參政歐巴桑聯盟"
660584 "苗豐隆/男/無"
660585 "陳維新/女/無"
660601 "羅廷瑋/男/中國國民黨"
660602 "江肇國/男/民主進步黨"
660625 "黃千庭/女/中華統一促進黨"
660684 "賀姿華/女/無"
660685 "紀文清/男/無"
660701 "林家興/男/中國國民黨"
660702 "何欣純/女/民主進步黨"
660777 "林振東/男/司法改革黨"
660801 "江啟臣/男/中國國民黨"
660802 "謝志忠/男/民主進步黨"
670101 "周宏昌/男/中國國民黨"
670102 "賴惠員/女/民主進步黨"
670125 "林芳竹/女/中華統一促進黨"
670180 "蔡承攸/男/復康聯盟黨"
670184 "侯陸太/男/無"
670185 "魏耀乾/男/無"
670202 "郭國文/男/民主進步黨"
670273 "詹秋嫻/女/人民最大黨"
670284 "陳昆和/男/無"
670301 "姚正玉/女/中國國民黨"
670302 "陳亭妃/女/民主進步黨"
670402 "林宜瑾/女/民主進步黨"
670477 "劉清田/男/司法改革黨"
670484 "李全教/男/無"
670502 "林俊憲/男/民主進步黨"
670572 "蕭燐洪/男/台灣雙語無法黨"
670601 "陳以信/男/中國國民黨"
670602 "王定宇/男/民主進步黨"
670684 "陳永和/男/無"
640102 "邱議瑩/女/民主進步黨"
640141 "曾尹儷/女/台灣民眾黨"
640173 "劉承智/男/人民最大黨"
640184 "林義迪/男/無"
640201 "曹桓榮/男/中國國民黨"
640202 "邱志偉/男/民主進步黨"
640301 "李眉蓁/女/中國國民黨"
640302 "李柏毅/男/民主進步黨"
640376 "郭璽/男/台灣麻將最大黨"
640384 "張正達/男/無"
640385 "陳銓霖/男/無"
640401 "陳若翠/女/中國國民黨"
640402 "林岱樺/女/民主進步黨"
640501 "黃柏霖/男/中國國民黨"
640502 "李昆澤/男/民主進步黨"
640579 "張芳愉/女/小民參政歐巴桑聯盟"
640584 "楊椒喬/男/無"
640601 "陳美雅/女/中國國民黨"
640602 "黃捷/女/民主進步黨"
640644 "郭倍宏/男/喜樂島聯盟"
640701 "鍾易仲/男/中國國民黨"
640702 "許智傑/男/民主進步黨"
640777 "王和平統一/男/司法改革黨"
640784 "洪啟修/男/無"
640801 "李明璇/女/中國國民黨"
640802 "賴瑞隆/男/民主進步黨"
640813 "湛秀英/女/勞動黨"
640877 "李政憲/男/司法改革黨"
040101 "徐欣瑩/女/中國國民黨"
040102 "詹紀緹/女/民主進步黨"
040109 "余筱菁/女/台灣綠黨"
040142 "劉復嵐/男/台灣維新"
040179 "劉台穠/女/小民參政歐巴桑聯盟"
040201 "林思銘/男/中國國民黨"
040202 "曾聖凱/男/民主進步黨"
040219 "王婉諭/女/時代力量"
050102 "康世明/男/民主進步黨"
050184 "陳超明/男/無"
050201 "邱鎮軍/男/中國國民黨"
050284 "曾玟學/男/無"
070101 "阮厚爵/男/中國國民黨"
070102 "陳秀寶/女/民主進步黨"
070184 "蘇群傑/男/無"
070201 "楊曜聰/男/中國國民黨"
070202 "黃秀芳/女/民主進步黨"
070301 "謝衣鳳/女/中國國民黨"
070302 "吳音寧/女/民主進步黨"
070325 "桂麗娜/女/中華統一促進黨"
070384 "洪建興/男/無"
070401 "鄭俊雄/男/中國國民黨"
070402 "陳素月/女/民主進步黨"
070471 "鄭錫懋/男/台灣雙語無法黨"
070482 "蔡念諶/男/中華文化共和黨"
080101 "馬文君/女/中國國民黨"
080102 "蔡銘軒/男/民主進步黨"
080113 "許文忠/男/勞動黨"
080179 "李圓恩/女/小民參政歐巴桑聯盟"
080184 "林金潭/男/無"
080201 "游顥/男/中國國民黨"
080202 "蔡培慧/女/民主進步黨"
080284 "陳癸佑/男/無"
090101 "丁學忠/男/中國國民黨"
090102 "蘇治芬/女/民主進步黨"
090125 "郭炳宏/男/中華統一促進黨"
090170 "李昭儀/女/台灣革命黨"
090184 "吳炳輝/男/無"
090185 "陳俊龍/男/無"
090201 "邱良閱/男/中國國民黨"
090202 "劉建國/男/民主進步黨"
100101 "詹琬蓁/女/中國國民黨"
100102 "蔡易餘/男/民主進步黨"
100202 "陳冠廷/男/民主進步黨"
100242 "黃一哲/男/台灣維新"
100275 "簡銘傑/男/制度救世島"
100284 "林國慶/男/無"
100285 "廖昱婧/女/無"
130101 "黃明賢/男/中國國民黨"
130102 "鍾佳濱/男/民主進步黨"
130125 "李孟翰/男/中華統一促進黨"
130142 "張庭源/男/台灣維新"
130184 "蔣月惠/女/無"
130185 "曾鈺庭/男/無"
130202 "徐富癸/男/民主進步黨"
130256 "吳媚宮/女/中華聯合黨"
130273 "何秋葺/女/人民最大黨"
130284 "蘇孟淳/男/無"
020101 "黃琤婷/女/中國國民黨"
020102 "陳俊宇/男/民主進步黨"
020117 "林意評/男/台灣基進"
020141 "陳琬惠/女/台灣民眾黨"
020175 "邱介勳/男/制度救世島"
020184 "林錦坤/男/無"
150101 "傅崑萁/男/中國國民黨"
150102 "張美慧/女/民主進步黨"
150175 "周玉梅/女/制度救世島"
150184 "許願神/男/無"
140101 "黃建賓/男/中國國民黨"
140102 "賴坤成/男/民主進步黨"
140179 "黃婉茹/女/小民參政歐巴桑聯盟"
140184 "許瑞貴/男/無"
140185 "劉櫂豪/男/無"
140186 "陳長宏/男/無"
160101 "吳政杰/男/中國國民黨"
160102 "楊曜/男/民主進步黨"
160184 "陳慧娟/女/無"
280101 "陳玉珍/女/中國國民黨"
280141 "尚文凱/女/台灣民眾黨"
280184 "洪和成/男/無"
290101 "陳雪生/男/中國國民黨"
290102 "李問/男/民主進步黨"
290141 "曹爾凱/男/台灣民眾黨"
170101 "林沛祥/男/中國國民黨"
170102 "鄭文婷/女/民主進步黨"
170179 "謝海菁/女/小民參政歐巴桑聯盟"
170181 "邱紹祐/男/家庭基本收入"
170183 "黃傑陽/男/無"
170185 "王醒之/男/無"
180101 "鄭正鈐/男/中國國民黨"
180102 "林志潔/女/民主進步黨"
180119 "邱顯智/男/時代力量"
180175 "趙福龍/男/制度救世島"
180177 "楊清華/男/司法改革黨"
180184 "柯美蘭/女/無"
180185 "王榮德/男/無"
200101 "張秀華/女/中國國民黨"
200102 "王美惠/女/民主進步黨"
200171 "林智勳/男/台灣雙語無法黨"
200179 "陳玥妗/女/小民參政歐巴桑聯盟"
200180 "蔡松益/男/復康聯盟黨"
200184 "簡明廉/男/無"
690101 "黃仁/男/中國國民黨"
690102 "鄭天財 Sra-Kacaw/男/中國國民黨"
690103 "陳瑩/女/民主進步黨"
690104 "米甘幹-理佛克/男/新黨"
690107 "陳國榮/男/台灣維新"
690109 "陳政宗/男/無"
690110 "忠仁-達祿斯/男/無"
690111 "高美珠/女/無"
690112 "吳建智咖啡哥/男/無"
700101 "孔文吉/男/中國國民黨"
700102 "盧縣一/男/中國國民黨"
700103 "伍麗華 Saidhai-Tahovecahe/女/民主進步黨"
700106 "胡黃廣文/男/台灣民眾黨"
700108 "高畹芯/女/司法改革黨"
700109 "張子孝/男/無"
700110 "高金素梅/女/無"
700111 "林果/女/無"
700112 "林世偉/男/無"
700113 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
999995 "拒答"
999996 "看情形"
999998 "不知道" .

fre cand_elected.
fre cand.

*w權值*.
var lab W1 "第一波權值".
var lab W2 "第二波權值".
var lab W3 "第三波權值".
var lab W  "合併檔權值".




*加權.
SAVE TRANSLATE OUTFILE=='D:\加權程式\w.csv'
  /TYPE=XLS /VERSION=8 /MAP /REPLACE /FIELDNAMES
  /CELLS=VALUES
  /keep=sex age edu arear .

NPAR TEST/CHI SEX(1,2)/EXP=9417691,9837551
NPAR TEST/CHI AGE(1,5)/EXP=2913399,3239128,3814862,3525054,5762799
NPAR TEST/CHI EDU(1,5)/EXP=2113303,2204427,5294759,2211276,7431477
NPAR TEST/CHI AREAR(1,7)/EXP=3979193,1761995,3109581,3740402,2763230,3075855,824986.


WEIGHT BY W1.
WEIGHT BY W2.
WEIGHT BY W3.
fre all.



fre all.
