* Encoding: Big5.
DATA LIST FILE="C:\Users\Stella\Dropbox\PC\Desktop\EX24971P\EX24971P\DAT\EX24971P.DAT " /
ID 1-6 PNAME 7-16(A) PTEL_A 17-21 PTEL 22-29  PTEL_NAME 30-35(A) 
PDATE 36-41 PBTIME 42-47 PETIME 48-53 PRESULT 54-56
PCALLER 57-66 PGENDER 67 PLEVEL 68-69 PHOURS 70-76 PVERSION 77-78
PHOME_A 79-80 PHOME_M 81-82 PHOME_O 83-84 PSAMPLE 85
PDATE_1 86-91 PBTIME_1 92-97 PETIME_1 98-103 PRESULT_1 104-106
PDATE_2 107-112 PBTIME_2 113-118 PETIME_2 119-124 PRESULT_2 125-127
PDATE_3 128-133 PBTIME_3 134-139 PETIME_3 140-145 PRESULT_3 146-148
PDATE_4 149-154 PBTIME_4 155-160 PETIME_4 161-166 PRESULT_4 167-169
PDATE_5 170-175 PBTIME_5 176-181 PETIME_5 182-187 PRESULT_5 188-190
PDATE_6 191-196 PBTIME_6 197-202 PETIME_6 203-208 PRESULT_6 209-211
PDATE_7 212-217 PBTIME_7 218-223 PETIME_7 224-229 PRESULT_7 230-232
PQ1 250-251 PQ2 252-253 PQ3 254-255 PQ4 256-257 PQ5 258-259 PQ6 260-261
PQ7 262-263 PQ8 264-265 PQ9 266-267 PQ10 268-269 PQ11 270-271 PQ12 272-273
PQ13 274-275 PQ14 276-277 PQ15 278-279 PQ16 280-281 PQ17 282-283 PQ18 284-285
PQ19 286-287 PQ20 288-289 PQ21 290-291 PQ22 292-293 PQ23 294-295 PQ24 296-297
PQ25 298-299 PQ26 300-301 PQ27 302-303 PQ28 304-305 PQ29 306-307 PQ30 308-309
PQ31 310-311 PQ32 312-313 PQ33 314-315 PQ34 316-317 PQ35 318-319 PQ36 320-321
PQ37 322-323 PQ38 324-325 PQ39 326-327 PQ40 328-329 PQ41 330-331 PQ42 332-333
PQ43 334-335 PQ44 336-337 PQ45 338-339 PQ46 340-341 PQ47 342-343 PQ48 344-345
PQ49 346-347 PQ50 348-349 PQ51 350-351 PQ52 352-353 PQ53 354-355 PQ54 356-357
PQ55 358-359 PQ56 360-361 PQ57 362-363 PQ58 364-365 PQ59 366-367 PQ60 368-369
PQ61 370-371 PQ62 372-373 PQ63 374-375 PQ64 376-377 PQ65 378-379 PQ66 380-381
PQ67 382-383 PQ68 384-385 PQ69 386-387 PQ70 388-389 PQ71 390-391 PQ72 392-393
PQ73 394-395 PQ74 396-397 PQ75 398-399 PQ76 400-401 PQ77 402-403 PQ78 404-405
PQ79 406-407 PQ80 408-409 PQ81 410-411 PQ82 412-413 PQ83 414-415 PQ84 416-417
PQ85 418-419 PQ86 420-421 PQ87 422-423 PQ88 424-425 PQ89 426-427 PQ90 428-429
PQ91 430-431 PQ92 432-433 PQ93 434-435 PQ94 436-437 PQ95 438-439 PQ96 440-441
PQ97 442-443 PQ98 444-445 PQ99 446-447 PQ100 448-449 PQ101 450-451 PQ102 452-453
PQ103 454-455 PQ104 456-457 PQ105 458-459 PQ106 460-461 PQ107 462-463 PQ108 464-465
PQ109 466-467 PQ110 468-469 PQ111 470-471 PQ112 472-473 PQ113 474-475 PQ114 476-477
PQ115 478-479 PQ116 480-481 PQ117 482-483 PQ118 484-485 PQ119 486-487 PQ120 488-489
PQ121 490-491 PQ122 492-493 PQ123 494-495 PQ124 496-497 PQ125 498-499 PQ126 500-501
PQ127 502-503 PQ128 504-505 PQ129 506-507 PQ130 508-509 PQ131 510-511 PQ132 512-513
PQ133 514-515 PQ134 516-517 PQ135 518-519 PQ136 520-521 PQ137 522-523 PQ138 524-525
PQ139 526-527 PQ140 528-529 PQ141 530-531 PQ142 532-533 PQ143 534-535 PQ144 536-537
PQ145 538-539 PQ146 540-541 PQ147 542-543 PQ148 544-545 PQ149 546-547 PQ150 548-549
PQ151 550-551 PQ152 552-553 PQ153 554-555 PQ154 556-557 PQ155 558-559 PQ156 560-561
PQ157 562-563 PQ158 564-565 PQ159 566-567 PQ160 568-569 PQ161 570-571 PQ162 572-573
PQ163 574-575 PQ164 576-577 PQ165 578-579 PQ166 580-581 PQ167 582-583 PQ168 584-585
PQ169 586-587 PQ170 588-589 PQ171 590-591 PQ172 592-593 PQ173 594-595 PQ174 596-597
PQ175 598-599 PQ176 600-601 PQ177 602-603 PQ178 604-605 PQ179 606-607 PQ180 608-609
PQ181 610-611 PQ182 612-613 PQ183 614-615 PQ184 616-617 PQ185 618-619 PQ186 620-621
PQ187 622-623 PQ188 624-625 PQ189 626-627 PQ190 628-629 PQ191 630-631 PQ192 632-633
PQ193 634-635 PQ194 636-637 PQ195 638-639 PQ196 640-641 PQ197 642-643 PQ198 644-645
PQ199 646-647 PQ200 648-649 PQ201 650-651 PQ202 652-653 PQ203 654-655 PQ204 656-657
PQ205 658-659 PQ206 660-661 PQ207 662-663 PQ208 664-665 PQ209 666-667 PQ210 668-669
PQ211 670-671 PQ212 672-673 PQ213 674-675 PQ214 676-677 PQ215 678-679 PQ216 680-681
PQ217 682-683 PQ218 684-685 PQ219 686-687 PQ220 688-689 PQ221 690-691 PQ222 692-693
PQ223 694-695 PQ224 696-697 PQ225 698-699 PQ226 700-701 PQ227 702-703 PQ228 704-705
PQ229 706-707 PQ230 708-709 PQ231 710-711 PQ232 712-713 PQ233 714-715 PQ234 716-717
PQ235 718-719 PQ236 720-721 PQ237 722-723 PQ238 724-725 PQ239 726-727 PQ240 728-729
PQ241 730-731 PQ242 732-733 PQ243 734-735 PQ244 736-737 PQ245 738-739 PQ246 740-741
PQ247 742-743 PQ248 744-745 PQ249 746-747 PQ250 748-749 PQ251 750-751 PQ252 752-753
PQ253 754-755 PQ254 756-757 PQ255 758-759 PQ256 760-761 PQ257 762-763 PQ258 764-765
PQ259 766-767 PQ260 768-769 PQ261 770-771 PQ262 772-773 PQ263 774-775 PQ264 776-777
PQ265 778-779 PQ266 780-781 PQ267 782-783 PQ268 784-785 PQ269 786-787    .
 
VARIABLE LABELS
ID "樣本編號"
PNAME "受訪者姓名"
PTEL_A "電話區碼"
PTEL "電話號碼"
PTEL_NAME "電話套數"
PDATE "訪問日期"
PBTIME "開始時間"
PETIME "結束時間"
PRESULT "訪問結果"
PCALLER "訪員編號"
PGENDER "訪員性別"
PLEVEL  "訪員級數"
PHOURS  "累計時數"
PVERSION "版本"
PHOME_A "戶中全部合格人數"
PHOME_M "戶中合格男性人數"
PHOME_O "戶中排行"
PSAMPLE "受訪樣本"
PDATE_1 "訪問日期_1"
PBTIME_1 "開始時間_1"
PETIME_1 "結束時間_1"
PRESULT_1 "訪問結果_1"
PDATE_2 "訪問日期_2"
PBTIME_2 "開始時間_2"
PETIME_2 "結束時間_2"
PRESULT_2 "訪問結果_2"
PDATE_3 "訪問日期_3"
PBTIME_3 "開始時間_3"
PETIME_3 "結束時間_3"
PRESULT_3 "訪問結果_3"
PDATE_4 "訪問日期_4"
PBTIME_4 "開始時間_4"
PETIME_4 "結束時間_4"
PRESULT_4 "訪問結果_4"
PDATE_5 "訪問日期_5"
PBTIME_5 "開始時間_5"
PETIME_5 "結束時間_5"
PRESULT_5 "訪問結果_5"
PDATE_6 "訪問日期_6"
PBTIME_6 "開始時間_6"
PETIME_6 "結束時間_6"
PRESULT_6 "訪問結果_6"
PDATE_7 "訪問日期_7"
PBTIME_7 "開始時間_7"
PETIME_7 "結束時間_7"
PRESULT_7 "訪問結果_7"
PQ1 "受訪者選區＿＿＿(訪員自填)"
PQ2 "宜蘭縣"
PQ3 "新竹縣"
PQ4 "苗栗縣"
PQ5 "彰化縣"
PQ6 "南投縣"
PQ7 "雲林縣"
PQ8 "嘉義縣"
PQ9 "屏東縣"
PQ10 "臺東縣"
PQ11 "花蓮縣"
PQ12 "澎湖縣"
PQ13 "基隆市"
PQ14 "新竹市"
PQ15 "嘉義市"
PQ16 "臺北市"
PQ17 "高雄市"
PQ18 "新北市"
PQ19 "臺中市"
PQ20 "臺南市"
PQ21 "桃園市"
PQ22 "金門縣"
PQ23 "連江縣"
PQ24 "平地原住民"
PQ25 "山地原住民"
PQ26 "在您選區的立委候選人當中，您是把票投給誰?(宜蘭縣)"
PQ27 "請問您，這位候選人是不是您原先最想投的人?(宜蘭縣)"
PQ28 "那您原先想投給誰?(宜蘭縣)"
PQ29 "在您選區的立委候選人當中，您是把票投給誰?(新竹縣第1選區)"
PQ30 "請問您，這位候選人是不是您原先最想投的人?(新竹縣第1選區)"
PQ31 "那您原先想投給誰?(新竹縣第1選區)"
PQ32 "在您選區的立委候選人當中，您是把票投給誰?(新竹縣第2選區)"
PQ33 "請問您，這位候選人是不是您原先最想投的人?(新竹縣第2選區)"
PQ34 "那您原先想投給誰?(新竹縣第2選區)"
PQ35 "在您選區的立委候選人當中，您是把票投給誰?(苗栗縣第1選區)"
PQ36 "請問您，這位候選人是不是您原先最想投的人?(苗栗縣第1選區)"
PQ37 "那您原先想投給誰?(苗栗縣第1選區)"
PQ38 "在您選區的立委候選人當中，您是把票投給誰?(苗栗縣第2選區)"
PQ39 "請問您，這位候選人是不是您原先最想投的人?(苗栗縣第2選區)"
PQ40 "那您原先想投給誰?(苗栗縣第2選區)"
PQ41 "在您選區的立委候選人當中，您是把票投給誰?(彰化縣第1選區)"
PQ42 "請問您，這位候選人是不是您原先最想投的人?(彰化縣第1選區)"
PQ43 "那您原先想投給誰?(彰化縣第1選區)"
PQ44 "在您選區的立委候選人當中，您是把票投給誰?(彰化縣第2選區)"
PQ45 "請問您，這位候選人是不是您原先最想投的人?(彰化縣第2選區)"
PQ46 "那您原先想投給誰?(彰化縣第2選區)"
PQ47 "在您選區的立委候選人當中，您是把票投給誰?(彰化縣第3選區)"
PQ48 "請問您，這位候選人是不是您原先最想投的人?(彰化縣第3選區)"
PQ49 "那您原先想投給誰?(彰化縣第3選區)"
PQ50 "在您選區的立委候選人當中，您是把票投給誰?(彰化縣第4選區)"
PQ51 "請問您，這位候選人是不是您原先最想投的人?(彰化縣第4選區)"
PQ52 "那您原先想投給誰?(彰化縣第4選區)"
PQ53 "在您選區的立委候選人當中，您是把票投給誰?(南投縣第1選區)"
PQ54 "請問您，這位候選人是不是您原先最想投的人?(南投縣第1選區)"
PQ55 "那您原先想投給誰?(南投縣第1選區)"
PQ56 "在您選區的立委候選人當中，您是把票投給誰?(南投縣第2選區)"
PQ57 "請問您，這位候選人是不是您原先最想投的人?(南投縣第2選區)"
PQ58 "那您原先想投給誰?(南投縣第2選區)"
PQ59 "在您選區的立委候選人當中，您是把票投給誰?(雲林縣第1選區)"
PQ60 "請問您，這位候選人是不是您原先最想投的人?(雲林縣第1選區)"
PQ61 "那您原先想投給誰?(雲林縣第1選區)"
PQ62 "在您選區的立委候選人當中，您是把票投給誰?(雲林縣第2選區)"
PQ63 "請問您，這位候選人是不是您原先最想投的人?(雲林縣第2選區)"
PQ64 "那您原先想投給誰?(雲林縣第2選區)"
PQ65 "在您選區的立委候選人當中，您是把票投給誰?(嘉義縣第1選區)"
PQ66 "請問您，這位候選人是不是您原先最想投的人?(嘉義縣第1選區)"
PQ67 "那您原先想投給誰?(嘉義縣第1選區)"
PQ68 "在您選區的立委候選人當中，您是把票投給誰?(嘉義縣第2選區)"
PQ69 "請問您，這位候選人是不是您原先最想投的人?(嘉義縣第2選區)"
PQ70 "那您原先想投給誰?(嘉義縣第2選區)"
PQ71 "在您選區的立委候選人當中，您是把票投給誰?(屏東縣第1選區)"
PQ72 "請問您，這位候選人是不是您原先最想投的人?(屏東縣第1選區)"
PQ73 "那您原先想投給誰?(屏東縣第1選區)"
PQ74 "在您選區的立委候選人當中，您是把票投給誰?(屏東縣第2選區)"
PQ75 "請問您，這位候選人是不是您原先最想投的人?(屏東縣第2選區)"
PQ76 "那您原先想投給誰?(屏東縣第2選區)"
PQ77 "在您選區的立委候選人當中，您是把票投給誰?(臺東縣)"
PQ78 "請問您，這位候選人是不是您原先最想投的人?(臺東縣)"
PQ79 "那您原先想投給誰?(臺東縣)"
PQ80 "在您選區的立委候選人當中，您是把票投給誰?(花蓮縣)"
PQ81 "請問您，這位候選人是不是您原先最想投的人?(花蓮縣)"
PQ82 "那您原先想投給誰?(花蓮縣)"
PQ83 "在您選區的立委候選人當中，您是把票投給誰?(澎湖縣)"
PQ84 "請問您，這位候選人是不是您原先最想投的人?(澎湖縣)"
PQ85 "那您原先想投給誰?(澎湖縣)"
PQ86 "在您選區的立委候選人當中，您是把票投給誰?(基隆市)"
PQ87 "請問您，這位候選人是不是您原先最想投的人?(基隆市)"
PQ88 "那您原先想投給誰?(基隆市)"
PQ89 "在您選區的立委候選人當中，您是把票投給誰?(新竹市)"
PQ90 "請問您，這位候選人是不是您原先最想投的人?(新竹市)"
PQ91 "那您原先想投給誰?(新竹市)"
PQ92 "在您選區的立委候選人當中，您是把票投給誰?(嘉義市)"
PQ93 "請問您，這位候選人是不是您原先最想投的人?(嘉義市)"
PQ94 "那您原先想投給誰?(嘉義市)"
PQ95 "在您選區的立委候選人當中，您是把票投給誰?(金門縣)"
PQ96 "請問您，這位候選人是不是您原先最想投的人?(金門縣)"
PQ97 "那您原先想投給誰?(金門縣)"
PQ98 "在您選區的立委候選人當中，您是把票投給誰?(連江縣)"
PQ99 "請問您，這位候選人是不是您原先最想投的人?(連江縣)"
PQ100 "那您原先想投給誰?(連江縣)"
PQ101 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第1選區)"
PQ102 "請問您，這位候選人是不是您原先最想投的人?(臺北市第1選區)"
PQ103 "那您原先想投給誰?(臺北市第1選區)"
PQ104 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第2選區)"
PQ105 "請問您，這位候選人是不是您原先最想投的人?(臺北市第2選區)"
PQ106 "那您原先想投給誰?(臺北市第2選區)"
PQ107 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第3選區)"
PQ108 "請問您，這位候選人是不是您原先最想投的人?(臺北市第3選區)"
PQ109 "那您原先想投給誰?(臺北市第3選區)"
PQ110 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第4選區)"
PQ111 "請問您，這位候選人是不是您原先最想投的人?(臺北市第4選區)"
PQ112 "那您原先想投給誰?(臺北市第4選區)"
PQ113 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第5選區)"
PQ114 "請問您，這位候選人是不是您原先最想投的人?(臺北市第5選區)"
PQ115 "那您原先想投給誰?(臺北市第5選區)"
PQ116 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第6選區)"
PQ117 "請問您，這位候選人是不是您原先最想投的人?(臺北市第6選區)"
PQ118 "那您原先想投給誰?(臺北市第6選區)"
PQ119 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第7選區)"
PQ120 "請問您，這位候選人是不是您原先最想投的人?(臺北市第7選區)"
PQ121 "那您原先想投給誰?(臺北市第7選區)"
PQ122 "在您選區的立委候選人當中，您是把票投給誰?(臺北市第8選區)"
PQ123 "請問您，這位候選人是不是您原先最想投的人?(臺北市第8選區)"
PQ124 "那您原先想投給誰?(臺北市第8選區)"
PQ125 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第1選區)"
PQ126 "請問您，這位候選人是不是您原先最想投的人?(高雄市第1選區)"
PQ127 "那您原先想投給誰?(高雄市第1選區)"
PQ128 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第2選區)"
PQ129 "請問您，這位候選人是不是您原先最想投的人?(高雄市第2選區)"
PQ130 "那您原先想投給誰?(高雄市第2選區)"
PQ131 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第3選區)"
PQ132 "請問您，這位候選人是不是您原先最想投的人?(高雄市第3選區)"
PQ133 "那您原先想投給誰?(高雄市第3選區)"
PQ134 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第4選區)"
PQ135 "請問您，這位候選人是不是您原先最想投的人?(高雄市第4選區)"
PQ136 "那您原先想投給誰?(高雄市第4選區)"
PQ137 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第5選區)"
PQ138 "請問您，這位候選人是不是您原先最想投的人?(高雄市第5選區)"
PQ139 "那您原先想投給誰?(高雄市第5選區)"
PQ140 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第6選區)"
PQ141 "請問您，這位候選人是不是您原先最想投的人?(高雄市第6選區)"
PQ142 "那您原先想投給誰?(高雄市第6選區)"
PQ143 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第7選區)"
PQ144 "請問您，這位候選人是不是您原先最想投的人?(高雄市第8選區)"
PQ145 "那您原先想投給誰?(高雄市第7選區)"
PQ146 "在您選區的立委候選人當中，您是把票投給誰?(高雄市第8選區)"
PQ147 "請問您，這位候選人是不是您原先最想投的人?(高雄市第8選區)"
PQ148 "那您原先想投給誰?(高雄市第8選區)"
PQ149 "在您選區的立委候選人當中，您是把票投給誰?(新北市第1選區)"
PQ150 "請問您，這位候選人是不是您原先最想投的人?(新北市第1選區)"
PQ151 "那您原先想投給誰?(新北市第1選區)"
PQ152 "在您選區的立委候選人當中，您是把票投給誰?(新北市第2選區)"
PQ153 "請問您，這位候選人是不是您原先最想投的人?(新北市第2選區)"
PQ154 "那您原先想投給誰?(新北市第2選區)"
PQ155 "在您選區的立委候選人當中，您是把票投給誰?(新北市第3選區)"
PQ156 "請問您，這位候選人是不是您原先最想投的人?(新北市第3選區)"
PQ157 "那您原先想投給誰?(新北市第3選區)"
PQ158 "在您選區的立委候選人當中，您是把票投給誰?(新北市第4選區)"
PQ159 "請問您，這位候選人是不是您原先最想投的人?(新北市第4選區)"
PQ160 "那您原先想投給誰?(新北市第4選區)"
PQ161 "在您選區的立委候選人當中，您是把票投給誰?(新北市第5選區)"
PQ162 "請問您，這位候選人是不是您原先最想投的人?(新北市第5選區)"
PQ163 "那您原先想投給誰?(新北市第5選區)"
PQ164 "在您選區的立委候選人當中，您是把票投給誰?(新北市第6選區)"
PQ165 "請問您，這位候選人是不是您原先最想投的人?(新北市第6選區)"
PQ166 "那您原先想投給誰?(新北市第6選區)"
PQ167 "在您選區的立委候選人當中，您是把票投給誰?(新北市第7選區)"
PQ168 "請問您，這位候選人是不是您原先最想投的人?(新北市第7選區)"
PQ169 "那您原先想投給誰?(新北市第7選區)"
PQ170 "在您選區的立委候選人當中，您是把票投給誰?(新北市第8選區)"
PQ171 "請問您，這位候選人是不是您原先最想投的人?(新北市第8選區)"
PQ172 "那您原先想投給誰?(新北市第8選區)"
PQ173 "在您選區的立委候選人當中，您是把票投給誰?(新北市第9選區)"
PQ174 "請問您，這位候選人是不是您原先最想投的人?(新北市第9選區)"
PQ175 "那您原先想投給誰?(新北市第9選區)"
PQ176 "在您選區的立委候選人當中，您是把票投給誰?(新北市第10選區)"
PQ177 "請問您，這位候選人是不是您原先最想投的人?(新北市第10選區)"
PQ178 "那您原先想投給誰?(新北市第10選區)"
PQ179 "在您選區的立委候選人當中，您是把票投給誰?(新北市第11選區)"
PQ180 "請問您，這位候選人是不是您原先最想投的人?(新北市第11選區)"
PQ181 "那您原先想投給誰?(新北市第11選區)"
PQ182 "在您選區的立委候選人當中，您是把票投給誰?(新北市第12選區)"
PQ183 "請問您，這位候選人是不是您原先最想投的人?(新北市第12選區)"
PQ184 "那您原先想投給誰?(新北市第12選區)"
PQ185 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第1選區)"
PQ186 "請問您，這位候選人是不是您原先最想投的人?(臺中市第1選區)"
PQ187 "那您原先想投給誰?(臺中市第1選區)"
PQ188 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第2選區)"
PQ189 "請問您，這位候選人是不是您原先最想投的人?(臺中市第2選區)"
PQ190 "那您原先想投給誰?(臺中市第2選區)"
PQ191 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第3選區)"
PQ192 "請問您，這位候選人是不是您原先最想投的人?(臺中市第3選區)"
PQ193 "那您原先想投給誰?(臺中市第3選區)"
PQ194 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第4選區)"
PQ195 "請問您，這位候選人是不是您原先最想投的人?(臺中市第4選區)"
PQ196 "那您原先想投給誰?(臺中市第4選區)"
PQ197 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第5選區)"
PQ198 "請問您，這位候選人是不是您原先最想投的人?(臺中市第5選區)"
PQ199 "那您原先想投給誰?(臺中市第5選區)"
PQ200 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第6選區)"
PQ201 "請問您，這位候選人是不是您原先最想投的人?(臺中市第6選區)"
PQ202 "那您原先想投給誰?(臺中市第6選區)"
PQ203 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第7選區)"
PQ204 "請問您，這位候選人是不是您原先最想投的人?(臺中市第7選區)"
PQ205 "那您原先想投給誰?(臺中市第7選區)"
PQ206 "在您選區的立委候選人當中，您是把票投給誰?(臺中市第8選區)"
PQ207 "請問您，這位候選人是不是您原先最想投的人?(臺中市第8選區)"
PQ208 "那您原先想投給誰?(臺中市第8選區)"
PQ209 "在您選區的立委候選人當中，您是把票投給誰?(臺南市第1選區)"
PQ210 "請問您，這位候選人是不是您原先最想投的人?(臺南市第1選區)"
PQ211 "那您原先想投給誰?(臺南市第1選區)"
PQ212 "在您選區的立委候選人當中，您是把票投給誰?(臺南市第2選區)"
PQ213 "請問您，這位候選人是不是您原先最想投的人?(臺南市第2選區)"
PQ214 "那您原先想投給誰?(臺南市第2選區)"
PQ215 "在您選區的立委候選人當中，您是把票投給誰?(臺南市第3選區)"
PQ216 "請問您，這位候選人是不是您原先最想投的人?(臺南市第3選區)"
PQ217 "那您原先想投給誰?(臺南市第3選區)"
PQ218 "在您選區的立委候選人當中，您是把票投給誰?(臺南市第4選區)"
PQ219 "請問您，這位候選人是不是您原先最想投的人?(臺南市第4選區)"
PQ220 "那您原先想投給誰?(臺南市第4選區)"
PQ221 "在您選區的立委候選人當中，您是把票投給誰?(臺南市第5選區)"
PQ222 "請問您，這位候選人是不是您原先最想投的人?(臺南市第5選區)"
PQ223 "那您原先想投給誰?"
PQ224 "在您選區的立委候選人當中，您是把票投給誰?(臺南市第6選區)"
PQ225 "請問您，這位候選人是不是您原先最想投的人?(臺南市第6選區)"
PQ226 "那您原先想投給誰?"
PQ227 "在您選區的立委候選人當中，您是把票投給誰?(桃園市第1選區)"
PQ228 "請問您，這位候選人是不是您原先最想投的人?(桃園市第1選區)"
PQ229 "那您原先想投給誰?(桃園市第1選區)"
PQ230 "在您選區的立委候選人當中，您是把票投給誰?(桃園市第2選區)"
PQ231 "請問您，這位候選人是不是您原先最想投的人?(桃園市第2選區)"
PQ232 "那您原先想投給誰?(桃園市第2選區)"
PQ233 "在您選區的立委候選人當中，您是把票投給誰?(桃園市第3選區)"
PQ234 "請問您，這位候選人是不是您原先最想投的人?(桃園市第3選區)"
PQ235 "那您原先想投給誰?(桃園市第3選區)"
PQ236 "在您選區的立委候選人當中，您是把票投給誰?(桃園市第4選區)"
PQ237 "請問您，這位候選人是不是您原先最想投的人?(桃園市第4選區)"
PQ238 "那您原先想投給誰?(桃園市第4選區)"
PQ239 "在您選區的立委候選人當中，您是把票投給誰?(桃園市第5選區)"
PQ240 "請問您，這位候選人是不是您原先最想投的人?(桃園市第5選區)"
PQ241 "那您原先想投給誰?(桃園市第5選區)"
PQ242 "在您選區的立委候選人當中，您是把票投給誰?(桃園市第6選區)"
PQ243 "請問您，這位候選人是不是您原先最想投的人?(桃園市第6選區)"
PQ244 "那您原先想投給誰?(桃園市第6選區)"
PQ245 "在您選區的立委候選人當中，您是把票投給誰? (平地原住民)"
PQ246 "請問您，這位候選人是不是您原先最想投的人?(平地原住民)"
PQ247 "那您原先想投給誰?(平地原住民)"
PQ248 "在您選區的立委候選人當中，您是把票投給誰? (山地原住民)"
PQ249 "請問您，這位候選人是不是您原先最想投的人?(山地原住民)"
PQ250 "那您原先想投給誰?(山地原住民)"
PQ251 "那不分區選票，您是把票投給哪一個黨?"
PQ252 "請問您，這個政黨是不是您原先最想投的政黨?"
PQ253 "那您原先想投哪個政黨?"
PQ254 "總統票您是把票投給哪一組候選人?"
PQ255 "請問您，這組候選人是不是您原先最想投的人?"
PQ256 "那您原先想投給哪一組?"
PQ257 "請問，下列兩種說法，您比較同意哪一個?"
PQ258 "請問您覺得臺灣現在的經濟狀況與一年前相比，是比較好、還是比較不好，或是差不多?"
PQ259 "請問您覺得臺灣在未來的一年經濟狀況會變好、還是變不好，或是差不多?"
PQ260 "整體來說，請問您覺得這次選舉的結果，對臺灣的民主政治是有好的影響，還是有不好的影響?"
PQ261 "關於臺灣和大陸的關係，有下面幾種不同的看法："
PQ262 "在目前國內的政黨之中，請問您認為您比較支持哪一個政黨?"
PQ263 "請問您支持(受訪者回答的黨)的程度是非常支持、還是普普通通?"
PQ264 "請問您有沒有比較偏向哪一個政黨?"
PQ265 "我們社會上，有人說自己是「臺灣人」，也有人說自己是「中國人」，也有人說都是。請問您認為自己是「臺灣人」、「中國人」，或者都是?"
PQ266 "請問您是民國哪一年出生的?"
PQ267 "請問您的最高學歷是什麼(讀到什麼學校)?"
PQ268 "性別："
PQ269 "訪問時使用語言："
 .
 
value labels
    PSAMPLE
    1 "正取樣本" 2 "替代樣本"/
    PGENDER
    1 "男" 2 "女"/
    Plevel
    1 "第一級"  2 "第二級"  3 "第三級"  /
    PRESULT 
      000 "訪問成功"
      010 "受訪者暫時不在 或 不便接聽 (非當日約訪者)"
      020 "受訪者因臨時有事而中途拒訪 (非當日約訪者)"
      030 "受訪者暫時不在 或 不便接聽 (可當日約訪者)"
      040 "受訪者因臨時有事而中途拒訪 [可當日約訪者]"
      050 "受訪者拒絕受訪 [無法再訪者]"
      060 "受訪者中途拒訪 [無法再訪者]"
      070 "接電話即拒訪 或 接電話者有事(我很忙)"
      080 "因語言因素無法受訪"
      081 "因語言因素無法受訪(原住民話 )"
      082 "因語言因素無法受訪(客語 )"
      083 "因語言因素無法受訪(方言)"
      090 "因生理或心理因素無法受訪"
      091 "受訪者死亡"
      092 "因其他因素無法受訪"
      100 "無人接聽"
      110 "通話中或電話沒掛好。〔經立即重撥一次後仍忙線〕"
      111 "沒有接觸過"
      112 "以通訊技術封閉電話"
      120 "停話"
      121 "空號"
      122 "被斷線停話"
      123 "移機轉號"
      124 "號中再轉號"
      125 "轉接至另一號"
      126 "電話故障"
      130 "傳真機或其他資料傳輸設備"
      140 "答錄機(住宅)"
      141 "答錄機(非住宅)"
      150 "受訪者訪問期間不在(服役 國外)"
      160 "戶中無合格受訪對象(或 外國人)"
      170 "不在母體定義之內(例如非訪問地區)"
      171 "已訪問過"
      180 "公司或政府機關或社團或機構"
      181 "群居單位(如宿舍)"
      190 "配額已滿"
      201 "問不出該戶是否有合格受訪者"
      202 "其他原因導致不能確定是否有合格受訪者"
/PQ1
      2 "宜蘭縣"      4 "新竹縣"      5 "苗栗縣"    7 "彰化縣"       8 "南投縣"
      9 "雲林縣"      10 "嘉義縣"     13 "屏東縣"   14 "臺東縣"      15 "花蓮縣"
      16 "澎湖縣"     17 "基隆市"     18 "新竹市"   20 "嘉義市"      28 "金門縣"
      29 "連江縣"     63 "臺北市"     64 "高雄市"   65 "新北市"      66 "臺中市"
      67 "臺南市"     68 "桃園市"
      88 "平地原住民" 89 "山地原住民"
/PQ2
      1 "宜蘭縣單一選舉區"   99 "跳題" 
/PQ3
      1 "新竹縣第一選舉區"   2 "新竹縣第二選舉區"   99 "跳題" 
/PQ4
      1 "苗栗縣第一選區"     2 "苗栗縣第二選區"     99 "跳題" 
/PQ5
      1 "彰化縣第一選區"     2 "彰化縣第二選區"     3 "彰化縣第三選區"     4 "彰化縣第四選區"    99 "跳題" 
/PQ6
      1 "南投縣第一選區"     2 "南投縣第二選區"     99 "跳題" 
/PQ7
      1 "雲林縣第一選區"     2 "雲林縣第二選區"     99 "跳題" 
/PQ8
      1 "嘉義縣第一選區"     2 "嘉義縣第二選區"     99 "跳題" 
/PQ9
      1 "屏東縣第一選區"     2 "屏東縣第二選區"     99 "跳題" 
/PQ10
      1 "臺東縣單一選區"     99 "跳題" 
/PQ11
      1 "花蓮縣單一選區"     99 "跳題" 
/PQ12
      1 "澎湖縣單一選區"     99 "跳題" 
/PQ13
      1 "基隆市單一選區"    99 "跳題" 
/PQ14
      1 "新竹市單一選區"    99 "跳題" 
/PQ15
      1 "嘉義市單一選區"    99 "跳題" 
/PQ16
      1 "臺北市第一選區"     2 "臺北市第二選區"     3 "臺北市第三選區"     4 "臺北市第四選區"   5 "臺北市第五選區"
      6 "臺北市第六選區"     7 "臺北市第七選區"     8 "臺北市第八選區"
      99 "跳題" 
/PQ17
      1 "高雄市第一選區"     2 "高雄市第二選區"     3 "高雄市第三選區"     4 "高雄市第四選區"   5 "高雄市第五選區"
      6 "高雄市第六選區"     7 "高雄市第七選區"     8 "高雄市第八選區"
      99 "跳題" 
/PQ18
      1 "新北市第一選區"     2 "新北市第二選區"     3 "新北市第三選區"     4 "新北市第四選區"   5 "新北市第五選區"
      6 "新北市第六選區"     7 "新北市第七選區"     8 "新北市第八選區"     9 "新北市第九選區"   10 "新北市第十選區"
      11 "新北市第十一選區"  12 "新北市第十二選區"
      99 "跳題" 
/PQ19
      1 "臺中市第一選區"     2 "臺中市第二選區"     3 "臺中市第三選區"     4 "臺中市第四選區"   5 "臺中市第五選區"
      6 "臺中市第六選區"     7 "臺中市第七選區"     8 "臺中市第八選區"
      99 "跳題" 
/PQ20
      1 "臺南市第一選區"     2 "臺南市第二選區"     3 "臺南市第三選區"     4 "臺南市第四選區"   5 "臺南市第五選區"
      6 "臺南市第六選區"
      99 "跳題" 
/PQ21
      1 "桃園市第1選舉區"    2 "桃園市第2選舉區"    3 "桃園市第3選舉區"    4 "桃園市第4選舉區"  5 "桃園市第5選舉區"
      6 "桃園市第6選舉區"
      99 "跳題" 
/PQ22
      1 "金門縣單一選區"     99 "跳題" 
/PQ23
      1 "連江縣單一選區"     99 "跳題" 
/PQ24
      1 "平地原住民選舉區"   99 "跳題" 
/PQ25
      1 "山地原住民選舉區"   99 "跳題" 
/PQ26
      1 "黃琤婷/女/中國國民黨"     2 "陳俊宇/男/民主進步黨"        17 "林意評/男/台灣基進"      41 "陳琬惠/女/台灣民眾黨"
      75 "邱介勳/男/制度救世島"    84 "林錦坤/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ27
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ28
      1 "黃琤婷/女/中國國民黨"     2 "陳俊宇/男/民主進步黨"        17 "林意評/男/台灣基進"      41 "陳琬惠/女/台灣民眾黨"
      75 "邱介勳/男/制度救世島"    84 "林錦坤/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ29
      1 "徐欣瑩/女/中國國民黨"     2 "詹紀緹/女/民主進步黨"        9 "余筱菁/女/台灣綠黨"       42 "劉復嵐/男/台灣維新"
      79 "劉台穠/女/小民參政歐巴桑聯盟"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ30
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ31
      1 "徐欣瑩/女/中國國民黨"     2 "詹紀緹/女/民主進步黨"        9 "余筱菁/女/台灣綠黨"       42 "劉復嵐/男/台灣維新"
      79 "劉台穠/女/小民參政歐巴桑聯盟"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ32
      1 "林思銘/男/中國國民黨"     2 "曾聖凱/男/民主進步黨"        19 "王婉諭/女/時代力量"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ33
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ34
      1 "林思銘/男/中國國民黨"     2 "曾聖凱/男/民主進步黨"        19 "王婉諭/女/時代力量"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ35
      2 "康世明/男/民主進步黨"     84 "陳超明/男/無"               89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ36
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ37
      2 "康世明/男/民主進步黨"     84 "陳超明/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ38
      1 "邱鎮軍/男/中國國民黨"
      84 "曾玟學/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ39
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ40
      1 "邱鎮軍/男/中國國民黨"     84 "曾玟學/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ41
      1 "阮厚爵/男/中國國民黨"     2 "陳秀寶/女/民主進步黨"        84 "蘇群傑/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ42
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ43
      1 "阮厚爵/男/中國國民黨"     2 "陳秀寶/女/民主進步黨"        84 "蘇群傑/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ44
      1 "楊曜聰/男/中國國民黨"     2 "黃秀芳/女/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ45
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ46
      1 "楊曜聰/男/中國國民黨"     2 "黃秀芳/女/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ47
      1 "謝衣鳳/女/中國國民黨"     2 "吳音寧/女/民主進步黨"        25 "桂麗娜/女/中華統一促進黨"
      84 "洪建興/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ48
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ49
      1 "謝衣鳳(中國國民黨)"       2 "洪宗熠(民主進步黨)"          43 "劉銀鬃(台澎黨)"          72 "楊麗香(無黨籍)"
      84 "洪建興/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ50
      1 "鄭俊雄/男/中國國民黨"     2 "陳素月/女/民主進步黨"       71 "鄭錫懋/男/臺灣雙語無法黨" 82 "蔡念諶/男/中華文化共和黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ51
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ52
      1 "鄭俊雄/男/中國國民黨"     2 "陳素月/女/民主進步黨"       71 "鄭錫懋/男/臺灣雙語無法黨" 82 "蔡念諶/男/中華文化共和黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ53
      1 "馬文君/女/中國國民黨"
      2 "蔡銘軒/男/民主進步黨"
      13 "許文忠/男/勞動黨"
      79 "李圓恩/女/小民參政歐巴桑聯盟"
      84 "林金潭/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ54
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ55
      1 "馬文君/女/中國國民黨"     2 "蔡銘軒/男/民主進步黨"        13 "許文忠/男/勞動黨"        79 "李圓恩/女/小民參政歐巴桑聯盟"
      84 "林金潭/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ56
      1 "游顥/男/中國國民黨"       2 "蔡培慧/女/民主進步黨"        84 "陳癸佑/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ57
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ58
      1 "游顥/男/中國國民黨"       2 "蔡培慧/女/民主進步黨"        84 "陳癸佑/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ59
      1 "丁學忠/男/中國國民黨"     2 "蘇治芬/女/民主進步黨"       25 "郭炳宏/男/中華統一促進黨" 70 "李昭儀/女/台灣革命黨"
      84 "吳炳輝/男/無"            85 "陳俊龍/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ60
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ61
      1 "丁學忠/男/中國國民黨"     2 "蘇治芬/女/民主進步黨"       25 "郭炳宏/男/中華統一促進黨" 70 "李昭儀/女/台灣革命黨"
      84 "吳炳輝/男/無"            85 "陳俊龍/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ62
      1 "邱良閱/男/中國國民黨"     2 "劉建國/男/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ63
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ64
      1 "邱良閱/男/中國國民黨"     2 "劉建國/男/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ65
      1 "詹琬蓁/女/中國國民黨"     2 "蔡易餘/男/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ66
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ67
      1 "詹琬蓁/女/中國國民黨"     2 "蔡易餘/男/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ68
      2 "陳冠廷/男/民主進步黨"     42 "黃一哲/男/台灣維新"         75 "簡銘傑/男/制度救世島"    84 "林國慶/男/無"
      85 "廖昱婧/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ69
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ70
      2 "陳冠廷/男/民主進步黨"     42 "黃一哲/男/台灣維新"         75 "簡銘傑/男/制度救世島"    84 "林國慶/男/無"
      85 "廖昱婧/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ71
      1 "黃明賢/男/中國國民黨"     2 "鍾佳濱/男/民主進步黨"       25 "李孟翰/男/中華統一促進黨" 42 "張庭源/男/台灣維新"
      84 "蔣月惠/女/無"            85 "曾鈺庭/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ72
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ73
      1 "黃明賢/男/中國國民黨"     2 "鍾佳濱/男/民主進步黨"       25 "李孟翰/男/中華統一促進黨" 42 "張庭源/男/台灣維新"
      84 "蔣月惠/女/無"            85 "曾鈺庭/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ74
      2 "徐富癸/男/民主進步黨"     56 "吳媚宮/女/中華聯合黨"       73 "何秋葺/女/人民最大黨"    84 "蘇孟淳/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ75
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ76
      2 "徐富癸/男/民主進步黨"     56 "吳媚宮/女/中華聯合黨"       73 "何秋葺/女/人民最大黨"    84 "蘇孟淳/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ77
      1 "黃建賓/男/中國國民黨"     2 "賴坤成/男/民主進步黨"        79 "黃婉茹/女/小民參政歐巴桑聯盟"  84 "許瑞貴/男/無"
      85 "劉櫂豪/男/無"            86 "陳長宏/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ78
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ79
      1 "黃建賓/男/中國國民黨"     2 "賴坤成/男/民主進步黨"        79 "黃婉茹/女/小民參政歐巴桑聯盟"   84 "許瑞貴/男/無"
      85 "劉櫂豪/男/無"            86 "陳長宏/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ80
      1 "傅崑萁/男/中國國民黨"     2 "張美慧/女/民主進步黨"        75 "周玉梅/女/制度救世島"    84 "許願神/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ81
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ82
      1 "傅崑萁/男/中國國民黨"     2 "張美慧/女/民主進步黨"        75 "周玉梅/女/制度救世島"    84 "許願神/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ83
      1 "吳政杰/男/中國國民黨"     2 "楊曜/男/民主進步黨"          84 "陳慧娟/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ84
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ85
      1 "吳政杰/男/中國國民黨"     2 "楊曜/男/民主進步黨"          84 "陳慧娟/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ86
      1 "林沛祥/男/中國國民黨"     2 "鄭文婷/女/民主進步黨"        79 "謝海菁/女/小民參政歐巴桑聯盟"  81 "邱紹祐/男/家庭基本收入"
      83 "黃傑陽/男/無"            85 "王醒之/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ87
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ88
      1 "林沛祥/男/中國國民黨"     2 "鄭文婷/女/民主進步黨"        79 "謝海菁/女/小民參政歐巴桑聯盟"   81 "邱紹祐/男/家庭基本收入"
      83 "黃傑陽/男/無"            85 "王醒之/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ89
      1 "鄭正鈐/男/中國國民黨"     2 "林志潔/女/民主進步黨"        19 "邱顯智/男/時代力量"      75 "趙福龍/男/制度救世島"
      77 "楊清華/男/司法改革黨"
      84 "柯美蘭/女/無"            85 "王榮德/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ90
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ91
      1 "鄭正鈐/男/中國國民黨"     2 "林志潔/女/民主進步黨"        19 "邱顯智/男/時代力量"      75 "趙福龍/男/制度救世島"
      77 "楊清華/男/司法改革黨"
      84 "柯美蘭/女/無"            85 "王榮德/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ92
      1 "張秀華/女/中國國民黨"     2 "王美惠/女/民主進步黨"        71 "林智勳/男/臺灣雙語無法黨"   79 "陳玥妗/女/小民參政歐巴桑聯盟"
      80 "蔡松益/男/復康聯盟黨"    84 "簡明廉/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ93
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ94
      1 "張秀華/女/中國國民黨"     2 "王美惠/女/民主進步黨"        71 "林智勳/男/臺灣雙語無法黨"    79 "陳玥妗/女/小民參政歐巴桑聯盟"
      80 "蔡松益/男/復康聯盟黨"    84 "簡明廉/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ95
      1 "陳玉珍/女/中國國民黨"     41 "尚文凱/女/台灣民眾黨"       84 "洪和成/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ96
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ97
      1 "陳玉珍/女/中國國民黨"     41 "尚文凱/女/台灣民眾黨"       84 "洪和成/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ98
      1 "陳雪生/男/中國國民黨"     2 "李問/男/民主進步黨"          41 "曹爾凱/男/台灣民眾黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ99
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ100
      1 "陳雪生/男/中國國民黨"     2 "李問/男/民主進步黨"          41 "曹爾凱/男/台灣民眾黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ101
      1 "張斯綱/男/中國國民黨"     2 "吳思瑤/女/民主進步黨"        48 "賴宗育/男/人民民主黨"    71 "陳執中/男/臺灣雙語無法黨"
      73 "張臺勝/男/人民最大黨"    74 "胡金城/男/人民最大黨"       84 "許盛鋒/男/無"            85 "侯漢廷/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ102
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ103
      1 "張斯綱/男/中國國民黨"     2 "吳思瑤/女/民主進步黨"        48 "賴宗育/男/人民民主黨"    71 "陳執中/男/臺灣雙語無法黨"
      73 "張臺勝/男/人民最大黨"    74 "胡金城/男/人民最大黨"       84 "許盛鋒/男/無"            85 "侯漢廷/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ104
      1 "游淑慧/女/中國國民黨"     2 "王世堅/男/民主進步黨"        25 "郭啟源/男/中華統一促進黨" 73 "何梅娟/女/人民最大黨"
      75 "熊嘉玲/女/制度救世島"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ105
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ106
      1 "游淑慧/女/中國國民黨"     2 "王世堅/男/民主進步黨"        25 "郭啟源/男/中華統一促進黨" 73 "何梅娟/女/人民最大黨"
      75 "熊嘉玲/女/制度救世島"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ107
      1 "王鴻薇/女/中國國民黨"     2 "謝佩芬/女/民主進步黨"        42 "楊時睿/男/台灣維新"      71 "陳一郎/男/臺灣雙語無法黨"
      73 "余新造/男/人民最大黨"    75 "高士恩/男/制度救世島"       84 "陳源發/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ108
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ109
      1 "王鴻薇/女/中國國民黨"     2 "謝佩芬/女/民主進步黨"        42 "楊時睿/男/台灣維新"      71 "陳一郎/男/臺灣雙語無法黨"
      73 "余新造/男/人民最大黨"    75 "高士恩/男/制度救世島"       84 "陳源發/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ110
      1 "李彥秀/女/中國國民黨"
      2 "高嘉瑜/女/民主進步黨"
      17 "吳欣岱/女/台灣基進"
      59 "林秋彤/女/台灣整復師聯盟工黨"
      75 "黃啟彬/男/制度救世島"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ111
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ112
      1 "李彥秀/女/中國國民黨"     2 "高嘉瑜/女/民主進步黨"        17 "吳欣岱/女/台灣基進"      59 "林秋彤/女/台灣整復師聯盟工黨"
      75 "黃啟彬/男/制度救世島"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ113
      1 "鍾小平/男/中國國民黨"     2 "吳沛憶/女/民主進步黨"        38 "許敬民/男/合一行動聯盟"  76 "張華特/男/台灣麻將最大黨"
      77 "李慧曦/女/司法改革黨"    78 "蘇諍/男/經濟黨"             84 "于美人/女/無"            85 "林志成/男/無"
      86 "陳燕玉/女/無"            87 "孫智麗/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ114
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ115
      1 "鍾小平/男/中國國民黨"     2 "吳沛憶/女/民主進步黨"        38 "許敬民/男/合一行動聯盟"  76 "張華特/男/台灣麻將最大黨"
      77 "李慧曦/女/司法改革黨"    78 "蘇諍/男/經濟黨"             84 "于美人/女/無"            85 "林志成/男/無"
      86 "陳燕玉/女/無"            87 "孫智麗/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ116
      1 "羅智強/男/中國國民黨"     24 "苗博雅/女/社會民主黨"       42 "朱翊銘/男/台灣維新"      71 "崔建章/男/臺灣雙語無法黨"
      75 "張雪卿/女/制度救世島"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ117
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ118
      1 "羅智強/男/中國國民黨"     24 "苗博雅/女/社會民主黨"       42 "朱翊銘/男/台灣維新"      71 "崔建章/男/臺灣雙語無法黨"
      75 "張雪卿/女/制度救世島"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ119
      1 "徐巧芯/女/中國國民黨"     2 "許淑華/女/民主進步黨"        42 "羅丹/男/台灣維新"        53 "李承龍/男/中華愛國同心黨"
      84 "陳韋安/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ120
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ121
      1 "徐巧芯/女/中國國民黨"     2 "許淑華/女/民主進步黨"        42 "羅丹/男/台灣維新"        53 "李承龍/男/中華愛國同心黨"
      84 "陳韋安/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ122
      1 "賴士葆/男/中國國民黨"     2 "王閔生/男/民主進步黨"        41 "張其祿/男/台灣民眾黨"    42 "劉佩玲/女/台灣維新"
      67 "胡之壯/男/興中同盟會"    79 "賴宣任/女/小民參政歐巴桑聯盟" 84 "夏萬浪/男/無"            85 "張維學/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ123
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ124
      1 "賴士葆/男/中國國民黨"     2 "王閔生/男/民主進步黨"        41 "張其祿/男/台灣民眾黨"    42 "劉佩玲/女/台灣維新"
      67 "胡之壯/男/興中同盟會"    79 "賴宣任/女/小民參政歐巴桑聯盟" 84 "夏萬浪/男/無"            85 "張維學/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ125
      2 "邱議瑩/女/民主進步黨"     41 "曾尹儷/女/台灣民眾黨"       73 "劉承智/男/人民最大黨"    84 "林義迪/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ126
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ127
      2 "邱議瑩/女/民主進步黨"     41 "曾尹儷/女/台灣民眾黨"       73 "劉承智/男/人民最大黨"    84 "林義迪/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ128
      1 "曹桓榮/男/中國國民黨"     2 "邱志偉/男/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ129
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ130
      1 "曹桓榮/男/中國國民黨"     2 "邱志偉/男/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ131
      1 "李眉蓁/女/中國國民黨"     2 "李柏毅/男/民主進步黨"        76 "郭璽/男/台灣麻將最大黨"  84 "張正達/男/無"
      85 "陳銓霖/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ132
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ133
      1 "李眉蓁/女/中國國民黨"     2 "李柏毅/男/民主進步黨"        76 "郭璽/男/台灣麻將最大黨"  84 "張正達/男/無"
      85 "陳銓霖/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ134
      1 "陳若翠/女/中國國民黨"     2 "林岱樺/女/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ135
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ136
      1 "陳若翠/女/中國國民黨"     2 "林岱樺/女/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ137
      1 "黃柏霖/男/中國國民黨"     2 "李昆澤/男/民主進步黨"        79 "張芳愉/女/小民參政歐巴桑聯盟"  84 "楊椒喬/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ138
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ139
      1 "黃柏霖/男/中國國民黨"     2 "李昆澤/男/民主進步黨"        79 "張芳愉/女/小民參政歐巴桑聯盟"  84 "楊椒喬/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ140
      1 "陳美雅/女/中國國民黨"      2 "黃捷/女/民主進步黨"      44 "郭倍宏/男/喜樂島聯盟"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ141
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ142
      1 "陳美雅/女/中國國民黨"     2 "黃捷/女/民主進步黨"          44 "郭倍宏/男/喜樂島聯盟"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ143
      1 "鍾易仲/男/中國國民黨"     2 "許智傑/男/民主進步黨"        77 "王和平統一/男/司法改革黨" 84 "洪啟修/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ144
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ145
      1 "鍾易仲/男/中國國民黨"     2 "許智傑/男/民主進步黨"       77 "王和平統一/男/司法改革黨" 84 "洪啟修/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ146
      1 "李明璇/女/中國國民黨"     2 "賴瑞隆/男/民主進步黨"        13 "湛秀英/女/勞動黨"        77 "李政憲/男/司法改革黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ147
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ148
      1 "李明璇/女/中國國民黨"     2 "賴瑞隆/男/民主進步黨"        13 "湛秀英/女/勞動黨"        77 "李政憲/男/司法改革黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ149
      1 "洪孟楷/男/中國國民黨"     2 "何博文/男/民主進步黨"        25 "翁藤原/男/中華統一促進黨" 42 "徐百弟/男/台灣維新"
      75 "游清池/男/制度救世島"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ150
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ151
      1 "洪孟楷/男/中國國民黨"     2 "何博文/男/民主進步黨"        25 "翁藤原/男/中華統一促進黨" 42 "徐百弟/男/台灣維新"
      75 "游清池/男/制度救世島"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ152
      2 "林淑芬/女/民主進步黨"     25 "何淯笙/男/中華統一促進黨"   41 "李有宜/女/台灣民眾黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ153
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ154
      2 "林淑芬/女/民主進步黨"     25 "何淯笙/男/中華統一促進黨"   41 "李有宜/女/台灣民眾黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ155
      1 "蔡明堂/男/中國國民黨"     2 "李坤城/男/民主進步黨"        84 "陳東雲/男/無"            85 "蘇卿彥/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ156
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ157
      1 "蔡明堂/男/中國國民黨"     2 "李坤城/男/民主進步黨"        84 "陳東雲/男/無"            85 "蘇卿彥/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ158
      1 "蔣欣璋/男/中國國民黨"     2 "吳秉叡/男/民主進步黨"        75 "邱吉均/男/制度救世島"    84 "蘇輝湟/男/無"
      85 "洪懿馥/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ159
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ160
      1 "蔣欣璋/男/中國國民黨"     2 "吳秉叡/男/民主進步黨"        75 "邱吉均/男/制度救世島"    84 "蘇輝湟/男/無"
      85 "洪懿馥/女/無"            
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ161
      1 "洪佳君/女/中國國民黨"
      2 "蘇巧慧/女/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ162
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ163
      1 "洪佳君/女/中國國民黨"
      2 "蘇巧慧/女/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ164
      1 "林國春/男/中國國民黨"     2 "張宏陸/男/民主進步黨"        77 "黃淑珍/女/司法改革黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ165
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ166
      1 "林國春/男/中國國民黨"     2 "張宏陸/男/民主進步黨"        77 "黃淑珍/女/司法改革黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ167
      1 "葉元之/男/中國國民黨"     2 "羅致政/男/民主進步黨"        79 "劉書婷/女/小民參政歐巴桑聯盟"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ168
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ169
      1 "葉元之/男/中國國民黨"     2 "羅致政/男/民主進步黨"        79 "劉書婷/女/小民參政歐巴桑聯盟"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ170
      1 "張智倫/男/中國國民黨"     2 "吳崢/男/民主進步黨"          41 "邱臣遠/男/台灣民眾黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ171
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ172
      1 "張智倫/男/中國國民黨"     2 "吳崢/男/民主進步黨"          41 "邱臣遠/男/台灣民眾黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ173
      1 "林德福/男/中國國民黨"     2 "莊銘淵/男/民主進步黨"        42 "陳愷寧/女/台灣維新"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ174
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ175
      1 "林德福/男/中國國民黨"     2 "莊銘淵/男/民主進步黨"        42 "陳愷寧/女/台灣維新"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ176
      1 "林金結/男/中國國民黨"     2 "吳琪銘/男/民主進步黨"        73 "孟藹倫/女/人民最大黨"    80 "袁興/男/復康聯盟黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ177
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ178
      1 "林金結/男/中國國民黨"     2 "吳琪銘/男/民主進步黨"        73 "孟藹倫/女/人民最大黨"    80 "袁興/男/復康聯盟黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ179
      1 "羅明才/男/中國國民黨"     2 "曾柏瑜/女/民主進步黨"        52 "陳聖/男/中華婦女黨"      73 "張家榛/女/人民最大黨"
      75 "魏趨安/男/制度救世島"    84 "鄭添泉/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ180
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ181
      1 "羅明才/男/中國國民黨"     2 "曾柏瑜/女/民主進步黨"        52 "陳聖/男/中華婦女黨"      73 "張家榛/女/人民最大黨"
      75 "魏趨安/男/制度救世島"    84 "鄭添泉/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ182
      1 "廖先翔/男/中國國民黨"     2 "賴品妤/女/民主進步黨"        42 "陳長志/男/台灣維新"      71 "李佳蒨/女/臺灣雙語無法黨"
      84 "黃瑞傳/男/無"            85 "楊木火/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ183
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ184
      1 "廖先翔/男/中國國民黨"     2 "賴品妤/女/民主進步黨"        42 "陳長志/男/台灣維新"      71 "李佳蒨/女/臺灣雙語無法黨"
      84 "黃瑞傳/男/無"            85 "楊木火/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ185
      2 "蔡其昌/男/民主進步黨"     41 "蔡壁如/女/台灣民眾黨"       84 "賴信全/男/無"            85 "劉燈鐘/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ186
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ187
      2 "蔡其昌/男/民主進步黨"     41 "蔡壁如/女/台灣民眾黨"       84 "賴信全/男/無"            85 "劉燈鐘/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ188
      1 "顏寬恆/男/中國國民黨"     2 "林靜儀/女/民主進步黨"        61 "洪麗華/女/司法正義黨"    84 "紀銘修/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ189
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ190
      1 "顏寬恆/男/中國國民黨"     2 "林靜儀/女/民主進步黨"        61 "洪麗華/女/司法正義黨"    84 "紀銘修/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ191
      1 "楊瓊瓔/女/中國國民黨"     2 "謝子涵/女/民主進步黨"        77 "張火冏春/男/司法改革黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ192
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ193
      1 "楊瓊瓔/女/中國國民黨"     2 "謝子涵/女/民主進步黨"        77 "張火冏春/男/司法改革黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ194
      1 "廖偉翔/男/中國國民黨"     2 "張廖萬堅/男/民主進步黨"      71 "李海碩/男/臺灣雙語無法黨" 72 "林中翊/男/臺灣雙語無法黨"
      85 "陳志彬/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ195
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ196
      1 "廖偉翔/男/中國國民黨"     2 "張廖萬堅/男/民主進步黨"      71 "李海碩/男/臺灣雙語無法黨"  72 "林中翊/男/臺灣雙語無法黨"
      85 "陳志彬/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ197
      1 "黃健豪/男/中國國民黨"     2 "莊競程/男/民主進步黨"        25 "林澤培/女/中華統一促進黨"  71 "謝旻汎/男/臺灣雙語無法黨"
      77 "彭振芳/男/司法改革黨"    79 "蔡善雯/女/小民參政歐巴桑聯盟"  84 "苗豐隆/男/無"           85 "陳維新/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ198
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ199
      1 "黃健豪/男/中國國民黨"     2 "莊競程/男/民主進步黨"        25 "林澤培/女/中華統一促進黨"  71 "謝旻汎/男/臺灣雙語無法黨"
      77 "彭振芳/男/司法改革黨"    79 "蔡善雯/女/小民參政歐巴桑聯盟"  84 "苗豐隆/男/無"           85 "陳維新/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ200
      1 "羅廷瑋/男/中國國民黨"     2 "江肇國/男/民主進步黨"        25 "黃千庭/女/中華統一促進黨" 84 "賀姿華/女/無"
      85 "紀文清/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ201
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ202
      1 "羅廷瑋/男/中國國民黨"     2 "江肇國/男/民主進步黨"        25 "黃千庭/女/中華統一促進黨" 84 "賀姿華/女/無"
      85 "紀文清/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ203
      1 "林家興/男/中國國民黨"     2 "何欣純/女/民主進步黨"        77 "林振東/男/司法改革黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ204
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ205
      1 "林家興/男/中國國民黨"     2 "何欣純/女/民主進步黨"        77 "林振東/男/司法改革黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ206
      1 "江啟臣/男/中國國民黨"     2 "謝志忠/男/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ207
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ208
      1 "江啟臣/男/中國國民黨"     2 "謝志忠/男/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ209
      1 "周宏昌/男/中國國民黨"     2 "賴惠員/女/民主進步黨"        25 "林芳竹/女/中華統一促進黨"  80 "蔡承攸/男/復康聯盟黨"
      84 "侯陸太/男/無"            85 "魏耀乾/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ210
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ211
      1 "周宏昌/男/中國國民黨"     2 "賴惠員/女/民主進步黨"        25 "林芳竹/女/中華統一促進黨"  80 "蔡承攸/男/復康聯盟黨"
      84 "侯陸太/男/無"            85 "魏耀乾/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ212
      2 "郭國文/男/民主進步黨"     73 "詹秋嫻/女/人民最大黨"       84 "陳昆和/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ213
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ214
      2 "郭國文/男/民主進步黨"     73 "詹秋嫻/女/人民最大黨"       84 "陳昆和/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ215
      1 "姚正玉/女/中國國民黨"     2 "陳亭妃/女/民主進步黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ216
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ217
      1 "姚正玉/女/中國國民黨"     2 "陳亭妃/女/民主進步黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ218
      2 "林宜瑾/女/民主進步黨"     77 "劉清田/男/司法改革黨"       84 "李全教/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ219
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ220
      2 "林宜瑾/女/民主進步黨"     77 "劉清田/男/司法改革黨"       84 "李全教/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ221
      2 "林俊憲/男/民主進步黨"     72 "蕭燐洪/男/臺灣雙語無法黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ222
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ223
      2 "林俊憲/男/民主進步黨"     72 "蕭燐洪/男/臺灣雙語無法黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ224
      1 "陳以信/男/中國國民黨"     2 "王定宇/男/民主進步黨"        84 "陳永和/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ225
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ226
      1 "陳以信/男/中國國民黨"     2 "王定宇/男/民主進步黨"        84 "陳永和/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ227
      1 "牛煦庭/男/中國國民黨"     2 "鄭運鵬/男/民主進步黨"        84 "馬治薇/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ228
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ229
      1 "牛煦庭/男/中國國民黨"     2 "鄭運鵬/男/民主進步黨"        84 "馬治薇/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ230
      1 "涂權吉/男/中國國民黨"     2 "黃世杰/男/民主進步黨"        25 "陳志豪/男/中華統一促進黨" 84 "王思玟/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ231
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ232
      1 "涂權吉/男/中國國民黨"     2 "黃世杰/男/民主進步黨"        25 "陳志豪/男/中華統一促進黨" 84 "王思玟/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ233
      1 "魯明哲/男/中國國民黨"     2 "彭俊豪/男/民主進步黨"        3 "游智彬/男/新黨"           75 "戴浙/男/制度救世島"
      79 "徐鶯慈/女/小民參政歐巴桑聯盟"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ234
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ235
      1 "魯明哲/男/中國國民黨"     2 "彭俊豪/男/民主進步黨"        3 "游智彬/男/新黨"           75 "戴浙/男/制度救世島"
      79 "徐鶯慈/女/小民參政歐巴桑聯盟"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ236
      1 "萬美玲/女/中國國民黨"     2 "范綱祥/男/民主進步黨"        81 "甘乃迪/男/台灣國民黨"    84 "黃明莉/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ237
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ238
      1 "萬美玲/女/中國國民黨"     2 "范綱祥/男/民主進步黨"        81 "甘乃迪/男/台灣國民黨"    84 "黃明莉/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ239
      1 "呂玉玲/女/中國國民黨"     2 "劉仁照/男/民主進步黨"        41 "賴香伶/女/台灣民眾黨"    77 "易乃文/男/司法改革黨"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ240
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ241
      1 "呂玉玲/女/中國國民黨"     2 "劉仁照/男/民主進步黨"        41 "賴香伶/女/台灣民眾黨"    77 "易乃文/男/司法改革黨"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ242
      1 "邱若華/女/中國國民黨"     41 "李慕妍/女/台灣民眾黨"       73 "翁紹庭/女/人民最大黨"    80 "劉睿宸/男/復康聯盟黨"
      84 "葉堂宇/男/無"            85 "趙正宇/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ243
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ244
      1 "邱若華/女/中國國民黨"     41 "李慕妍/女/台灣民眾黨"       73 "翁紹庭/女/人民最大黨"    80 "劉睿宸/男/復康聯盟黨"
      84 "葉堂宇/男/無"            85 "趙正宇/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ245
      1 "黃仁/男/中國國民黨"       2 "鄭天財 Sra‧Kacaw/男/中國國民黨"       3 "陳瑩/女/民主進步黨"
      4 "米甘幹．理佛克/男/新黨"   7 "陳國榮/男/台灣維新"                    9 "陳政宗/男/無"
      10 "忠仁．達祿斯/男/無"      11 "高美珠/女/無"                         12 "吳建智咖啡哥/男/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ246
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ247
      1 "黃仁/男/中國國民黨"       2 "鄭天財 Sra‧Kacaw/男/中國國民黨"       3 "陳瑩/女/民主進步黨"
      4 "米甘幹．理佛克/男/新黨"   7 "陳國榮/男/台灣維新"                    9 "陳政宗/男/無"
      10 "忠仁．達祿斯/男/無"      11 "高美珠/女/無"                         12 "吳建智咖啡哥/男/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ248
      1 "孔文吉/男/中國國民黨"     2 "盧縣一/男/中國國民黨"        3 "伍麗華 Saidhai．Tahovecahe/女/民主進步黨"
      6 "胡黃廣文/男/台灣民眾黨"   8 "高畹芯/女/司法改革黨"        9 "張子孝/男/無"
      10 "高金素梅/女/無"          11 "林果/女/無"                 12 "林世偉/男/無"
      13 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
      89 "未領票"                  91 "忘了"                       92 "沒有投票權"              93 "沒有去投"                
      94 "投廢票"                  95 "拒答"                       99 "跳題"
/PQ249
      1 "是"                       2 "不是"                        95 "拒答"                    99 "跳題"
/PQ250
      1 "孔文吉/男/中國國民黨"     2 "盧縣一/男/中國國民黨"        3 "伍麗華 Saidhai．Tahovecahe/女/民主進步黨"
      6 "胡黃廣文/男/台灣民眾黨"   8 "高畹芯/女/司法改革黨"        9 "張子孝/男/無"
      10 "高金素梅/女/無"          11 "林果/女/無"                 12 "林世偉/男/無"
      13 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
      95 "拒  答"                  91 "原本不想投"                 92 "都不是"                  99 "跳題" 
/PQ251
      1 "國民黨"         2 "民進黨"          3 "新 黨"          4 "親民黨"            6 "台聯"
      9 "台灣綠黨"       17 "台灣基進"       19 "時代力量"      25 "中華統一促進黨"   41 "台灣民眾黨"
      42 "台灣維新"      71 "臺灣雙語無法黨" 73 "人民最大黨"    75 "制度救世島"       77 "司法改革黨"
      79 "小民參政歐巴桑聯盟"
      89 "未領票"        95 "拒答"           94 "投廢票"        91 "忘了"             99 "跳題"  
/PQ252
      1 "是"             2 "不是"            95 "拒答"          99 "跳題"
/PQ253
      1 "國民黨"         2 "民進黨"          3 "新 黨"          4 "親民黨"            6 "台聯"
      9 "台灣綠黨"       17 "台灣基進"       19 "時代力量"      25 "中華統一促進黨"   41 "台灣民眾黨"
      42 "台灣維新"      71 "臺灣雙語無法黨" 73 "人民最大黨"    75 "制度救世島"       77 "司法改革黨"
      79 "小民參政歐巴桑聯盟"
      95 "拒  答"        91 "原本不想投"     92 "都不是"        99 "跳題" 
/PQ254
      1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴"  3 "侯友宜與趙少康"
      89 "未領票"        91 "忘了"           94 "投廢票"        95 "拒答"
      99 "跳題" 
/PQ255
      1 "是"             2 "不是"            95 "拒答"          99 "跳題"
/PQ256
      1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴"  3 "侯友宜與趙少康"
      95 "拒  答"        91 "原本不想投"     92 "都不是"        99 "跳題" 
/PQ257
      1 "總統與立法院的多數立委最好是不同黨，才能互相制衡"
      2 "總統與立法院的多數立委最好是同一政黨，才可以貫徹政策"
      95 "拒答"            96 "很難說"       97 "無意見"        98 "不知道"
/PQ258
      1 "比較好"          2 "比較不好"       3 "差不多"
      95 "拒答"           96 "看情形"        97 "無意見"         98 "不知道"
/PQ259
      1 "變好"            2 "變不好"         3 "差不多"
      95 "拒答"           96 "看情形"        97 "無意見"         98 "不知道"
/PQ260
      1 "非常好的影響"    2 "好的影響"       3 "不好的影響"      4 "非常不好的影響"
      96 "很難說"         97 "無意見"        98 "不知道"         95 "拒答"
/PQ261
      1 "儘快統一"                          2 "儘快宣布獨立"  
      3 "維持現狀，以後走向統一"            4 "維持現狀，以後走向獨立"
      5 "維持現狀，看情形再決定獨立或統一"  6 "永遠維持現狀"
      7 "臺灣已經是獨立的國家"                  8 "臺灣已經是統一的國家"
      96 "很難說"      97 "無意見"          98 "不知道"         95 "拒答"
/PQ262
      1 "國民黨"       2 "民進黨"        3 "新黨"          4 "親民黨"       5 "台聯"
      16 "泛藍"        17 "泛綠"         19 "選人不選黨"   20 "綠黨"        21 "時代力量"     
      23 "社民黨"      35 "台灣基進"     38 "台灣民眾黨"   46 "小民參政歐巴桑聯盟"
      48 "司法改革黨"       49 "麻將最大黨"     50 "臺灣雙語無法黨"
      6 "都支持"       7 "都不支持"
      96 "看情形"      97 "無意見"       98 "不知道"       95 "拒答"
/PQ263
      1 "非常支持"        2 "普普通通"        99 "跳題"
/PQ264
      3 "偏國民黨"        4 "偏民進黨"        5 "偏新黨"          6 "偏親民黨"       7 "偏台聯"
      8 "都不偏"          18 "偏泛藍"         19 "偏泛綠"         20 "在野黨"          21 "選人不選黨"    
      23 "偏綠黨"         24 "偏時代力量"  26 "偏社民黨"      38 "偏台灣基進"    41 "偏台灣民眾黨"
      49 "偏小民參政歐巴桑聯盟"           51 "偏司法改革黨" 52 "偏麻將最大黨"  53 "偏臺灣雙語無法黨"
      96 "看情形"         97 "無意見"         98 "不知道"         95 "拒答"              99 "跳題" 
/PQ265
      1 "臺灣人"          2 "都是"
      3 "中國人"
      96 "看情形"         97 "無意見"         98 "不知道"         95 "拒答"
/PQ266
      95 "拒答"    
/PQ267
      1 "不識字及未入學"  2 "小學"          3 "國、初中"          4 "高中、職"        5 "專科"
      6 "大學"            7 "研究所及以上"
      95 "拒答"
/PQ268
      1 "男性"            2 "女性"       
/PQ269
      1 "國語"            2 "臺語"          3 "客語"            4 "國、臺語"           5 "國、客語"
.
FIN .

fre all.

*[建立性別新變數].
COMPUTE PSEX=PQ268.
variable label psex "性別".
value label psex 1 "男性" 2 "女性".
cro PQ268 by psex.

*年齡.
compute PAGE=113-PQ266.
recode page (20 thru 29=1)(30 thru 39=2)(40 thru 49=3)(50 thru 59=4) (60 thru hi=5)(lo thru 19=9).
var lab page "年齡".
val lab page 1 "20至29歲" 2 "30至39歲" 3 "40至49歲" 4 "50至59歲" 5 "60歲及以上" 9 "無反應".
fre page.

*教育程度.
compute PEDU=PQ267.
recode pedu (1 2=1) (3=2) (4=3) (5=4) (6 7=5) (ELSE=9).
var lab pedu "教育程度".
val lab pedu 1 "小學及以下" 2 "國、初中" 3 "高中、職" 4 "專科" 5 "大學及以上" 9 "無反應".
fre pedu.


*[建立臺灣人/中國人認同新變數].
compute PT_CIDENTITY=Pq265.
recode PT_CIDENTITY (95 96 97 98=9).
var lab PT_CIDENTITY "臺灣人/中國人認同".
val lab PT_CIDENTITY 1 "臺灣人" 2"都是" 3"中國人" 9"無反應".
fre PT_CIDENTITY.


*統獨立場.
compute PTondu=PQ261.                                                                                                                                                  
recode PTondu (1=1)(2=6)(3=2)(4=5)(5=3)(6=4)(7 8=9)(95 thru 98=9).                                                                                                                
var lab PTondu "統獨立場".                                                                                                                                             
val lab PTondu 1 "儘快統一" 2 "維持現狀，以後走向統一" 3 "維持現狀，看情形再決定獨立或統一" 4 "永遠維持現狀" 5 "維持現狀，以後走向獨立" 6 "儘快獨立" 9 "無反應、其他".       
fre Ptondu.




*政黨認同.                  
compute PPARTYID=0.                    
if (PQ262=1) ppartyid=1.                 
if (PQ262=6 and PQ264=3) ppartyid=1.     
if (PQ262=7 and PQ264=3) ppartyid=1.    
if (PQ262=10 and PQ264=3) ppartyid=1.  
if (PQ262=16 and PQ264=3) ppartyid=1.      
if (PQ262=18 and PQ264=3) ppartyid=1.     
if (PQ262=19 and PQ264=3) ppartyid=1.     
if (PQ262 gt 21 and PQ264=3) ppartyid=1.  
if (PQ262=2) ppartyid=2.     
if (PQ262=6 and PQ264=4) ppartyid=2.         
if (PQ262=7 and PQ264=4) ppartyid=2.   
if (PQ262=8 and PQ264=4) ppartyid=2.   
if (PQ262=17 and PQ264=4) ppartyid=2.     
if (PQ262=18 and PQ264=4) ppartyid=2.    
if (PQ262=19 and PQ264=4) ppartyid=2.    
if (PQ262 gt 21 and PQ264=4) ppartyid=2.    
if (PQ262=3) ppartyid=3.                 
if (PQ262=6 and PQ264=5) ppartyid=3.      
if (PQ262=7 and PQ264=5) ppartyid=3.   
if (PQ262=9 and PQ264=5) ppartyid=3.   
if (PQ262=16 and PQ264=5) ppartyid=3.   
if (PQ262=18 and PQ264=5) ppartyid=3.   
if (PQ262=19 and PQ264=5) ppartyid=3.   
if (PQ262 gt 21 and PQ264=5) ppartyid=3.    
if (PQ262=4) ppartyid=4.                 
if (PQ262=6 and PQ264=6) ppartyid=4.     
if (PQ262=7 and PQ264=6) ppartyid=4.
if (PQ262=18 and PQ264=6) ppartyid=4.
if (PQ262=19 and PQ264=6) ppartyid=4.
if (PQ262 gt 21 and PQ264=6) ppartyid=4.    
if (PQ262=5) ppartyid=5.  
if (PQ262=6 and PQ264=7) ppartyid=5.      
if (PQ262=7 and PQ264=7) ppartyid=5.      
if (PQ262=18 and PQ264=7) ppartyid=5.      
if (PQ262=19 and PQ264=7) ppartyid=5.      
if (PQ262 gt 21 and PQ264=7) ppartyid=5.   
if (PQ262=21) ppartyid=6.  
if (PQ262=6 and PQ264=24) ppartyid=6.  
if (PQ262=7 and PQ264=24) ppartyid=6.  
if (PQ262=18 and PQ264=24) ppartyid=6.  
if (PQ262=19 and PQ264=24) ppartyid=6.  
if (PQ262 gt 21 and PQ264=24) ppartyid=6.     
if (PQ262=38) ppartyid=7.
if (PQ262=6 and PQ264=41) ppartyid=7.
if (PQ262=7 and PQ264=41) ppartyid=7.
if (PQ262=18 and PQ264=41) ppartyid=7.
if (PQ262=19 and PQ264=41) ppartyid=7.
if (PQ262 gt 21 and PQ264=41) ppartyid=7.     
if ((PQ262=6 or PQ262=7 or PQ262=18 or PQ262=19  or PQ262 gt 94) and (PQ264=8 or PQ264=21 or PQ264=96)) ppartyid=8. 
recode ppartyid(0=9).
var lab ppartyid "政黨認同".                                                                                        
val lab ppartyid 1 "國民黨" 2 "民進黨" 3 "新黨" 4 "親民黨" 5 "台聯" 6"時代力量" 7 "台灣民眾黨" 8 "中立及看情形" 9 "無反應及其他政黨".  
fre ppartyid.                                                                                                      
    
 
*政黨支持.
COMPUTE PPARTY=0.                        
IF (PQ262=1 AND PQ263=1) PPARTY=1.           
IF (PQ262=1 AND PQ263 GT 1) PPARTY=2.        
IF (PQ262 GT 5 AND PQ264=3) PPARTY=3.        
IF (PQ262=2 AND PQ263=1) PPARTY=4.           
IF (PQ262=2 AND PQ263 GT 1) PPARTY=5.        
IF (PQ262 GT 5 AND PQ264=4) PPARTY=6.        
IF (PQ262=3 AND PQ263=1) PPARTY=7.           
IF (PQ262=3 AND PQ263 GT 1) PPARTY=8.        
IF (PQ262 GT 5 AND PQ264=5) PPARTY=9.        
IF (PQ262=4 AND PQ263=1) PPARTY=10.          
IF (PQ262=4 AND PQ263 GT 1) PPARTY=11.       
IF (PQ262 GT 5 AND PQ264=6) PPARTY=12.       
IF (PQ262=5 AND PQ263=1) PPARTY=13.          
IF (PQ262=5 AND PQ263 GT 1) PPARTY=14.       
IF (PQ262 GT 5 AND PQ264=7) PPARTY=15.       
IF (PQ262=21 AND PQ263=1) PPARTY=16.      
IF (PQ262=21 AND PQ263 GT 1) PPARTY=17.     
IF (PQ262 GT 5 AND PQ264=24) PPARTY=18.   
IF (PQ262=38 AND PQ263=1) PPARTY=19.      
IF (PQ262=38 AND PQ263 GT 1) PPARTY=20.     
IF (PQ262 GT 5 AND PQ264=41) PPARTY=21.       
IF ((PQ262=6 or PQ262=7 or PQ262=8 or PQ262=16 or PQ262=17 or PQ262=18 or PQ262=19 or PQ262=20 or PQ262=23 or PQ262=24) 
AND (PQ264=8 or PQ264=10 or PQ264=12 or PQ264=18 or PQ264=19 or PQ264=20 or PQ264=21 or PQ264=22 or PQ264=23 or PQ264=25 or PQ264=40)) PPARTY=99.      
recode PPARTY(0=99).
VAR LAB PPARTY "政黨支持".                                                                                 
val lab PPARTY 1 "非常支持國民黨" 2 "普通支持國民黨" 3 "偏國民黨" 4 "非常支持民進黨" 5 "普通支持民進黨" 6 "偏民進黨"          
              7 "非常支持新黨" 8 "普通支持新黨" 9 "偏新黨" 10 "非常支持親民黨" 11 "普通支持親民黨" 12 "偏親民黨"       
              13 "非常支持台聯" 14 "普通支持台聯" 15 "偏台聯"  16 "非常支持時代力量" 17 "普通支持時代力量" 18 "偏時代力量"
              19 "非常支持台灣民眾黨" 20 "普通支持台灣民眾黨" 21 "偏台灣民眾黨"  99 "中立、其他政黨及無反應".

fre PPARTY.                                                                                                                   
cross PQ262 by PPARTY.                                                                                                          
cross PQ263 by PPARTY.                                                                                                          
cross PQ264 by PPARTY.       



*[建立地區新變數](須先合併選前資料）.                                                   
compute PAREAR=0 .                                                           
if (pq1=63) parear=1.
if (pq1=65 and (pq18=3 or pq18=4 or pq18=6 or pq18=7 or pq18=8 or pq18=9)) parear=1.
if (pq1=65 and (pq18=1 or pq18=10 or pq18=12)) parear=2.
if (pq1=65 and (pq18=2 or pq18=5 or pq18=11)) parear=arear.
if (pq1=17) parear=2.
if (pq1=68 or pq1=4 or pq1=5 or pq1=18) parear=3.
if (pq1=66 or pq1=7 or pq1=8) parear=4.
if (pq1=9 or pq1=10 or pq1=20 or pq1=67) parear=5.
if (pq1=13 or pq1=16 or pq1=64) parear=6.
if (pq1=2 or pq1=14 or pq1=15) parear=7.
if (pq1=28 or pq1=30) parear=9.                                     
if (PQ1=88 or PQ1=89) parear=arear.                                           
recode parear(0=sysmis) .
VARIABLE LABEL PAREAR "地理區域".
VALUE LABEL PAREAR 1 "大臺北都會區" 2 "新北市基隆" 3 "桃竹苗" 4 "中彰投" 5 "雲嘉南"                 
                  6 "高屏澎" 7 "宜花東" 9 "無反應". 
fre parear.



*總統投票對象.
recode pq254 (91 95 98=98)(else=copy) into NPQ254.
var lab npq254 "總統票您是把票投給哪一組候選人?".
val lab npq254 1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴" 3 "侯友宜與趙少康"
             89 "未領票"      94 "投廢票"   98 "無反應" 99 "跳題".


*總統投票對象(原先想投給哪一組).
recode pq256 (95 thru 98=98)(else=copy) into NPQ256.
var lab npq256 "那您原先想投給哪一組?".
val lab npq256 1 "柯文哲與吳欣盈" 2 "賴清德與蕭美琴" 3 "侯友宜與趙少康"
             91 "原先不想投"  92 "都不是"   98 "無反應"   99 "跳題".


*選區(村里).
compute PE_dist=0.
if (PQ1=2)pe_dist=0201.
if (PQ1=14)pe_dist=1401.
if (PQ1=15)pe_dist=1501.
if (PQ1=16)pe_dist=1601.
if (PQ1=17)pe_dist=1701.
if (PQ1=18)pe_dist=1801.
if (PQ1=20)pe_dist=2001.
if (PQ1=28)pe_dist=2801.
if (PQ1=30)pe_dist=3001.
if (PQ2=1)pe_dist=0201.
if (PQ3=1)pe_dist=0401.
if (PQ3=2)pe_dist=0402.
if (PQ4=1)pe_dist=0501.
if (PQ4=2)pe_dist=0502.
if (PQ5=1)pe_dist=0701.
if (PQ5=2)pe_dist=0702.
if (PQ5=3)pe_dist=0703.
if (PQ5=4)pe_dist=0704.
if (PQ6=1)pe_dist=0801.
if (PQ6=2)pe_dist=0802.
if (PQ7=1)pe_dist=0901.
if (PQ7=2)pe_dist=0902.
if (PQ8=1)pe_dist=1001.
if (PQ8=2)pe_dist=1002.
if (PQ9=1)pe_dist=1301.
if (PQ9=2)pe_dist=1302.
if (PQ10=1)pe_dist=1401.
if (PQ11=1)pe_dist=1501.
if (PQ12=1)pe_dist=1601.
if (PQ13=1)pe_dist=1701.
if (PQ14=1)pe_dist=1801.
if (PQ15=1)pe_dist=2001.
if (PQ16=1)pe_dist=6301.
if (PQ16=2)pe_dist=6302.
if (PQ16=3)pe_dist=6303.
if (PQ16=4)pe_dist=6304.
if (PQ16=5)pe_dist=6305.
if (PQ16=6)pe_dist=6306.
if (PQ16=7)pe_dist=6307.
if (PQ16=8)pe_dist=6308.
if (PQ17=1)pe_dist=6401.
if (PQ17=2)pe_dist=6402.
if (PQ17=3)pe_dist=6403.
if (PQ17=4)pe_dist=6404.
if (PQ17=5)pe_dist=6405.
if (PQ17=6)pe_dist=6406.
if (PQ17=7)pe_dist=6407.
if (PQ17=8)pe_dist=6408.
if (PQ18=1)pe_dist=6501.
if (PQ18=2)pe_dist=6502.
if (PQ18=3)pe_dist=6503.
if (PQ18=4)pe_dist=6504.
if (PQ18=5)pe_dist=6505.
if (PQ18=6)pe_dist=6506.
if (PQ18=7)pe_dist=6507.
if (PQ18=8)pe_dist=6508.
if (PQ18=9)pe_dist=6509.
if (PQ18=10)pe_dist=6510.
if (PQ18=11)pe_dist=6511.
if (PQ18=12)pe_dist=6512.
if (PQ19=1)pe_dist=6601.
if (PQ19=2)pe_dist=6602.
if (PQ19=3)pe_dist=6603.
if (PQ19=4)pe_dist=6604.
if (PQ19=5)pe_dist=6605.
if (PQ19=6)pe_dist=6606.
if (PQ19=7)pe_dist=6607.
if (PQ19=8)pe_dist=6608.
if (PQ20=1)pe_dist=6701.
if (PQ20=2)pe_dist=6702.
if (PQ20=3)pe_dist=6703.
if (PQ20=4)pe_dist=6704.
if (PQ20=5)pe_dist=6705.
if (PQ20=6)pe_dist=6706.
if (PQ21=1)pe_dist=6801.
if (PQ21=2)pe_dist=6802.
if (PQ21=3)pe_dist=6803.
if (PQ21=4)pe_dist=6804.
if (PQ21=5)pe_dist=6805.
if (PQ21=6)pe_dist=6806.
if (PQ22=1)pe_dist=2801.
if (PQ23=1)pe_dist=3001.
if (PQ24=1)pe_dist=6901.
if (PQ25=1)pe_dist=7001.

var lab pe_dist "選區".
val lab pe_dist
0201 "宜蘭縣單一選區"   6801 "桃園市第一選區"   6802 "桃園市第二選區"   6803 "桃園市第三選區"   6804 "桃園市第四選區"
6805 "桃園市第五選區"   6806 "桃園市第六選區"   0401 "新竹縣第一選區"   0402 "新竹縣第二選區"   0501 "苗栗縣第一選區"   
0502 "苗栗縣第二選區"   0701 "彰化縣第一選區"   0702 "彰化縣第二選區"   0703 "彰化縣第三選區"   0704 "彰化縣第四選區"   
0801 "南投縣第一選區"   0802 "南投縣第二選區"   0901 "雲林縣第一選區"   0902 "雲林縣第二選區"   1001 "嘉義縣第一選區"   
1002 "嘉義縣第二選區"   1301 "屏東縣第一選區"   1302 "屏東縣第二選區"   1401 "臺東縣單一選區"   1501 "花蓮縣單一選區"   
1601 "澎湖縣單一選區"   1701 "基隆市單一選區"   1801 "新竹市單一選區"   2001 "嘉義市單一選區"   6301 "臺北市第一選區"
6302 "臺北市第二選區"   6303 "臺北市第三選區"   6304 "臺北市第四選區"   6305 "臺北市第五選區"   6306 "臺北市第六選區"
6307 "臺北市第七選區"   6308 "臺北市第八選區"   6401 "高雄市第一選區"   6402 "高雄市第二選區"   6403 "高雄市第三選區"
6404 "高雄市第四選區"   6405 "高雄市第五選區"   6406 "高雄市第六選區"   6407 "高雄市第七選區"   6408 "高雄市第八選區"
6501 "新北市第一選區"   6502 "新北市第二選區"   6503 "新北市第三選區"   6504 "新北市第四選區"   6505 "新北市第五選區"   
6506 "新北市第六選區"   6507 "新北市第七選區"   6508 "新北市第八選區"   6509 "新北市第九選區"   6510 "新北市第十選區"   
6511 "新北市第十一選區" 6512 "新北市第十二選區" 6601 "臺中市第一選區"   6602 "臺中市第二選區"   6603 "臺中市第三選區"   
6604 "臺中市第四選區"   6605 "臺中市第五選區"   6606 "臺中市第六選區"   6607 "臺中市第七選區"    6608 "臺中市第八選區"   
6701 "臺南市第一選區"   6702 "臺南市第二選區"   6703 "臺南市第三選區"   6704 "臺南市第四選區"    6705 "臺南市第五選區"  
6706 "臺南市第六選區"   2801 "金門縣單一選區"   3001 "連江縣單一選區"   6901 "平地原住民選區"   7001 "山地原住民選區"   .                          

fre pe_dist.


*投票對象.
compu Pcand=0.

*宜蘭縣.
if (pq26=01)Pcand=020101.
if (pq26=02)Pcand=020102.
if (pq26=17)Pcand=020117.
if (pq26=41)Pcand=020141.
if (pq26=75)Pcand=020175.
if (pq26=84)Pcand=020184.
if (pq26=89)Pcand=999989.
if (pq26=91)Pcand=999991.
if (pq26=92)Pcand=999992.
if (pq26=93)Pcand=999993.
if (pq26=94)Pcand=999994.
if (pq26=95)Pcand=999995.

*桃園市第一選區.
if (pq227=01)Pcand=680101.
if (pq227=02)Pcand=680102.
if (pq227=84)Pcand=680184.
if (pq227=89)Pcand=999989.
if (pq227=91)Pcand=999991.
if (pq227=92)Pcand=999992.
if (pq227=93)Pcand=999993.
if (pq227=94)Pcand=999994.
if (pq227=95)Pcand=999995.


*桃園市第二選區.
if (pq230=01)Pcand=680201.
if (pq230=02)Pcand=680202.
if (pq230=25)Pcand=680225.
if (pq230=84)Pcand=680284.
if (pq230=89)Pcand=999989.
if (pq230=91)Pcand=999991.
if (pq230=92)Pcand=999992.
if (pq230=93)Pcand=999993.
if (pq230=94)Pcand=999994.
if (pq230=95)Pcand=999995.


*桃園市第三選區.
if (pq233=01)Pcand=680301.
if (pq233=02)Pcand=680302.
if (pq233=03)Pcand=680303.
if (pq233=75)Pcand=680375.
if (pq233=79)Pcand=680379.
if (pq233=89)Pcand=999989.
if (pq233=91)Pcand=999991.
if (pq233=92)Pcand=999992.
if (pq233=93)Pcand=999993.
if (pq233=94)Pcand=999994.
if (pq233=95)Pcand=999995.

*桃園市第四選區.
if (pq236=01)Pcand=680401.
if (pq236=02)Pcand=680402.
if (pq236=81)Pcand=680481.
if (pq236=84)Pcand=680484.
if (pq236=89)Pcand=999989.
if (pq236=91)Pcand=999991.
if (pq236=92)Pcand=999992.
if (pq236=93)Pcand=999993.
if (pq236=94)Pcand=999994.
if (pq236=95)Pcand=999995.

*桃園市第五選區.
if (pq239=01)Pcand=680501.
if (pq239=02)Pcand=680502.
if (pq239=41)Pcand=680541.
if (pq239=77)Pcand=680577.
if (pq239=89)Pcand=999989.
if (pq239=91)Pcand=999991.
if (pq239=92)Pcand=999992.
if (pq239=93)Pcand=999993.
if (pq239=94)Pcand=999994.
if (pq239=95)Pcand=999995.


*桃園市第六選區.
if (pq242=01)Pcand=680601.
if (pq242=41)Pcand=680641.
if (pq242=73)Pcand=680673.
if (pq242=80)Pcand=680680.
if (pq242=84)Pcand=680684.
if (pq242=85)Pcand=680685.
if (pq242=89)Pcand=999989.
if (pq242=91)Pcand=999991.
if (pq242=92)Pcand=999992.
if (pq242=93)Pcand=999993.
if (pq242=94)Pcand=999994.
if (pq242=95)Pcand=999995.

*新竹縣第一選區.   
if (pq29=01)Pcand=040101.
if (pq29=02)Pcand=040102.
if (pq29=09)Pcand=040109.
if (pq29=42)Pcand=040142.
if (pq29=79)Pcand=040179.
if (pq29=89)Pcand=999989.
if (pq29=91)Pcand=999991.
if (pq29=92)Pcand=999992.
if (pq29=93)Pcand=999993.
if (pq29=94)Pcand=999994.
if (pq29=95)Pcand=999995.

*新竹縣第二選區.   
if (pq32=01)Pcand=040201.
if (pq32=02)Pcand=040202.
if (pq32=19)Pcand=040219.
if (pq32=89)Pcand=999989.
if (pq32=91)Pcand=999991.
if (pq32=92)Pcand=999992.
if (pq32=93)Pcand=999993.
if (pq32=94)Pcand=999994.
if (pq32=95)Pcand=999995.

*苗栗縣第一選區.   
if (pq35=02)Pcand=050102.
if (pq35=84)Pcand=050184.
if (pq35=89)Pcand=999989.
if (pq35=91)Pcand=999991.
if (pq35=92)Pcand=999992.
if (pq35=93)Pcand=999993.
if (pq35=94)Pcand=999994.
if (pq35=95)Pcand=999995.

*苗栗縣第二選區.
if (pq38=01)Pcand=050201.
if (pq38=84)Pcand=050284.
if (pq38=89)Pcand=999989.
if (pq38=91)Pcand=999991.
if (pq38=92)Pcand=999992.
if (pq38=93)Pcand=999993.
if (pq38=94)Pcand=999994.
if (pq38=95)Pcand=999995.

*彰化縣第一選區.   
if (pq41=01)Pcand=070101.
if (pq41=02)Pcand=070102.
if (pq41=84)Pcand=999984.
if (pq41=91)Pcand=999991.
if (pq41=92)Pcand=999992.
if (pq41=93)Pcand=999993.
if (pq41=94)Pcand=999994.
if (pq41=95)Pcand=999995.

*彰化縣第二選區..
if (pq44=01)Pcand=070201.
if (pq44=02)Pcand=070202.
if (pq44=89)Pcand=999989.
if (pq44=91)Pcand=999991.
if (pq44=92)Pcand=999992.
if (pq44=93)Pcand=999993.
if (pq44=94)Pcand=999994.
if (pq44=95)Pcand=999995.


*彰化縣第三選區.   
if (pq47=01)Pcand=070301.
if (pq47=02)Pcand=070302.
if (pq47=25)Pcand=070325.
if (pq47=84)Pcand=070384.
if (pq47=89)Pcand=999989.
if (pq47=91)Pcand=999991.
if (pq47=92)Pcand=999992.
if (pq47=93)Pcand=999993.
if (pq47=94)Pcand=999994.
if (pq47=95)Pcand=999995.

*彰化縣第四選區.
if (pq50=01)Pcand=070401.
if (pq50=02)Pcand=070402.
if (pq50=71)Pcand=070471.
if (pq50=82)Pcand=070482.
if (pq50=89)Pcand=999989.
if (pq50=91)Pcand=999991.
if (pq50=92)Pcand=999992.
if (pq50=93)Pcand=999993.
if (pq50=94)Pcand=999994.
if (pq50=95)Pcand=999995.


*南投縣第一選區.   
if (pq53=01)Pcand=080101.
if (pq53=02)Pcand=080102.
if (pq53=13)Pcand=080113.
if (pq53=79)Pcand=080179.
if (pq53=84)Pcand=080184.
if (pq53=89)Pcand=999989.
if (pq53=91)Pcand=999991.
if (pq53=92)Pcand=999992.
if (pq53=93)Pcand=999993.
if (pq53=94)Pcand=999994.
if (pq53=95)Pcand=999995.

*南投縣第二選區.
if (pq56=01)Pcand=080201.
if (pq56=02)Pcand=080202.
if (pq56=84)Pcand=080284.
if (pq56=89)Pcand=999989.
if (pq56=91)Pcand=999991.
if (pq56=92)Pcand=999992.
if (pq56=93)Pcand=999993.
if (pq56=94)Pcand=999994.
if (pq56=95)Pcand=999995.

*雲林縣第一選區.   
if (pq59=01)Pcand=090101.
if (pq59=02)Pcand=090102.
if (pq59=25)Pcand=090125.
if (pq59=70)Pcand=090170.
if (pq59=84)Pcand=090184.
if (pq59=85)Pcand=090185.
if (pq59=89)Pcand=999989.
if (pq59=91)Pcand=999991.
if (pq59=92)Pcand=999992.
if (pq59=93)Pcand=999993.
if (pq59=94)Pcand=999994.
if (pq59=95)Pcand=999995.

*雲林縣第二選區.
if (pq62=01)Pcand=090201.
if (pq62=02)Pcand=090202.
if (pq62=89)Pcand=999989.
if (pq62=91)Pcand=999991.
if (pq62=92)Pcand=999992.
if (pq62=93)Pcand=999993.
if (pq62=94)Pcand=999994.
if (pq62=95)Pcand=999995.


*嘉義縣第一選區.   
if (pq65=01)Pcand=100101.
if (pq65=02)Pcand=100102.
if (pq65=89)Pcand=999989.
if (pq65=91)Pcand=999991.
if (pq65=92)Pcand=999992.
if (pq65=93)Pcand=999993.
if (pq65=94)Pcand=999994.
if (pq65=95)Pcand=999995.

*嘉義縣第二選區.
if (pq68=02)Pcand=100202.
if (pq68=42)Pcand=100242.
if (pq68=75)Pcand=100275.
if (pq68=84)Pcand=100284.
if (pq68=85)Pcand=100285.
if (pq68=89)Pcand=999989.
if (pq68=91)Pcand=999991.
if (pq68=92)Pcand=999992.
if (pq68=93)Pcand=999993.
if (pq68=94)Pcand=999994.
if (pq68=95)Pcand=999995.

*屏東縣第一選區.   
if (pq71=01)Pcand=130101.
if (pq71=02)Pcand=130102.
if (pq71=25)Pcand=130125.
if (pq71=42)Pcand=130142.
if (pq71=84)Pcand=130184.
if (pq71=85)Pcand=130185.
if (pq71=89)Pcand=999989.
if (pq71=91)Pcand=999991.
if (pq71=92)Pcand=999992.
if (pq71=93)Pcand=999993.
if (pq71=94)Pcand=999994.
if (pq71=95)Pcand=999995.

*屏東縣第二選區.
if (pq74=02)Pcand=130202.
if (pq74=56)Pcand=130256.
if (pq74=73)Pcand=130273.
if (pq74=84)Pcand=130284.
if (pq74=89)Pcand=999989.
if (pq74=91)Pcand=999991.
if (pq74=92)Pcand=999992.
if (pq74=93)Pcand=999993.
if (pq74=94)Pcand=999994.
if (pq74=95)Pcand=999995.

*臺東縣.   
if (pq77=01)Pcand=140101.
if (pq77=02)Pcand=140102.
if (pq77=79)Pcand=140179.
if (pq77=84)Pcand=140184.
if (pq77=85)Pcand=140185.
if (pq77=86)Pcand=140186.
if (pq77=89)Pcand=999989.
if (pq77=91)Pcand=999991.
if (pq77=92)Pcand=999992.
if (pq77=93)Pcand=999993.
if (pq77=94)Pcand=999994.
if (pq77=95)Pcand=999995.


*花蓮縣.   
if (pq80=01)Pcand=150101.
if (pq80=02)Pcand=150102.
if (pq80=75)Pcand=150175.
if (pq80=87)Pcand=150184.
if (pq80=89)Pcand=999989.
if (pq80=91)Pcand=999991.
if (pq80=92)Pcand=999992.
if (pq80=93)Pcand=999993.
if (pq80=94)Pcand=999994.
if (pq80=95)Pcand=999995.


*澎湖縣.   
if (pq83=01)Pcand=160101.
if (pq83=02)Pcand=160102.
if (pq83=84)Pcand=160184.
if (pq83=89)Pcand=999989.
if (pq83=91)Pcand=999991.
if (pq83=92)Pcand=999992.
if (pq83=93)Pcand=999993.
if (pq83=94)Pcand=999994.
if (pq83=95)Pcand=999995.


*基隆市.   
if (pq86=01)Pcand=170101.
if (pq86=02)Pcand=170102.
if (pq86=79)Pcand=170179.
if (pq86=81)Pcand=170181.
if (pq86=83)Pcand=170183.
if (pq86=85)Pcand=170185.
if (pq86=89)Pcand=999989.
if (pq86=91)Pcand=999991.
if (pq86=92)Pcand=999992.
if (pq86=93)Pcand=999993.
if (pq86=94)Pcand=999994.
if (pq86=95)Pcand=999995.

*新竹市.   
if (pq89=01)Pcand=180101.
if (pq89=02)Pcand=180102.
if (pq89=19)Pcand=180119.
if (pq89=75)Pcand=180175.
if (pq89=77)Pcand=180177.
if (pq89=84)Pcand=180184.
if (pq89=85)Pcand=180185.
if (pq89=89)Pcand=999989.
if (pq89=91)Pcand=999991.
if (pq89=92)Pcand=999992.
if (pq89=93)Pcand=999993.
if (pq89=94)Pcand=999994.
if (pq89=95)Pcand=999995.


*嘉義市.
if (pq92=01)Pcand=200101.
if (pq92=02)Pcand=200102.
if (pq92=71)Pcand=200171.
if (pq92=79)Pcand=200179.
if (pq92=80)Pcand=200180.
if (pq92=84)Pcand=200184.
if (pq92=89)Pcand=999989.
if (pq92=91)Pcand=999991.
if (pq92=92)Pcand=999992.
if (pq92=93)Pcand=999993.
if (pq92=94)Pcand=999994.
if (pq92=95)Pcand=999995.

*臺北市第一選區.
if (pq101=01)Pcand=630101.
if (pq101=02)Pcand=630102.
if (pq101=48)Pcand=630148.
if (pq101=71)Pcand=630171.
if (pq101=73)Pcand=630173.
if (pq101=74)Pcand=630174.
if (pq101=84)Pcand=630184.
if (pq101=85)Pcand=630185.
if (pq101=89)Pcand=999989.
if (pq101=91)Pcand=999991.
if (pq101=92)Pcand=999992.
if (pq101=93)Pcand=999993.
if (pq101=94)Pcand=999994.
if (pq101=95)Pcand=999995.

*臺北市第二選區.
if (pq104=01)Pcand=630201.
if (pq104=02)Pcand=630202.
if (pq104=25)Pcand=630225.
if (pq104=73)Pcand=630273.
if (pq104=75)Pcand=630275.
if (pq104=89)Pcand=999989.
if (pq104=91)Pcand=999991.
if (pq104=92)Pcand=999992.
if (pq104=93)Pcand=999993.
if (pq104=94)Pcand=999994.
if (pq104=95)Pcand=999995.


*臺北市第三選區.
if (pq107=01)Pcand=630301.
if (pq107=02)Pcand=630302.
if (pq107=42)Pcand=630342.
if (pq107=71)Pcand=630371.
if (pq107=73)Pcand=630373.
if (pq107=75)Pcand=630375.
if (pq107=84)Pcand=630384.
if (pq107=89)Pcand=999989.
if (pq107=91)Pcand=999991.
if (pq107=92)Pcand=999992.
if (pq107=93)Pcand=999993.
if (pq107=94)Pcand=999994.
if (pq107=95)Pcand=999995.

*臺北市第四選區.
if (pq110=01)Pcand=630401.
if (pq110=02)Pcand=630402.
if (pq110=17)Pcand=630417.
if (pq110=59)Pcand=630459.
if (pq110=75)Pcand=630475.
if (pq110=89)Pcand=999989.
if (pq110=91)Pcand=999991.
if (pq110=92)Pcand=999992.
if (pq110=93)Pcand=999993.
if (pq110=94)Pcand=999994.
if (pq110=95)Pcand=999995.

*臺北市第五選區.
if (pq113=01)Pcand=630501.
if (pq113=02)Pcand=630502.
if (pq113=38)Pcand=630538.
if (pq113=76)Pcand=630576.
if (pq113=78)Pcand=630578.
if (pq113=84)Pcand=630584.
if (pq113=85)Pcand=630585.
if (pq113=86)Pcand=630586.
if (pq113=87)Pcand=630587.
if (pq113=89)Pcand=999989.
if (pq113=91)Pcand=999991.
if (pq113=92)Pcand=999992.
if (pq113=93)Pcand=999993.
if (pq113=94)Pcand=999994.
if (pq113=95)Pcand=999995.


*臺北市第六選區.
if (pq116=01)Pcand=630601.
if (pq116=24)Pcand=630624.
if (pq116=42)Pcand=630642.
if (pq116=71)Pcand=630671.
if (pq116=75)Pcand=630675.
if (pq116=89)Pcand=999989.
if (pq116=91)Pcand=999991.
if (pq116=92)Pcand=999992.
if (pq116=93)Pcand=999993.
if (pq116=94)Pcand=999994.
if (pq116=95)Pcand=999995.


*臺北市第七選區.
if (pq119=01)Pcand=630701.
if (pq119=02)Pcand=630702.
if (pq119=42)Pcand=630742.
if (pq119=53)Pcand=630753.
if (pq119=84)Pcand=630784.
if (pq119=89)Pcand=999989.
if (pq119=91)Pcand=999991.
if (pq119=92)Pcand=999992.
if (pq119=93)Pcand=999993.
if (pq119=94)Pcand=999994.
if (pq119=95)Pcand=999995.


*臺北市第八選區.
if (pq122=01)Pcand=630801.
if (pq122=02)Pcand=630802.
if (pq122=41)Pcand=630841.
if (pq122=42)Pcand=630842.
if (pq122=67)Pcand=630867.
if (pq122=79)Pcand=630879.
if (pq122=84)Pcand=630884.
if (pq122=85)Pcand=630885.
if (pq122=89)Pcand=999989.
if (pq122=91)Pcand=999991.
if (pq122=92)Pcand=999992.
if (pq122=93)Pcand=999993.
if (pq122=94)Pcand=999994.
if (pq122=95)Pcand=999995.

*高雄市第一選區.
if (pq125=02)Pcand=640102.
if (pq125=41)Pcand=640141.
if (pq125=73)Pcand=640173.
if (pq125=84)Pcand=640184.
if (pq125=89)Pcand=999989.
if (pq125=91)Pcand=999991.
if (pq125=92)Pcand=999992.
if (pq125=93)Pcand=999993.
if (pq125=94)Pcand=999994.
if (pq125=95)Pcand=999995.


*高雄市第二選區.
if (pq128=01)Pcand=640201.
if (pq128=02)Pcand=640202.
if (pq128=89)Pcand=999989.
if (pq128=91)Pcand=999991.
if (pq128=92)Pcand=999992.
if (pq128=93)Pcand=999993.
if (pq128=94)Pcand=999994.
if (pq128=95)Pcand=999995.

*高雄市第三選區.
if (pq131=01)Pcand=640301.
if (pq131=02)Pcand=640302.
if (pq131=76)Pcand=640376.
if (pq131=84)Pcand=640384.
if (pq131=85)Pcand=640385.
if (pq131=89)Pcand=999989.
if (pq131=91)Pcand=999991.
if (pq131=92)Pcand=999992.
if (pq131=93)Pcand=999993.
if (pq131=94)Pcand=999994.
if (pq131=95)Pcand=999995.

*高雄市第四選區.
if (pq134=01)Pcand=640401.
if (pq134=02)Pcand=640402.
if (pq134=89)Pcand=999989.
if (pq134=91)Pcand=999991.
if (pq134=92)Pcand=999992.
if (pq134=93)Pcand=999993.
if (pq134=94)Pcand=999994.
if (pq134=95)Pcand=999995.

*高雄市第五選區.
if (pq137=01)Pcand=640501.
if (pq137=02)Pcand=640502.
if (pq137=79)Pcand=640579.
if (pq137=84)Pcand=640584.
if (pq137=89)Pcand=999989.
if (pq137=91)Pcand=999991.
if (pq137=92)Pcand=999992.
if (pq137=93)Pcand=999993.
if (pq137=94)Pcand=999994.
if (pq137=95)Pcand=999995.


*高雄市第六選區.
if (pq140=01)Pcand=640601.
if (pq140=02)Pcand=640602.
if (pq140=44)Pcand=640644.
if (pq140=89)Pcand=999989.
if (pq140=91)Pcand=999991.
if (pq140=92)Pcand=999992.
if (pq140=93)Pcand=999993.
if (pq140=94)Pcand=999994.
if (pq140=95)Pcand=999995.


*高雄市第七選區.
if (pq143=01)Pcand=640701.
if (pq143=02)Pcand=640702.
if (pq143=77)Pcand=640777.
if (pq143=84)Pcand=640784.
if (pq143=89)Pcand=999989.
if (pq143=91)Pcand=999991.
if (pq143=92)Pcand=999992.
if (pq143=93)Pcand=999993.
if (pq143=94)Pcand=999994.
if (pq143=95)Pcand=999995.


*高雄市第八選區.
if (pq146=01)Pcand=640801.
if (pq146=02)Pcand=640802.
if (pq146=13)Pcand=640813.
if (pq146=77)Pcand=640877.
if (pq146=89)Pcand=999989.
if (pq146=91)Pcand=999991.
if (pq146=92)Pcand=999992.
if (pq146=93)Pcand=999993.
if (pq146=94)Pcand=999994.
if (pq146=95)Pcand=999995.

*新北市第一選區.
if (pq149=01)Pcand=650101.
if (pq149=02)Pcand=650102.
if (pq149=25)Pcand=650125.
if (pq149=42)Pcand=650142.
if (pq149=75)Pcand=650175.
if (pq149=89)Pcand=999989.
if (pq149=91)Pcand=999991.
if (pq149=92)Pcand=999992.
if (pq149=93)Pcand=999993.
if (pq149=94)Pcand=999994.
if (pq149=95)Pcand=999995.


*新北市第二選區.
if (pq152=01)Pcand=650201.
if (pq152=02)Pcand=650202.
if (pq152=41)Pcand=650241.
if (pq152=89)Pcand=999989.
if (pq152=91)Pcand=999991.
if (pq152=92)Pcand=999992.
if (pq152=93)Pcand=999993.
if (pq152=94)Pcand=999994.
if (pq152=95)Pcand=999995.


*新北市第三選區.
if (pq155=01)Pcand=650301.
if (pq155=02)Pcand=650302.
if (pq155=84)Pcand=650384.
if (pq155=85)Pcand=650385.
if (pq155=89)Pcand=999989.
if (pq155=91)Pcand=999991.
if (pq155=92)Pcand=999992.
if (pq155=93)Pcand=999993.
if (pq155=94)Pcand=999994.
if (pq155=95)Pcand=999995.

*新北市第四選區.
if (pq158=01)Pcand=650401.
if (pq158=02)Pcand=650402.
if (pq158=75)Pcand=650475.
if (pq158=84)Pcand=650484.
if (pq158=85)Pcand=650485.
if (pq158=89)Pcand=999989.
if (pq158=91)Pcand=999991.
if (pq158=92)Pcand=999992.
if (pq158=93)Pcand=999993.
if (pq158=94)Pcand=999994.
if (pq158=95)Pcand=999995.

*新北市第五選區.
if (pq161=01)Pcand=650501.
if (pq161=02)Pcand=650502.
if (pq161=89)Pcand=999989.
if (pq161=91)Pcand=999991.
if (pq161=92)Pcand=999992.
if (pq161=93)Pcand=999993.
if (pq161=94)Pcand=999994.
if (pq161=95)Pcand=999995.

*新北市第六選區.
if (pq164=01)Pcand=650601.
if (pq164=02)Pcand=650602.
if (pq164=77)Pcand=650677.
if (pq164=89)Pcand=999989.
if (pq164=91)Pcand=999991.
if (pq164=92)Pcand=999992.
if (pq164=93)Pcand=999993.
if (pq164=94)Pcand=999994.
if (pq164=95)Pcand=999995.


*新北市第七選區.
if (pq167=01)Pcand=650701.
if (pq167=02)Pcand=650702.
if (pq167=79)Pcand=650779.
if (pq167=89)Pcand=999989.
if (pq167=91)Pcand=999991.
if (pq167=92)Pcand=999992.
if (pq167=93)Pcand=999993.
if (pq167=94)Pcand=999994.
if (pq167=95)Pcand=999995.


*新北市第八選區.
if (pq170=01)Pcand=650801.
if (pq170=02)Pcand=650802.
if (pq170=41)Pcand=650841.
if (pq170=89)Pcand=999989.
if (pq170=91)Pcand=999991.
if (pq170=92)Pcand=999992.
if (pq170=93)Pcand=999993.
if (pq170=94)Pcand=999994.
if (pq170=95)Pcand=999995.


*新北市第九選區.
if (pq173=01)Pcand=650901.
if (pq173=02)Pcand=650902.
if (pq173=42)Pcand=650942.
if (pq173=89)Pcand=999989.
if (pq173=91)Pcand=999991.
if (pq173=92)Pcand=999992.
if (pq173=93)Pcand=999993.
if (pq173=94)Pcand=999994.
if (pq173=95)Pcand=999995.

*新北市第十選區.
if (pq176=01)Pcand=651001.
if (pq176=02)Pcand=651002.
if (pq176=73)Pcand=651073.
if (pq176=80)Pcand=651080.
if (pq176=89)Pcand=999989.
if (pq176=91)Pcand=999991.
if (pq176=92)Pcand=999992.
if (pq176=93)Pcand=999993.
if (pq176=94)Pcand=999994.
if (pq176=95)Pcand=999995.

*新北市第十一選區.
if (pq179=01)Pcand=651101.
if (pq179=02)Pcand=651102.
if (pq179=52)Pcand=651152.
if (pq179=73)Pcand=651173.
if (pq179=75)Pcand=651175.
if (pq179=84)Pcand=651184.
if (pq179=89)Pcand=999989.
if (pq179=91)Pcand=999991.
if (pq179=92)Pcand=999992.
if (pq179=93)Pcand=999993.
if (pq179=94)Pcand=999994.
if (pq179=95)Pcand=999995.


*新北市第十二選區.
if (pq182=01)Pcand=651201.
if (pq182=02)Pcand=651202.
if (pq182=42)Pcand=651242.
if (pq182=71)Pcand=651271.
if (pq182=84)Pcand=651284.
if (pq182=85)Pcand=651285.
if (pq182=89)Pcand=999989.
if (pq182=91)Pcand=999991.
if (pq182=92)Pcand=999992.
if (pq182=93)Pcand=999993.
if (pq182=94)Pcand=999994.
if (pq182=95)Pcand=999995.


*臺中市第一選區.
if (pq185=02)Pcand=660102.
if (pq185=41)Pcand=660141.
if (pq185=84)Pcand=660184.
if (pq185=85)Pcand=660185.
if (pq185=89)Pcand=999989.
if (pq185=91)Pcand=999991.
if (pq185=92)Pcand=999992.
if (pq185=93)Pcand=999993.
if (pq185=94)Pcand=999994.
if (pq185=95)Pcand=999995.


*臺中市第二選區.
if (pq188=01)Pcand=660201.
if (pq188=02)Pcand=660202.
if (pq188=61)Pcand=660261.
if (pq188=64)Pcand=660264.
if (pq188=89)Pcand=999989.
if (pq188=91)Pcand=999991.
if (pq188=92)Pcand=999992.
if (pq188=93)Pcand=999993.
if (pq188=94)Pcand=999994.
if (pq188=95)Pcand=999995.


*臺中市第三選區.
if (pq191=01)Pcand=660301.
if (pq191=02)Pcand=660302.
if (pq191=77)Pcand=660377.
if (pq191=89)Pcand=999989.
if (pq191=91)Pcand=999991.
if (pq191=92)Pcand=999992.
if (pq191=93)Pcand=999993.
if (pq191=94)Pcand=999994.
if (pq191=95)Pcand=999995.

*臺中市第四選區.
if (pq194=01)Pcand=660401.
if (pq194=02)Pcand=660402.
if (pq194=71)Pcand=660471.
if (pq194=72)Pcand=660472.
if (pq194=85)Pcand=660485.
if (pq194=89)Pcand=999989.
if (pq194=91)Pcand=999991.
if (pq194=92)Pcand=999992.
if (pq194=93)Pcand=999993.
if (pq194=94)Pcand=999994.
if (pq194=95)Pcand=999995.

*臺中市第五選區.
if (pq197=01)Pcand=660501.
if (pq197=02)Pcand=660502.
if (pq197=25)Pcand=660525.
if (pq197=71)Pcand=660571.
if (pq197=77)Pcand=660577.
if (pq197=79)Pcand=660579.
if (pq197=84)Pcand=660584.
if (pq197=85)Pcand=660585.
if (pq197=89)Pcand=999989.
if (pq197=91)Pcand=999991.
if (pq197=92)Pcand=999992.
if (pq197=93)Pcand=999993.
if (pq197=94)Pcand=999994.
if (pq197=95)Pcand=999995.


*臺中市第六選區.
if (pq200=01)Pcand=660601.
if (pq200=02)Pcand=660602.
if (pq200=25)Pcand=660625.
if (pq200=84)Pcand=660684.
if (pq200=85)Pcand=660685.
if (pq200=89)Pcand=999989.
if (pq200=91)Pcand=999991.
if (pq200=92)Pcand=999992.
if (pq200=93)Pcand=999993.
if (pq200=94)Pcand=999994.
if (pq200=95)Pcand=999995.


*臺中市第七選區.
if (pq203=01)Pcand=660701.
if (pq203=02)Pcand=660702.
if (pq203=77)Pcand=660777.
if (pq203=89)Pcand=999989.
if (pq203=91)Pcand=999991.
if (pq203=92)Pcand=999992.
if (pq203=93)Pcand=999993.
if (pq203=94)Pcand=999994.
if (pq203=95)Pcand=999995.               

*臺中市第八選區.
if (pq206=01)Pcand=660801.
if (pq206=02)Pcand=660802.
if (pq206=89)Pcand=999989.
if (pq206=91)Pcand=999991.
if (pq206=92)Pcand=999992.
if (pq206=93)Pcand=999993.
if (pq206=94)Pcand=999994.
if (pq206=95)Pcand=999995.      


*臺南市第一選區.
if (pq209=01)Pcand=670101.
if (pq209=02)Pcand=670102.
if (pq209=25)Pcand=670125.
if (pq209=80)Pcand=670180.
if (pq209=84)Pcand=670184.
if (pq209=85)Pcand=670185.
if (pq209=89)Pcand=999989.
if (pq209=91)Pcand=999991.
if (pq209=92)Pcand=999992.
if (pq209=93)Pcand=999993.
if (pq209=94)Pcand=999994.
if (pq209=95)Pcand=999995.


*臺南市第二選區.
if (pq212=02)Pcand=670202.
if (pq212=73)Pcand=670273.
if (pq212=84)Pcand=670284.
if (pq212=89)Pcand=999989.
if (pq212=91)Pcand=999991.
if (pq212=92)Pcand=999992.
if (pq212=93)Pcand=999993.
if (pq212=94)Pcand=999994.
if (pq212=95)Pcand=999995.


*臺南市第三選區.
if (pq215=01)Pcand=670301.
if (pq215=02)Pcand=670302.
if (pq215=89)Pcand=999989.
if (pq215=91)Pcand=999991.
if (pq215=92)Pcand=999992.
if (pq215=93)Pcand=999993.
if (pq215=94)Pcand=999994.
if (pq215=95)Pcand=999995.

*臺南市第四選區.
if (pq218=02)Pcand=670402.
if (pq218=77)Pcand=670477.
if (pq218=84)Pcand=670484.
if (pq218=89)Pcand=999989.
if (pq218=91)Pcand=999991.
if (pq218=92)Pcand=999992.
if (pq218=93)Pcand=999993.
if (pq218=94)Pcand=999994.
if (pq218=95)Pcand=999995.

*臺南市第五選區.
if (pq221=02)Pcand=670502.
if (pq221=72)Pcand=670572.
if (pq221=89)Pcand=999989.
if (pq221=91)Pcand=999991.
if (pq221=92)Pcand=999992.
if (pq221=93)Pcand=999993.
if (pq221=94)Pcand=999994.
if (pq221=95)Pcand=999995.

*臺南市第六選區.
if (pq224=01)Pcand=670601.
if (pq224=02)Pcand=670602.
if (pq224=84)Pcand=670684.
if (pq224=89)Pcand=999989.
if (pq224=91)Pcand=999991.
if (pq224=92)Pcand=999992.
if (pq224=93)Pcand=999993.
if (pq224=94)Pcand=999994.
if (pq224=95)Pcand=999995.

*金門縣.
if (pq95=01)Pcand=280101.
if (pq95=41)Pcand=280141.
if (pq95=84)Pcand=280184.
if (pq95=89)Pcand=999989.
if (pq95=91)Pcand=999991.
if (pq95=92)Pcand=999992.
if (pq95=93)Pcand=999993.
if (pq95=94)Pcand=999994.
if (pq95=95)Pcand=999995.

*連江縣.
if (pq98=01)Pcand=300101.
if (pq98=02)Pcand=300102.
if (pq98=41)Pcand=300141.
if (pq98=89)Pcand=999989.
if (pq98=91)Pcand=999991.
if (pq98=92)Pcand=999992.
if (pq98=93)Pcand=999993.
if (pq98=94)Pcand=999994.
if (pq98=95)Pcand=999995.


*平地原住民.
if (pq245=01)Pcand=690101.
if (pq245=02)Pcand=690102.
if (pq245=03)Pcand=690103.
if (pq245=04)Pcand=690104.
if (pq245=07)Pcand=690107.
if (pq245=09)Pcand=690109.
if (pq245=10)Pcand=690110.
if (pq245=11)Pcand=690111.
if (pq245=12)Pcand=690112.
if (pq245=89)Pcand=999989.
if (pq245=91)Pcand=999991.
if (pq245=92)Pcand=999992.
if (pq245=93)Pcand=999993.
if (pq245=94)Pcand=999994.
if (pq245=95)Pcand=999995.


*山地原住民.
if (pq248=01)Pcand=700101.
if (pq248=02)Pcand=700102.
if (pq248=03)Pcand=700103.
if (pq248=06)Pcand=700106.
if (pq248=08)Pcand=700108.
if (pq248=09)Pcand=700109.
if (pq248=10)Pcand=700110.
if (pq248=11)Pcand=700111.
if (pq248=12)Pcand=700112.
if (pq248=13)Pcand=700113.
if (pq248=89)Pcand=999989.
if (pq248=91)Pcand=999991.
if (pq248=92)Pcand=999992.
if (pq248=93)Pcand=999993.
if (pq248=94)Pcand=999994.
if (pq248=95)Pcand=999995.

var lab Pcand "投票對象".

val lab Pcand
630101 "張斯綱/男/中國國民黨"
630102 "吳思瑤/女/民主進步黨"
630148 "賴宗育/男/人民民主黨"
630171 "陳執中/男/臺灣雙語無法黨"
630173 "張臺勝/男/人民最大黨"
630174 "胡金城/男/人民最大黨"
630184 "許盛鋒/男/無"
630185 "侯漢廷/男/無"
630201 "游淑慧/女/中國國民黨"
630202 "王世堅/男/民主進步黨"
630225 "郭啟源/男/中華統一促進黨"
630273 "何梅娟/女/人民最大黨"
630275 "熊嘉玲/女/制度救世島"
630301 "王鴻薇/女/中國國民黨"
630302 "謝佩芬/女/民主進步黨"
630342 "楊時睿/男/台灣維新"
630371 "陳一郎/男/臺灣雙語無法黨"
630373 "余新造/男/人民最大黨"
630375 "高士恩/男/制度救世島"
630384 "陳源發/男/無"
630401 "李彥秀/女/中國國民黨"
630402 "高嘉瑜/女/民主進步黨"
630417 "吳欣岱/女/台灣基進"
630459 "林秋彤/女/台灣整復師聯盟工黨"
630475 "黃啟彬/男/制度救世島"
630501 "鍾小平/男/中國國民黨"
630502 "吳沛憶/女/民主進步黨"
630538 "許敬民/男/合一行動聯盟"
630576 "張華特/男/台灣麻將最大黨"
630577 "李慧曦/女/司法改革黨"
630578 "蘇諍/男/經濟黨"
630584 "于美人/女/無"
630585 "林志成/男/無"
630586 "陳燕玉/女/無"
630587 "孫智麗/女/無"
630601 "羅智強/男/中國國民黨"
630624 "苗博雅/女/社會民主黨"
630642 "朱翊銘/男/台灣維新"
630671 "崔建章/男/臺灣雙語無法黨"
630675 "張雪卿/女/制度救世島"
630701 "徐巧芯/女/中國國民黨"
630702 "許淑華/女/民主進步黨"
630742 "羅丹/男/台灣維新"
630753 "李承龍/男/中華愛國同心黨"
630784 "陳韋安/男/無"
630801 "賴士葆/男/中國國民黨"
630802 "王閔生/男/民主進步黨"
630841 "張其祿/男/台灣民眾黨"
630842 "劉佩玲/女/台灣維新"
630867 "胡之壯/男/興中同盟會"
630879 "賴宣任/女/小民參政歐巴桑聯盟"
630884 "夏萬浪/男/無"
630885 "張維學/男/無"
650101 "洪孟楷/男/中國國民黨"
650102 "何博文/男/民主進步黨"
650125 "翁藤原/男/中華統一促進黨"
650142 "徐百弟/男/台灣維新"
650175 "游清池/男/制度救世島"
650202 "林淑芬/女/民主進步黨"
650225 "何淯笙/男/中華統一促進黨"
650241 "李有宜/女/台灣民眾黨"
650301 "蔡明堂/男/中國國民黨"
650302 "李坤城/男/民主進步黨"
650384 "陳東雲/男/無"
650385 "蘇卿彥/男/無"
650401 "蔣欣璋/男/中國國民黨"
650402 "吳秉叡/男/民主進步黨"
650475 "邱吉均/男/制度救世島"
650484 "蘇輝湟/男/無"
650485 "洪懿馥/女/無"
650501 "洪佳君/女/中國國民黨"
650502 "蘇巧慧/女/民主進步黨"
650601 "林國春/男/中國國民黨"
650602 "張宏陸/男/民主進步黨"
650677 "黃淑珍/女/司法改革黨"
650701 "葉元之/男/中國國民黨"
650702 "羅致政/男/民主進步黨"
650779 "劉書婷/女/小民參政歐巴桑聯盟"
650801 "張智倫/男/中國國民黨"
650802 "吳崢/男/民主進步黨"
650841 "邱臣遠/男/台灣民眾黨"
650901 "林德福/男/中國國民黨"
650902 "莊銘淵/男/民主進步黨"
650942 "陳愷寧/女/台灣維新"
651001 "林金結/男/中國國民黨"
651002 "吳琪銘/男/民主進步黨"
651073 "孟藹倫/女/人民最大黨"
651080 "袁興/男/復康聯盟黨"
651101 "羅明才/男/中國國民黨"
651102 "曾柏瑜/女/民主進步黨"
651152 "陳聖/男/中華婦女黨"
651173 "張家榛/女/人民最大黨"
651175 "魏趨安/男/制度救世島"
651184 "鄭添泉/男/無"
651201 "廖先翔/男/中國國民黨"
651202 "賴品妤/女/民主進步黨"
651242 "陳長志/男/台灣維新"
651271 "李佳蒨/女/臺灣雙語無法黨"
651284 "黃瑞傳/男/無"
651285 "楊木火/男/無"
680101 "牛煦庭/男/中國國民黨"
680102 "鄭運鵬/男/民主進步黨"
680184 "馬治薇/女/無"
680201 "涂權吉/男/中國國民黨"
680202 "黃世杰/男/民主進步黨"
680225 "陳志豪/男/中華統一促進黨"
680284 "王思玟/男/無"
680301 "魯明哲/男/中國國民黨"
680302 "彭俊豪/男/民主進步黨"
680303 "游智彬/男/新黨"
680375 "戴浙/男/制度救世島"
680379 "徐鶯慈/女/小民參政歐巴桑聯盟"
680401 "萬美玲/女/中國國民黨"
680402 "范綱祥/男/民主進步黨"
680481 "甘乃迪/男/台灣國民黨"
680484 "黃明莉/女/無"
680501 "呂玉玲/女/中國國民黨"
680502 "劉仁照/男/民主進步黨"
680541 "賴香伶/女/台灣民眾黨"
680577 "易乃文/男/司法改革黨"
680601 "邱若華/女/中國國民黨"
680641 "李慕妍/女/台灣民眾黨"
680673 "翁紹庭/女/人民最大黨"
680680 "劉睿宸/男/復康聯盟黨"
680684 "葉堂宇/男/無"
680685 "趙正宇/男/無"
660102 "蔡其昌/男/民主進步黨"
660141 "蔡壁如/女/台灣民眾黨"
660184 "賴信全/男/無"
660185 "劉燈鐘/男/無"
660201 "顏寬恆/男/中國國民黨"
660202 "林靜儀/女/民主進步黨"
660261 "洪麗華/女/司法正義黨"
660284 "紀銘修/男/無"
660301 "楊瓊瓔/女/中國國民黨"
660302 "謝子涵/女/民主進步黨"
660377 "張炯春/男/司法改革黨"
660401 "廖偉翔/男/中國國民黨"
660402 "張廖萬堅/男/民主進步黨"
660471 "李海碩/男/臺灣雙語無法黨"
660472 "林中翊/男/臺灣雙語無法黨"
660485 "陳志彬/男/無"
660501 "黃健豪/男/中國國民黨"
660502 "莊競程/男/民主進步黨"
660525 "林澤培/女/中華統一促進黨"
660571 "謝旻汎/男/臺灣雙語無法黨"
660577 "彭振芳/男/司法改革黨"
660579 "蔡善雯/女/小民參政歐巴桑聯盟"
660584 "苗豐隆/男/無"
660585 "陳維新/女/無"
660601 "羅廷瑋/男/中國國民黨"
660602 "江肇國/男/民主進步黨"
660625 "黃千庭/女/中華統一促進黨"
660684 "賀姿華/女/無"
660685 "紀文清/男/無"
660701 "林家興/男/中國國民黨"
660702 "何欣純/女/民主進步黨"
660777 "林振東/男/司法改革黨"
660801 "江啟臣/男/中國國民黨"
660802 "謝志忠/男/民主進步黨"
670101 "周宏昌/男/中國國民黨"
670102 "賴惠員/女/民主進步黨"
670125 "林芳竹/女/中華統一促進黨"
670180 "蔡承攸/男/復康聯盟黨"
670184 "侯陸太/男/無"
670185 "魏耀乾/男/無"
670202 "郭國文/男/民主進步黨"
670273 "詹秋嫻/女/人民最大黨"
670284 "陳昆和/男/無"
670301 "姚正玉/女/中國國民黨"
670302 "陳亭妃/女/民主進步黨"
670402 "林宜瑾/女/民主進步黨"
670477 "劉清田/男/司法改革黨"
670484 "李全教/男/無"
670502 "林俊憲/男/民主進步黨"
670572 "蕭燐洪/男/臺灣雙語無法黨"
670601 "陳以信/男/中國國民黨"
670602 "王定宇/男/民主進步黨"
670684 "陳永和/男/無"
640102 "邱議瑩/女/民主進步黨"
640141 "曾尹儷/女/台灣民眾黨"
640173 "劉承智/男/人民最大黨"
640184 "林義迪/男/無"
640201 "曹桓榮/男/中國國民黨"
640202 "邱志偉/男/民主進步黨"
640301 "李眉蓁/女/中國國民黨"
640302 "李柏毅/男/民主進步黨"
640376 "郭璽/男/台灣麻將最大黨"
640384 "張正達/男/無"
640385 "陳銓霖/男/無"
640401 "陳若翠/女/中國國民黨"
640402 "林岱樺/女/民主進步黨"
640501 "黃柏霖/男/中國國民黨"
640502 "李昆澤/男/民主進步黨"
640579 "張芳愉/女/小民參政歐巴桑聯盟"
640584 "楊椒喬/男/無"
640601 "陳美雅/女/中國國民黨"
640602 "黃捷/女/民主進步黨"
640644 "郭倍宏/男/喜樂島聯盟"
640701 "鍾易仲/男/中國國民黨"
640702 "許智傑/男/民主進步黨"
640777 "王和平統一/男/司法改革黨"
640784 "洪啟修/男/無"
640801 "李明璇/女/中國國民黨"
640802 "賴瑞隆/男/民主進步黨"
640813 "湛秀英/女/勞動黨"
640877 "李政憲/男/司法改革黨"
040101 "徐欣瑩/女/中國國民黨"
040102 "詹紀緹/女/民主進步黨"
040109 "余筱菁/女/台灣綠黨"
040142 "劉復嵐/男/台灣維新"
040179 "劉台穠/女/小民參政歐巴桑聯盟"
040201 "林思銘/男/中國國民黨"
040202 "曾聖凱/男/民主進步黨"
040219 "王婉諭/女/時代力量"
050102 "康世明/男/民主進步黨"
050184 "陳超明/男/無"
050201 "邱鎮軍/男/中國國民黨"
050284 "曾玟學/男/無"
070101 "阮厚爵/男/中國國民黨"
070102 "陳秀寶/女/民主進步黨"
070184 "蘇群傑/男/無"
070201 "楊曜聰/男/中國國民黨"
070202 "黃秀芳/女/民主進步黨"
070301 "謝衣鳳/女/中國國民黨"
070302 "吳音寧/女/民主進步黨"
070325 "桂麗娜/女/中華統一促進黨"
070384 "洪建興/男/無"
070401 "鄭俊雄/男/中國國民黨"
070402 "陳素月/女/民主進步黨"
070471 "鄭錫懋/男/臺灣雙語無法黨"
070482 "蔡念諶/男/中華文化共和黨"
080101 "馬文君/女/中國國民黨"
080102 "蔡銘軒/男/民主進步黨"
080113 "許文忠/男/勞動黨"
080179 "李圓恩/女/小民參政歐巴桑聯盟"
080184 "林金潭/男/無"
080201 "游顥/男/中國國民黨"
080202 "蔡培慧/女/民主進步黨"
080284 "陳癸佑/男/無"
090101 "丁學忠/男/中國國民黨"
090102 "蘇治芬/女/民主進步黨"
090125 "郭炳宏/男/中華統一促進黨"
090170 "李昭儀/女/台灣革命黨"
090184 "吳炳輝/男/無"
090185 "陳俊龍/男/無"
090201 "邱良閱/男/中國國民黨"
090202 "劉建國/男/民主進步黨"
100101 "詹琬蓁/女/中國國民黨"
100102 "蔡易餘/男/民主進步黨"
100202 "陳冠廷/男/民主進步黨"
100242 "黃一哲/男/台灣維新"
100275 "簡銘傑/男/制度救世島"
100284 "林國慶/男/無"
100285 "廖昱婧/女/無"
130101 "黃明賢/男/中國國民黨"
130102 "鍾佳濱/男/民主進步黨"
130125 "李孟翰/男/中華統一促進黨"
130142 "張庭源/男/台灣維新"
130184 "蔣月惠/女/無"
130185 "曾鈺庭/男/無"
130202 "徐富癸/男/民主進步黨"
130256 "吳媚宮/女/中華聯合黨"
130273 "何秋葺/女/人民最大黨"
130284 "蘇孟淳/男/無"
020101 "黃琤婷/女/中國國民黨"
020102 "陳俊宇/男/民主進步黨"
020117 "林意評/男/台灣基進"
020141 "陳琬惠/女/台灣民眾黨"
020175 "邱介勳/男/制度救世島"
020184 "林錦坤/男/無"
150101 "傅崑萁/男/中國國民黨"
150102 "張美慧/女/民主進步黨"
150175 "周玉梅/女/制度救世島"
150184 "許願神/男/無"
140101 "黃建賓/男/中國國民黨"
140102 "賴坤成/男/民主進步黨"
140179 "黃婉茹/女/小民參政歐巴桑聯盟"
140184 "許瑞貴/男/無"
140185 "劉櫂豪/男/無"
140186 "陳長宏/男/無"
160101 "吳政杰/男/中國國民黨"
160102 "楊曜/男/民主進步黨"
160184 "陳慧娟/女/無"
280101 "陳玉珍/女/中國國民黨"
280141 "尚文凱/女/台灣民眾黨"
280184 "洪和成/男/無"
290101 "陳雪生/男/中國國民黨"
290102 "李問/男/民主進步黨"
290141 "曹爾凱/男/台灣民眾黨"
170101 "林沛祥/男/中國國民黨"
170102 "鄭文婷/女/民主進步黨"
170179 "謝海菁/女/小民參政歐巴桑聯盟"
170181 "邱紹祐/男/家庭基本收入"
170183 "黃傑陽/男/無"
170185 "王醒之/男/無"
180101 "鄭正鈐/男/中國國民黨"
180102 "林志潔/女/民主進步黨"
180119 "邱顯智/男/時代力量"
180175 "趙福龍/男/制度救世島"
180177 "楊清華/男/司法改革黨"
180184 "柯美蘭/女/無"
180185 "王榮德/男/無"
200101 "張秀華/女/中國國民黨"
200102 "王美惠/女/民主進步黨"
200171 "林智勳/男/臺灣雙語無法黨"
200179 "陳玥妗/女/小民參政歐巴桑聯盟"
200180 "蔡松益/男/復康聯盟黨"
200184 "簡明廉/男/無"
690101 "黃仁/男/中國國民黨"
690102 "鄭天財 Sra-Kacaw/男/中國國民黨"
690103 "陳瑩/女/民主進步黨"
690104 "米甘幹-理佛克/男/新黨"
690107 "陳國榮/男/台灣維新"
690109 "陳政宗/男/無"
690110 "忠仁-達祿斯/男/無"
690111 "高美珠/女/無"
690112 "吳建智咖啡哥/男/無"
700101 "孔文吉/男/中國國民黨"
700102 "盧縣一/男/中國國民黨"
700103 "伍麗華 Saidhai-Tahovecahe/女/民主進步黨"
700106 "胡黃廣文/男/台灣民眾黨"
700108 "高畹芯/女/司法改革黨"
700109 "張子孝/男/無"
700110 "高金素梅/女/無"
700111 "林果/女/無"
700112 "林世偉/男/無"
700113 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"   
999989 "未領票"
999991 "忘了"
999992 "沒有投票權"
999993 "沒有去投"
999994 "投廢票"
999995 "拒答".

fre Pcand.

*建立選區投票對象（以政黨歸類）PVT_dtc.
compute Pvt_dtc=Pcand.
recode Pvt_dtc (630101 630201 630301 630401 630501 630601 630701 630801 650101 650301 650401 650501 650601 650701 650801 650901 651001 651101
               651201 680101 680201 680301 680401 680501 680601 660201 660301 660401 660501 660601 660701 660801 670101 670301 670601 640201 
               640301 640401 640501 640601 640701 640801 040101 040201 050201 070101 070201 070301 070401 080101 080201 090101 090201 100101
               130101 020101 150101 140101 160101 280101 290101 170101 180101 200101 690101 690102 700101 700102=01)
              (630102 630202 630302 630402 630502 630702 630802 650102 650202 650302 650402 650502 650602 650702 650802 650902 651002 651102
               651202 680102 680202 680302 680402 680502 660102 660202 660302 660402 660502 660602 660702 660802 670102 670202 670302 670402 
               670502 670602 640102 640202 640302 640402 640502 640602 640702 640802 040102 040202 050102 070102 070202 070302 070402 080102
               080202 090102 090202 100102 100202 130102 130202 020102 150102 140102 160102 290102 170102 180102 200102 690103 700103=02)
              (680303 690104=03)
              (040109=09)
              (640813 080113=13)
              (630417 020117=17)
              (040219 180119=19)
              (630624=24)
              (630225 650125 650225 680225 660525 660625 670125 070325 090125 130125=25)
              (630538=38)
              (630841 650241 650841 680541 680641 660141 640141 020141 280141 290141 700106=41)
              (630342 630642 630742 630842 650142 650942 651242 040142 100242 130142 690107=42)
              (640644=44)
              (630148=48)
              (651152=52)
              (630753=53)
              (130256=56)
              (630459=59)
              (660261=61)
              (630867=67)
              (090170=70)
              (630171 630371 630671 651271 660471 660571 070471 200171 660472 670572=71)
              (630173 630174 630273 630373 651073 651173 680673 670273 640173 130273=73)
              (630275 630375 630475 630675 650175 650475 651175 680375 100275 020175 150175 180175=75)
              (630576 640376=76)
              (630577 650677 680577 660377 660577 660777 670477 640777 640877 180177 700108=77)
              (630578=78)
              (630879 650779 680379 660579 640579 040179 080179 140179 170179 200179=79)
              (651080 680680 670180 200180=80)
              (680481=81)
              (070482=82)
              (170183 170181=83)
              (630184 630185 630384 630584 630585 630586 630587 630784 630884 630885 650384 650385 650484 650485 651184 651284 651285 680184
               680284 680484 680684 680685 660184 660185 660284 660485 660584 660585 660684 660685 670184 670185 670284 670484 670684 640184 
               640384 640385 640584 640784 050184 050284 070184 070384 080184 080284 090184 090185 100284 100285 130184 130185 130285 130284 020184 
               150184 140184 140185 140186 160184 280184 170185 180184 180185 200184 690109 690110 690111 690112 700109 700110 700111 700112=84)              (999989=89)(999991=91)(999992=92)(999993=93)(999994=94)(999995=95) .    

var lab Pvt_dtc "選民區域投票候選人之政黨" .
val lab Pvt_dtc 01 "國民黨"             02 "民進黨"          03 "新黨"               09 "台灣綠黨"         13 "勞動黨"
                17 "台灣基進"           19 "時代力量"        24 "社會民主黨"         25 "中華統一促進黨"   38 "合一行動聯盟"
                41 "台灣民眾黨"         42 "台灣維新"        44 "喜樂島聯盟"         48 "人民民主黨"       52 "中華婦女黨"
                53 "中華愛國同心黨"     56 "中華聯合黨"      59 "台灣整復師聯盟工黨" 61 "司法正義黨"       67 "興中同盟會"
                70 "台灣革命黨"         71 "臺灣雙語無法黨"  73 "人民最大黨"         75 "制度救世島"       76 "台灣麻將最大黨"  
                77 "司法改革黨"         78 "經濟黨"          79 "小民參政歐巴桑聯盟" 80 "復康聯盟黨"       81 "台灣國民黨"      
                82 "中華文化共和黨"     83 "家庭基本收入"    84 "無黨籍"
               89 "未領票"      91"忘了"           92"沒有投票權"         93"沒有去投"      94"投廢票"
               95"拒答".

fre Pvt_dtc.
 

*合併「是不是原本最想投的候選人」.
compute PVTchose=0.

if((PQ27=1) or (PQ30=1) or (PQ33=1) or (PQ36=1) or (PQ39=1) or (PQ42=1) or (PQ45=1) or
   (PQ48=1) or (PQ51=1) or (PQ54=1) or (PQ57=1) or (PQ60=1) or (PQ63=1) or (PQ66=1) or
   (PQ69=1) or (PQ72=1) or (PQ75=1) or (PQ78=1) or (PQ81=1) or (PQ84=1) or (PQ87=1) or
   (PQ90=1) or (PQ93=1) or (PQ96=1) or (PQ99=1) or (PQ102=1) or (PQ105=1) or (PQ108=1) or
   (PQ111=1) or (PQ114=1) or (PQ117=1) or (PQ120=1) or (PQ123=1) or (PQ126=1) or (PQ129=1) or
   (PQ132=1) or (PQ135=1) or (PQ138=1) or (PQ141=1) or (PQ144=1) or (PQ147=1) or (PQ150=1) or
   (PQ153=1) or (PQ156=1) or (PQ159=1) or (PQ162=1) or (PQ165=1) or (PQ168=1) or (PQ171=1) or
   (PQ174=1) or (PQ177=1) or (PQ180=1) or (PQ183=1) or (PQ186=1) or (PQ189=1) or (PQ192=1) or
   (PQ195=1) or (PQ198=1) or (PQ201=1) or (PQ204=1) or (PQ207=1) or (PQ210=1) or (PQ213=1) or
   (PQ216=1) or (PQ219=1) or (PQ222=1) or (PQ225=1) or (PQ228=1) or (PQ231=1) or (PQ234=1) or
   (PQ237=1) or (PQ240=1) or (PQ243=1) or (PQ246=1) or (PQ249=1))pvtchose=1.  
if((PQ27=2) or (PQ30=2) or (PQ33=2) or (PQ36=2) or (PQ39=2) or (PQ42=2) or (PQ45=2) or
   (PQ48=2) or (PQ51=2) or (PQ54=2) or (PQ57=2) or (PQ60=2) or (PQ63=2) or (PQ66=2) or
   (PQ69=2) or (PQ72=2) or (PQ75=2) or (PQ78=2) or (PQ81=2) or (PQ84=2) or (PQ87=2) or
   (PQ90=2) or (PQ93=2) or (PQ96=2) or (PQ99=2) or (PQ102=2) or (PQ105=2) or (PQ108=2) or
   (PQ111=2) or (PQ114=2) or (PQ117=2) or (PQ120=2) or (PQ123=2) or (PQ126=2) or (PQ129=2) or
   (PQ132=2) or (PQ135=2) or (PQ138=2) or (PQ141=2) or (PQ144=2) or (PQ147=2) or (PQ150=2) or
   (PQ153=2) or (PQ156=2) or (PQ159=2) or (PQ162=2) or (PQ165=2) or (PQ168=2) or (PQ171=2) or
   (PQ174=2) or (PQ177=2) or (PQ180=2) or (PQ183=2) or (PQ186=2) or (PQ189=2) or (PQ192=2) or
   (PQ195=2) or (PQ198=2) or (PQ201=2) or (PQ204=2) or (PQ207=2) or (PQ210=2) or (PQ213=2) or
   (PQ216=2) or (PQ219=2) or (PQ222=2) or (PQ225=2) or (PQ228=2) or (PQ231=2) or (PQ234=2) or
   (PQ237=2) or (PQ240=2) or (PQ243=2) or (PQ246=2) or (PQ249=2))pvtchose=2. 
if((PQ27=95) or (PQ30=95) or (PQ33=95) or (PQ36=95) or (PQ39=95) or (PQ42=95) or (PQ45=95) or
   (PQ48=95) or (PQ51=95) or (PQ54=95) or (PQ57=95) or (PQ60=95) or (PQ63=95) or (PQ66=95) or
   (PQ69=95) or (PQ72=95) or (PQ75=95) or (PQ78=95) or (PQ81=95) or (PQ84=95) or (PQ87=95) or
   (PQ90=95) or (PQ93=95) or (PQ96=95) or (PQ99=95) or (PQ102=95) or (PQ105=95) or (PQ108=95) or
   (PQ111=95) or (PQ114=95) or (PQ117=95) or (PQ120=95) or (PQ123=95) or (PQ126=95) or (PQ129=95) or
   (PQ132=95) or (PQ135=95) or (PQ138=95) or (PQ141=95) or (PQ144=95) or (PQ147=95) or (PQ150=95) or
   (PQ153=95) or (PQ156=95) or (PQ159=95) or (PQ162=95) or (PQ165=95) or (PQ168=95) or (PQ171=95) or
   (PQ174=95) or (PQ177=95) or (PQ180=95) or (PQ183=95) or (PQ186=95) or (PQ189=95) or (PQ192=95) or
   (PQ195=95) or (PQ198=95) or (PQ201=95) or (PQ204=95) or (PQ207=95) or (PQ210=95) or (PQ213=95) or
   (PQ216=95) or (PQ219=95) or (PQ222=95) or (PQ225=95) or (PQ228=95) or (PQ231=95) or (PQ234=95) or
   (PQ237=95) or (PQ240=95) or (PQ243=95) or (PQ246=95) or (PQ249=1))pvtchose=95. 

if (pvtchose=0) pvtchose =99.
var lab pvtchose"是不是原本最想投的候選人".
val lab pvtchose 1"是" 2"不是" 95"拒答" 99"跳題".

fre pvtchose .



*建立區域原先想投對象pporiwvc.
compute PPoriwvc=0.

*宜蘭縣.
if (pq28=01)pporiwvc=020101.
if (pq28=02)pporiwvc=020102.
if (pq28=17)pporiwvc=020117.
if (pq28=41)pporiwvc=020141.
if (pq28=75)pporiwvc=020175.
if (pq28=84)pporiwvc=020184.
if (pq28=91)pporiwvc=999991.
if (pq28=92)pporiwvc=999992.
if (pq28=95)pporiwvc=999995.


*桃園市第一選區.
if (pq229=01)pporiwvc=680101.
if (pq229=02)pporiwvc=680102.
if (pq229=84)pporiwvc=680184.
if (pq229=91)pporiwvc=999991.
if (pq229=92)pporiwvc=999992.
if (pq229=95)pporiwvc=999995.


*桃園市第二選區.
if (pq232=01)pporiwvc=680201.
if (pq232=02)pporiwvc=680202.
if (pq232=25)pporiwvc=680225.
if (pq232=84)pporiwvc=680284.
if (pq232=91)pporiwvc=999991.
if (pq232=92)pporiwvc=999992.
if (pq232=95)pporiwvc=999995.


*桃園市第三選區.
if (pq235=01)pporiwvc=680301.
if (pq235=02)pporiwvc=680302.
if (pq235=03)pporiwvc=680303.
if (pq235=75)pporiwvc=680375.
if (pq235=79)pporiwvc=680379.
if (pq235=91)pporiwvc=999991.
if (pq235=92)pporiwvc=999992.
if (pq235=95)pporiwvc=999995.

*桃園市第四選區.
if (pq238=01)pporiwvc=680401.
if (pq238=02)pporiwvc=680402.
if (pq238=81)pporiwvc=680481.
if (pq238=84)pporiwvc=680484.
if (pq238=91)pporiwvc=999991.
if (pq238=92)pporiwvc=999992.
if (pq238=95)pporiwvc=999995.

*桃園市第五選區.
if (pq241=01)pporiwvc=680501.
if (pq241=02)pporiwvc=680502.
if (pq241=41)pporiwvc=680541.
if (pq241=77)pporiwvc=680577.
if (pq241=91)pporiwvc=999991.
if (pq241=92)pporiwvc=999992.
if (pq241=95)pporiwvc=999995.


*桃園市第六選區.
if (pq244=01)pporiwvc=680601.
if (pq244=41)pporiwvc=680641.
if (pq244=73)pporiwvc=680673.
if (pq244=80)pporiwvc=680680.
if (pq244=84)pporiwvc=680684.
if (pq244=85)pporiwvc=680685.
if (pq244=91)pporiwvc=999991.
if (pq244=92)pporiwvc=999992.
if (pq244=95)pporiwvc=999995.

*新竹縣第一選區.   
if (pq31=01)pporiwvc=040101.
if (pq31=02)pporiwvc=040102.
if (pq31=09)pporiwvc=040109.
if (pq31=42)pporiwvc=040142.
if (pq31=79)pporiwvc=040179.
if (pq31=91)pporiwvc=999991.
if (pq31=92)pporiwvc=999992.
if (pq31=95)pporiwvc=999995.

*新竹縣第二選區.   
if (pq34=01)pporiwvc=040201.
if (pq34=02)pporiwvc=040202.
if (pq34=19)pporiwvc=040219.
if (pq34=91)pporiwvc=999991.
if (pq34=92)pporiwvc=999992.
if (pq34=95)pporiwvc=999995.

*苗栗縣第一選區.   
if (pq37=02)pporiwvc=050102.
if (pq37=84)pporiwvc=050184.
if (pq37=91)pporiwvc=999991.
if (pq37=92)pporiwvc=999992.
if (pq37=95)pporiwvc=999995.

*苗栗縣第二選區.
if (pq40=01)pporiwvc=050201.
if (pq40=84)pporiwvc=050284.
if (pq40=91)pporiwvc=999991
if (pq40=92)pporiwvc=999992.
if (pq40=95)pporiwvc=999995.

*彰化縣第一選區.   
if (pq43=01)pporiwvc=070101.
if (pq43=02)pporiwvc=070102.
if (pq43=84)pporiwvc=070184.
if (pq43=91)pporiwvc=999991.
if (pq43=92)pporiwvc=999992.
if (pq43=95)pporiwvc=999995.

*彰化縣第二選區.
if (pq46=01)pporiwvc=070201.
if (pq46=02)pporiwvc=070202.
if (pq46=91)pporiwvc=999991.
if (pq46=92)pporiwvc=999992.
if (pq46=95)pporiwvc=999995.


*彰化縣第三選區.   
if (pq49=01)pporiwvc=070301.
if (pq49=02)pporiwvc=070302.
if (pq49=25)pporiwvc=070325.
if (pq49=84)pporiwvc=070384.
if (pq49=91)pporiwvc=999991.
if (pq49=92)pporiwvc=999992.
if (pq49=95)pporiwvc=999995.


*彰化縣第四選區.
if (pq52=01)pporiwvc=070401.
if (pq52=02)pporiwvc=070402.
if (pq52=71)pporiwvc=070471.
if (pq52=82)pporiwvc=070482.
if (pq52=91)pporiwvc=999991.
if (pq52=92)pporiwvc=999992.
if (pq52=95)pporiwvc=999995.

*南投縣第一選區.   
if (pq55=01)pporiwvc=080101.
if (pq55=02)pporiwvc=080102.
if (pq55=13)pporiwvc=080113.
if (pq55=79)pporiwvc=080179.
if (pq55=84)pporiwvc=080184.
if (pq55=91)pporiwvc=999991.
if (pq55=92)pporiwvc=999992.
if (pq55=95)pporiwvc=999995.

*南投縣第二選區.
if (pq58=01)pporiwvc=080101.
if (pq58=02)pporiwvc=080102.
if (pq58=84)pporiwvc=080184.
if (pq58=91)pporiwvc=999991.
if (pq58=92)pporiwvc=080192.
if (pq58=95)pporiwvc=999995.



*雲林縣第一選區.   
if (pq61=01)pporiwvc=090101.
if (pq61=02)pporiwvc=090102.
if (pq61=25)pporiwvc=090125.
if (pq61=70)pporiwvc=090170.
if (pq61=84)pporiwvc=090184.
if (pq61=85)pporiwvc=090185.
if (pq61=91)pporiwvc=999991.
if (pq61=92)pporiwvc=999992.
if (pq61=95)pporiwvc=999995.

*雲林縣第二選區.
if (pq64=01)pporiwvc=090201.
if (pq64=02)pporiwvc=090202.
if (pq64=91)pporiwvc=999991.
if (pq64=92)pporiwvc=999992.
if (pq64=95)pporiwvc=999995.

*嘉義縣第一選區.   
if (pq67=01)pporiwvc=100101.
if (pq67=02)pporiwvc=100102.
if (pq67=91)pporiwvc=999991.
if (pq67=92)pporiwvc=999992.
if (pq67=95)pporiwvc=999995.

*嘉義縣第二選區.
if (pq70=02)pporiwvc=100202.
if (pq70=42)pporiwvc=100242.
if (pq70=75)pporiwvc=100275.
if (pq70=84)pporiwvc=100284.
if (pq70=85)pporiwvc=100285.
if (pq70=91)pporiwvc=999991.
if (pq70=92)pporiwvc=999992.
if (pq70=95)pporiwvc=999995.


*屏東縣第一選區.   
if (pq73=01)pporiwvc=130101.
if (pq73=02)pporiwvc=130102.
if (pq73=25)pporiwvc=130125.
if (pq73=42)pporiwvc=130142.
if (pq73=84)pporiwvc=130184.
if (pq73=85)pporiwvc=130185.
if (pq73=91)pporiwvc=999991.
if (pq73=92)pporiwvc=999992.
if (pq73=95)pporiwvc=999995.

*屏東縣第二選區.
if (pq76=02)pporiwvc=130202.
if (pq76=56)pporiwvc=130256.
if (pq76=73)pporiwvc=130273.
if (pq76=84)pporiwvc=130284.
if (pq76=91)pporiwvc=999991.
if (pq76=92)pporiwvc=999992.
if (pq76=95)pporiwvc=999995.

*臺東縣.   
if (pq79=01)pporiwvc=140101.
if (pq79=02)pporiwvc=140102.
if (pq79=79)pporiwvc=140179.
if (pq79=84)pporiwvc=140184.
if (pq79=85)pporiwvc=140185.
if (pq79=86)pporiwvc=140186.
if (pq79=91)pporiwvc=999991.
if (pq79=92)pporiwvc=999992.
if (pq79=95)pporiwvc=999995.


*花蓮縣.   
if (pq82=01)pporiwvc=150101.
if (pq82=02)pporiwvc=150102.
if (pq82=75)pporiwvc=150175.
if (pq82=84)pporiwvc=150184.
if (pq82=91)pporiwvc=999991.
if (pq82=92)pporiwvc=999992.
if (pq82=95)pporiwvc=999995.


*澎湖縣.   
if (pq85=01)pporiwvc=160101.
if (pq85=02)pporiwvc=160102.
if (pq85=84)pporiwvc=160184.
if (pq85=91)pporiwvc=999991.
if (pq85=92)pporiwvc=999992.
if (pq85=95)pporiwvc=999995.

*基隆市.   
if (pq88=01)pporiwvc=170101.
if (pq88=02)pporiwvc=170102.
if (pq88=79)pporiwvc=170179.
if (pq88=81)pporiwvc=170181.
if (pq88=83)pporiwvc=170183.
if (pq88=85)pporiwvc=170185.
if (pq88=91)pporiwvc=999991.
if (pq88=92)pporiwvc=999992.
if (pq88=95)pporiwvc=999995.

*新竹市.   
if (pq91=01)pporiwvc=180101.
if (pq91=02)pporiwvc=180102.
if (pq91=19)pporiwvc=180119.
if (pq91=75)pporiwvc=180175.
if (pq91=77)pporiwvc=180177.
if (pq91=84)pporiwvc=180184.
if (pq91=85)pporiwvc=180185.
if (pq91=91)pporiwvc=999991.
if (pq91=92)pporiwvc=999992.
if (pq91=95)pporiwvc=999995.


*嘉義市.
if (pq94=01)pporiwvc=200101.
if (pq94=02)pporiwvc=200102.
if (pq94=71)pporiwvc=200171.
if (pq94=79)pporiwvc=200179.
if (pq94=80)pporiwvc=200180.
if (pq94=84)pporiwvc=200184.
if (pq94=91)pporiwvc=999991.
if (pq94=92)pporiwvc=999992.
if (pq94=95)pporiwvc=999995.

*臺北市第一選區.
if (pq103=01)pporiwvc=630101.
if (pq103=02)pporiwvc=630102.
if (pq103=48)pporiwvc=630148.
if (pq103=71)pporiwvc=630171.
if (pq103=73)pporiwvc=630173.
if (pq103=74)pporiwvc=630174.
if (pq103=84)pporiwvc=630184.
if (pq103=85)pporiwvc=630185.
if (pq103=91)pporiwvc=999991.
if (pq103=92)pporiwvc=999992.
if (pq103=95)pporiwvc=999995.

*臺北市第二選區.
if (pq106=01)pporiwvc=630201.
if (pq106=02)pporiwvc=630202.
if (pq106=25)pporiwvc=630225.
if (pq106=73)pporiwvc=630273.
if (pq106=75)pporiwvc=630275.
if (pq106=91)pporiwvc=999991.
if (pq106=92)pporiwvc=999992.
if (pq106=95)pporiwvc=999995.


*臺北市第三選區.
if (pq109=01)pporiwvc=630301.
if (pq109=02)pporiwvc=630302.
if (pq109=42)pporiwvc=630342.
if (pq109=71)pporiwvc=630371.
if (pq109=73)pporiwvc=630373.
if (pq109=75)pporiwvc=630375.
if (pq109=84)pporiwvc=630384.
if (pq109=91)pporiwvc=999991.
if (pq109=92)pporiwvc=999992.
if (pq109=95)pporiwvc=999995.

*臺北市第四選區.
if (pq112=01)pporiwvc=630401.
if (pq112=02)pporiwvc=630402.
if (pq112=17)pporiwvc=630417.
if (pq112=59)pporiwvc=630459.
if (pq112=75)pporiwvc=630475.
if (pq112=91)pporiwvc=999991.
if (pq112=92)pporiwvc=999992.
if (pq112=95)pporiwvc=999995.

*臺北市第五選區.
if (pq115=01)pporiwvc=630501.
if (pq115=02)pporiwvc=630502.
if (pq115=38)pporiwvc=630538.
if (pq115=76)pporiwvc=630576.
if (pq115=77)pporiwvc=630577.
if (pq115=78)pporiwvc=630578.
if (pq115=84)pporiwvc=630584.
if (pq115=85)pporiwvc=630585.
if (pq115=86)pporiwvc=630586.
if (pq115=91)pporiwvc=999991.
if (pq115=92)pporiwvc=999992.
if (pq115=95)pporiwvc=999995.


*臺北市第六選區.
if (pq118=01)pporiwvc=630601.
if (pq118=24)pporiwvc=630624.
if (pq118=42)pporiwvc=630642.
if (pq118=71)pporiwvc=630671.
if (pq118=75)pporiwvc=630675.
if (pq118=91)pporiwvc=999991.
if (pq118=92)pporiwvc=999992.
if (pq118=95)pporiwvc=999995.


*臺北市第七選區.
if (pq121=01)pporiwvc=630701.
if (pq121=02)pporiwvc=630702.
if (pq121=42)pporiwvc=630742.
if (pq121=53)pporiwvc=630753.
if (pq121=84)pporiwvc=630784.
if (pq121=91)pporiwvc=999991.
if (pq121=92)pporiwvc=999992.
if (pq121=95)pporiwvc=999995.


*臺北市第八選區.
if (pq124=01)pporiwvc=630801.
if (pq124=02)pporiwvc=630802.
if (pq124=41)pporiwvc=630841.
if (pq124=42)pporiwvc=630842.
if (pq124=67)pporiwvc=630867.
if (pq124=79)pporiwvc=630879.
if (pq124=84)pporiwvc=630884.
if (pq124=85)pporiwvc=630885.
if (pq124=91)pporiwvc=999991.
if (pq124=92)pporiwvc=999992.
if (pq124=95)pporiwvc=999995.

*高雄市第一選區.
if (pq127=02)pporiwvc=640102.
if (pq127=41)pporiwvc=640141.
if (pq127=73)pporiwvc=640173.
if (pq127=84)pporiwvc=640184.
if (pq127=91)pporiwvc=999991.
if (pq127=92)pporiwvc=999992.
if (pq127=95)pporiwvc=999995.


*高雄市第二選區.
if (pq130=01)pporiwvc=640201.
if (pq130=02)pporiwvc=640202.
if (pq130=91)pporiwvc=999991.
if (pq130=92)pporiwvc=999992.
if (pq130=95)pporiwvc=999995.

*高雄市第三選區.
if (pq133=01)pporiwvc=640301.
if (pq133=02)pporiwvc=640302.
if (pq133=76)pporiwvc=640376.
if (pq133=84)pporiwvc=640384.
if (pq133=85)pporiwvc=640385.
if (pq133=91)pporiwvc=999991.
if (pq133=92)pporiwvc=999992.
if (pq133=95)pporiwvc=999995.

*高雄市第四選區.
if (pq136=01)pporiwvc=640401.
if (pq136=02)pporiwvc=640402.
if (pq136=91)pporiwvc=999991.
if (pq136=92)pporiwvc=999992.
if (pq136=95)pporiwvc=999995.

*高雄市第五選區.
if (pq139=01)pporiwvc=640501.
if (pq139=02)pporiwvc=640502.
if (pq139=79)pporiwvc=640579.
if (pq139=84)pporiwvc=640584.
if (pq139=91)pporiwvc=999991.
if (pq137=92)pporiwvc=999992.
if (pq137=95)pporiwvc=999995.


*高雄市第六選區.
if (pq142=01)pporiwvc=640601.
if (pq142=02)pporiwvc=640602.
if (pq142=44)pporiwvc=640644.
if (pq142=91)pporiwvc=999991.
if (pq142=92)pporiwvc=999992.
if (pq142=95)pporiwvc=999995.


*高雄市第七選區.
if (pq145=01)pporiwvc=640701.
if (pq145=02)pporiwvc=640702.
if (pq145=77)pporiwvc=640777.
if (pq145=84)pporiwvc=640784.
if (pq145=91)pporiwvc=999991.
if (pq145=92)pporiwvc=999992.
if (pq145=95)pporiwvc=999995.


*高雄市第八選區.
if (pq148=01)pporiwvc=640801.
if (pq148=02)pporiwvc=640802.
if (pq148=13)pporiwvc=640813.
if (pq148=77)pporiwvc=640877.
if (pq148=91)pporiwvc=999991.
if (pq148=92)pporiwvc=999992.
if (pq148=95)pporiwvc=999995.

*新北市第一選區.
if (pq151=01)pporiwvc=650101.
if (pq151=02)pporiwvc=650102.
if (pq151=25)pporiwvc=650125.
if (pq151=42)pporiwvc=650142.
if (pq151=75)pporiwvc=650175.
if (pq151=91)pporiwvc=999991.
if (pq151=92)pporiwvc=999992.
if (pq151=95)pporiwvc=999995.


*新北市第二選區.
if (pq154=02)pporiwvc=650202.
if (pq154=25)pporiwvc=650225.
if (pq154=41)pporiwvc=650241.
if (pq154=91)pporiwvc=999991.
if (pq154=92)pporiwvc=999992.
if (pq154=95)pporiwvc=999995.


*新北市第三選區.
if (pq157=01)pporiwvc=650301.
if (pq157=02)pporiwvc=650302.
if (pq157=84)pporiwvc=650384.
if (pq157=85)pporiwvc=650385.
if (pq157=91)pporiwvc=999991.
if (pq157=92)pporiwvc=999992.
if (pq157=95)pporiwvc=999995.

*新北市第四選區.
if (pq160=01)pporiwvc=650401.
if (pq160=02)pporiwvc=650402.
if (pq160=75)pporiwvc=650475.
if (pq160=84)pporiwvc=650484.
if (pq160=85)pporiwvc=650485.
if (pq160=91)pporiwvc=999991.
if (pq160=92)pporiwvc=999992.
if (pq160=95)pporiwvc=999995.

*新北市第五選區.
if (pq163=01)pporiwvc=650501.
if (pq163=02)pporiwvc=650502.
if (pq163=91)pporiwvc=999991.
if (pq163=92)pporiwvc=999992.
if (pq163=95)pporiwvc=999995.

*新北市第六選區.
if (pq166=01)pporiwvc=650601.
if (pq166=02)pporiwvc=650602.
if (pq166=07)pporiwvc=650607.
if (pq166=91)pporiwvc=999991.
if (pq166=92)pporiwvc=999992.
if (pq166=95)pporiwvc=999995.


*新北市第七選區.
if (pq169=01)pporiwvc=650701.
if (pq169=02)pporiwvc=650702.
if (pq169=79)pporiwvc=650779.
if (pq169=91)pporiwvc=999991.
if (pq169=92)pporiwvc=999992.
if (pq169=95)pporiwvc=999995.


*新北市第八選區.
if (pq172=01)pporiwvc=650801.
if (pq172=02)pporiwvc=650802.
if (pq172=41)pporiwvc=650841.
if (pq172=91)pporiwvc=999991.
if (pq172=92)pporiwvc=999992.
if (pq172=95)pporiwvc=999995.


*新北市第九選區.
if (pq175=01)pporiwvc=650901.
if (pq175=02)pporiwvc=650902.
if (pq175=42)pporiwvc=650942.
if (pq175=91)pporiwvc=999991.
if (pq175=92)pporiwvc=999992.
if (pq175=95)pporiwvc=999995.

*新北市第十選區.
if (pq178=01)pporiwvc=651001.
if (pq178=02)pporiwvc=651002.
if (pq178=73)pporiwvc=651073.
if (pq178=80)pporiwvc=651080.
if (pq178=91)pporiwvc=999991.
if (pq178=92)pporiwvc=999992.
if (pq178=95)pporiwvc=999995.

*新北市第十一選區.
if (pq181=01)pporiwvc=651101.
if (pq181=02)pporiwvc=651102.
if (pq181=52)pporiwvc=651152.
if (pq181=73)pporiwvc=651173.
if (pq181=75)pporiwvc=651175.
if (pq181=84)pporiwvc=651184.
if (pq181=91)pporiwvc=999991.
if (pq181=92)pporiwvc=999992.
if (pq181=95)pporiwvc=999995.


*新北市第十二選區.
if (pq184=01)pporiwvc=651201.
if (pq184=02)pporiwvc=651202.
if (pq184=42)pporiwvc=651242.
if (pq184=71)pporiwvc=651271.
if (pq184=84)pporiwvc=651284.
if (pq184=85)pporiwvc=651285.
if (pq184=91)pporiwvc=999991.
if (pq184=92)pporiwvc=999992.
if (pq184=95)pporiwvc=999995.

*臺中市第一選區.
if (pq187=01)pporiwvc=660101.
if (pq187=02)pporiwvc=660102.
if (pq187=84)pporiwvc=660184.
if (pq187=85)pporiwvc=660185.
if (pq187=91)pporiwvc=999991.
if (pq187=92)pporiwvc=999992.
if (pq187=95)pporiwvc=999995.


*臺中市第二選區.
if (pq190=01)pporiwvc=660201.
if (pq190=02)pporiwvc=660202.
if (pq190=61)pporiwvc=660261.
if (pq190=84)pporiwvc=660284.
if (pq190=91)pporiwvc=999991.
if (pq190=92)pporiwvc=999992.
if (pq190=95)pporiwvc=999995.


*臺中市第三選區.
if (pq193=01)pporiwvc=660301.
if (pq193=02)pporiwvc=660302.
if (pq193=77)pporiwvc=660377.
if (pq193=91)pporiwvc=999991.
if (pq193=92)pporiwvc=999992.
if (pq193=95)pporiwvc=999995.

*臺中市第四選區.
if (pq196=01)pporiwvc=660401.
if (pq196=02)pporiwvc=660402.
if (pq196=71)pporiwvc=660471.
if (pq196=72)pporiwvc=660472.
if (pq196=85)pporiwvc=660485.
if (pq196=91)pporiwvc=999991.
if (pq196=92)pporiwvc=999992.
if (pq196=95)pporiwvc=999995.

*臺中市第五選區.
if (pq199=01)pporiwvc=660501.
if (pq199=02)pporiwvc=660502.
if (pq199=25)pporiwvc=660525.
if (pq199=71)pporiwvc=660571.
if (pq199=77)pporiwvc=660577.
if (pq199=79)pporiwvc=660579.
if (pq199=84)pporiwvc=660584.
if (pq199=85)pporiwvc=660585.
if (pq199=91)pporiwvc=999991.
if (pq199=92)pporiwvc=999992.
if (pq199=95)pporiwvc=999995.


*臺中市第六選區.
if (pq202=01)pporiwvc=660601.
if (pq202=02)pporiwvc=660602.
if (pq202=25)pporiwvc=660625.
if (pq202=84)pporiwvc=660684.
if (pq202=85)pporiwvc=660685.
if (pq202=91)pporiwvc=999991.
if (pq202=92)pporiwvc=999992.
if (pq202=95)pporiwvc=999995.


*臺中市第七選區.
if (pq205=01)pporiwvc=660701.
if (pq205=02)pporiwvc=660702.
if (pq205=77)pporiwvc=660777.
if (pq205=92)pporiwvc=999992.
if (pq205=91)pporiwvc=999991.
if (pq205=95)pporiwvc=999995.
       

*臺中市第八選區.
if (pq208=01)pporiwvc=660801.
if (pq208=02)pporiwvc=660802.
if (pq208=91)pporiwvc=999991.
if (pq208=92)pporiwvc=999992.
if (pq208=95)pporiwvc=999995.

*臺南市第一選區.
if (pq211=01)pporiwvc=670101.
if (pq211=02)pporiwvc=670102.
if (pq211=25)pporiwvc=670125.
if (pq211=80)pporiwvc=670180.
if (pq211=84)pporiwvc=670184.
if (pq211=85)pporiwvc=670185.
if (pq211=91)pporiwvc=999991.
if (pq211=92)pporiwvc=999992.
if (pq211=95)pporiwvc=999995.


*臺南市第二選區.
if (pq214=02)pporiwvc=670202.
if (pq214=73)pporiwvc=670273.
if (pq214=84)pporiwvc=670284.
if (pq214=91)pporiwvc=999991.
if (pq214=92)pporiwvc=999992.
if (pq214=95)pporiwvc=999995.


*臺南市第三選區.
if (pq217=01)pporiwvc=670301.
if (pq217=02)pporiwvc=670302.
if (pq217=91)pporiwvc=999991.
if (pq217=92)pporiwvc=999992.
if (pq217=95)pporiwvc=999995.

*臺南市第四選區.
if (pq220=02)pporiwvc=670402.
if (pq220=77)pporiwvc=670477.
if (pq220=84)pporiwvc=670484.
if (pq220=91)pporiwvc=999991.
if (pq220=92)pporiwvc=999992.
if (pq220=95)pporiwvc=999995.

*臺南市第五選區.
if (pq223=02)pporiwvc=670602.
if (pq223=72)pporiwvc=670672.
if (pq223=91)pporiwvc=999991.
if (pq223=92)pporiwvc=999992.
if (pq223=95)pporiwvc=999995.

*臺南市第六選區.
if (pq226=01)pporiwvc=670601.
if (pq226=02)pporiwvc=670602.
if (pq226=84)pporiwvc=670684.
if (pq226=91)pporiwvc=999991.
if (pq226=92)pporiwvc=999992.
if (pq226=95)pporiwvc=999995.


*金門縣.
if (pq97=01)pporiwvc=280101.
if (pq97=41)pporiwvc=280141.
if (pq97=84)pporiwvc=280184.
if (pq97=91)pporiwvc=999991.
if (pq97=92)pporiwvc=999992.
if (pq97=95)pporiwvc=999995.

*連江縣.
if (pq100=01)pporiwvc=300101.
if (pq100=02)pporiwvc=300102.
if (pq100=41)pporiwvc=300141.
if (pq100=91)pporiwvc=999991.
if (pq100=92)pporiwvc=999992.
if (pq100=95)pporiwvc=999995.

*平地原住民.
if (pq247=01)pporiwvc=690101.
if (pq247=02)pporiwvc=690102.
if (pq247=03)pporiwvc=690103.
if (pq247=04)pporiwvc=690104.
if (pq247=07)pporiwvc=690107.
if (pq247=09)pporiwvc=690109.
if (pq247=10)pporiwvc=690110.
if (pq247=11)pporiwvc=690111.
if (pq247=12)pporiwvc=690112.
if (pq247=91)pporiwvc=999991.
if (pq247=92)pporiwvc=999992.
if (pq247=95)pporiwvc=999995.


*山地原住民.
if (pq250=01)pporiwvc=700101.
if (pq250=02)pporiwvc=700102.
if (pq250=03)pporiwvc=700103.
if (pq250=06)pporiwvc=700106.
if (pq250=08)pporiwvc=700108.
if (pq250=09)pporiwvc=700109.
if (pq250=10)pporiwvc=700110.
if (pq250=11)pporiwvc=700111.
if (pq250=12)pporiwvc=700112.
if (pq250=13)pporiwvc=700113.
if (pq250=91)pporiwvc=999991.
if (pq250=92)pporiwvc=999992.
if (pq250=95)pporiwvc=999995.

recode pporiwvc (0=999999)(else=copy).

var lab pporiwvc "區域原先想投對象".
val lab pporiwvc
630101 "張斯綱/男/中國國民黨"
630102 "吳思瑤/女/民主進步黨"
630148 "賴宗育/男/人民民主黨"
630171 "陳執中/男/臺灣雙語無法黨"
630173 "張臺勝/男/人民最大黨"
630174 "胡金城/男/人民最大黨"
630184 "許盛鋒/男/無"
630185 "侯漢廷/男/無"
630201 "游淑慧/女/中國國民黨"
630202 "王世堅/男/民主進步黨"
630225 "郭啟源/男/中華統一促進黨"
630273 "何梅娟/女/人民最大黨"
630275 "熊嘉玲/女/制度救世島"
630301 "王鴻薇/女/中國國民黨"
630302 "謝佩芬/女/民主進步黨"
630342 "楊時睿/男/台灣維新"
630371 "陳一郎/男/臺灣雙語無法黨"
630373 "余新造/男/人民最大黨"
630375 "高士恩/男/制度救世島"
630384 "陳源發/男/無"
630401 "李彥秀/女/中國國民黨"
630402 "高嘉瑜/女/民主進步黨"
630417 "吳欣岱/女/台灣基進"
630459 "林秋彤/女/台灣整復師聯盟工黨"
630475 "黃啟彬/男/制度救世島"
630501 "鍾小平/男/中國國民黨"
630502 "吳沛憶/女/民主進步黨"
630538 "許敬民/男/合一行動聯盟"
630576 "張華特/男/台灣麻將最大黨"
630577 "李慧曦/女/司法改革黨"
630578 "蘇諍/男/經濟黨"
630584 "于美人/女/無"
630585 "林志成/男/無"
630586 "陳燕玉/女/無"
630587 "孫智麗/女/無"
630601 "羅智強/男/中國國民黨"
630624 "苗博雅/女/社會民主黨"
630642 "朱翊銘/男/台灣維新"
630671 "崔建章/男/臺灣雙語無法黨"
630675 "張雪卿/女/制度救世島"
630701 "徐巧芯/女/中國國民黨"
630702 "許淑華/女/民主進步黨"
630742 "羅丹/男/台灣維新"
630753 "李承龍/男/中華愛國同心黨"
630784 "陳韋安/男/無"
630801 "賴士葆/男/中國國民黨"
630802 "王閔生/男/民主進步黨"
630841 "張其祿/男/台灣民眾黨"
630842 "劉佩玲/女/台灣維新"
630867 "胡之壯/男/興中同盟會"
630879 "賴宣任/女/小民參政歐巴桑聯盟"
630884 "夏萬浪/男/無"
630885 "張維學/男/無"
650101 "洪孟楷/男/中國國民黨"
650102 "何博文/男/民主進步黨"
650125 "翁藤原/男/中華統一促進黨"
650142 "徐百弟/男/台灣維新"
650175 "游清池/男/制度救世島"
650202 "林淑芬/女/民主進步黨"
650225 "何淯笙/男/中華統一促進黨"
650241 "李有宜/女/台灣民眾黨"
650301 "蔡明堂/男/中國國民黨"
650302 "李坤城/男/民主進步黨"
650384 "陳東雲/男/無"
650385 "蘇卿彥/男/無"
650401 "蔣欣璋/男/中國國民黨"
650402 "吳秉叡/男/民主進步黨"
650475 "邱吉均/男/制度救世島"
650484 "蘇輝湟/男/無"
650485 "洪懿馥/女/無"
650501 "洪佳君/女/中國國民黨"
650502 "蘇巧慧/女/民主進步黨"
650601 "林國春/男/中國國民黨"
650602 "張宏陸/男/民主進步黨"
650677 "黃淑珍/女/司法改革黨"
650701 "葉元之/男/中國國民黨"
650702 "羅致政/男/民主進步黨"
650779 "劉書婷/女/小民參政歐巴桑聯盟"
650801 "張智倫/男/中國國民黨"
650802 "吳崢/男/民主進步黨"
650841 "邱臣遠/男/台灣民眾黨"
650901 "林德福/男/中國國民黨"
650902 "莊銘淵/男/民主進步黨"
650942 "陳愷寧/女/台灣維新"
651001 "林金結/男/中國國民黨"
651002 "吳琪銘/男/民主進步黨"
651073 "孟藹倫/女/人民最大黨"
651080 "袁興/男/復康聯盟黨"
651101 "羅明才/男/中國國民黨"
651102 "曾柏瑜/女/民主進步黨"
651152 "陳聖/男/中華婦女黨"
651173 "張家榛/女/人民最大黨"
651175 "魏趨安/男/制度救世島"
651184 "鄭添泉/男/無"
651201 "廖先翔/男/中國國民黨"
651202 "賴品妤/女/民主進步黨"
651242 "陳長志/男/台灣維新"
651271 "李佳蒨/女/臺灣雙語無法黨"
651284 "黃瑞傳/男/無"
651285 "楊木火/男/無"
680101 "牛煦庭/男/中國國民黨"
680102 "鄭運鵬/男/民主進步黨"
680184 "馬治薇/女/無"
680201 "涂權吉/男/中國國民黨"
680202 "黃世杰/男/民主進步黨"
680225 "陳志豪/男/中華統一促進黨"
680284 "王思玟/男/無"
680301 "魯明哲/男/中國國民黨"
680302 "彭俊豪/男/民主進步黨"
680303 "游智彬/男/新黨"
680375 "戴浙/男/制度救世島"
680379 "徐鶯慈/女/小民參政歐巴桑聯盟"
680401 "萬美玲/女/中國國民黨"
680402 "范綱祥/男/民主進步黨"
680481 "甘乃迪/男/台灣國民黨"
680484 "黃明莉/女/無"
680501 "呂玉玲/女/中國國民黨"
680502 "劉仁照/男/民主進步黨"
680541 "賴香伶/女/台灣民眾黨"
680577 "易乃文/男/司法改革黨"
680601 "邱若華/女/中國國民黨"
680641 "李慕妍/女/台灣民眾黨"
680673 "翁紹庭/女/人民最大黨"
680680 "劉睿宸/男/復康聯盟黨"
680684 "葉堂宇/男/無"
680685 "趙正宇/男/無"
660102 "蔡其昌/男/民主進步黨"
660141 "蔡壁如/女/台灣民眾黨"
660184 "賴信全/男/無"
660185 "劉燈鐘/男/無"
660201 "顏寬恆/男/中國國民黨"
660202 "林靜儀/女/民主進步黨"
660261 "洪麗華/女/司法正義黨"
660284 "紀銘修/男/無"
660301 "楊瓊瓔/女/中國國民黨"
660302 "謝子涵/女/民主進步黨"
660377 "張炯春/男/司法改革黨"
660401 "廖偉翔/男/中國國民黨"
660402 "張廖萬堅/男/民主進步黨"
660471 "李海碩/男/臺灣雙語無法黨"
660472 "林中翊/男/臺灣雙語無法黨"
660485 "陳志彬/男/無"
660501 "黃健豪/男/中國國民黨"
660502 "莊競程/男/民主進步黨"
660525 "林澤培/女/中華統一促進黨"
660571 "謝旻汎/男/臺灣雙語無法黨"
660577 "彭振芳/男/司法改革黨"
660579 "蔡善雯/女/小民參政歐巴桑聯盟"
660584 "苗豐隆/男/無"
660585 "陳維新/女/無"
660601 "羅廷瑋/男/中國國民黨"
660602 "江肇國/男/民主進步黨"
660625 "黃千庭/女/中華統一促進黨"
660684 "賀姿華/女/無"
660685 "紀文清/男/無"
660701 "林家興/男/中國國民黨"
660702 "何欣純/女/民主進步黨"
660777 "林振東/男/司法改革黨"
660801 "江啟臣/男/中國國民黨"
660802 "謝志忠/男/民主進步黨"
670101 "周宏昌/男/中國國民黨"
670102 "賴惠員/女/民主進步黨"
670125 "林芳竹/女/中華統一促進黨"
670180 "蔡承攸/男/復康聯盟黨"
670184 "侯陸太/男/無"
670185 "魏耀乾/男/無"
670202 "郭國文/男/民主進步黨"
670273 "詹秋嫻/女/人民最大黨"
670284 "陳昆和/男/無"
670301 "姚正玉/女/中國國民黨"
670302 "陳亭妃/女/民主進步黨"
670402 "林宜瑾/女/民主進步黨"
670477 "劉清田/男/司法改革黨"
670484 "李全教/男/無"
670502 "林俊憲/男/民主進步黨"
670572 "蕭燐洪/男/臺灣雙語無法黨"
670601 "陳以信/男/中國國民黨"
670602 "王定宇/男/民主進步黨"
670684 "陳永和/男/無"
640102 "邱議瑩/女/民主進步黨"
640141 "曾尹儷/女/台灣民眾黨"
640173 "劉承智/男/人民最大黨"
640184 "林義迪/男/無"
640201 "曹桓榮/男/中國國民黨"
640202 "邱志偉/男/民主進步黨"
640301 "李眉蓁/女/中國國民黨"
640302 "李柏毅/男/民主進步黨"
640376 "郭璽/男/台灣麻將最大黨"
640384 "張正達/男/無"
640385 "陳銓霖/男/無"
640401 "陳若翠/女/中國國民黨"
640402 "林岱樺/女/民主進步黨"
640501 "黃柏霖/男/中國國民黨"
640502 "李昆澤/男/民主進步黨"
640579 "張芳愉/女/小民參政歐巴桑聯盟"
640584 "楊椒喬/男/無"
640601 "陳美雅/女/中國國民黨"
640602 "黃捷/女/民主進步黨"
640644 "郭倍宏/男/喜樂島聯盟"
640701 "鍾易仲/男/中國國民黨"
640702 "許智傑/男/民主進步黨"
640777 "王和平統一/男/司法改革黨"
640784 "洪啟修/男/無"
640801 "李明璇/女/中國國民黨"
640802 "賴瑞隆/男/民主進步黨"
640813 "湛秀英/女/勞動黨"
640877 "李政憲/男/司法改革黨"
040101 "徐欣瑩/女/中國國民黨"
040102 "詹紀緹/女/民主進步黨"
040109 "余筱菁/女/台灣綠黨"
040142 "劉復嵐/男/台灣維新"
040179 "劉台穠/女/小民參政歐巴桑聯盟"
040201 "林思銘/男/中國國民黨"
040202 "曾聖凱/男/民主進步黨"
040219 "王婉諭/女/時代力量"
050102 "康世明/男/民主進步黨"
050184 "陳超明/男/無"
050201 "邱鎮軍/男/中國國民黨"
050284 "曾玟學/男/無"
070101 "阮厚爵/男/中國國民黨"
070102 "陳秀寶/女/民主進步黨"
070184 "蘇群傑/男/無"
070201 "楊曜聰/男/中國國民黨"
070202 "黃秀芳/女/民主進步黨"
070301 "謝衣鳳/女/中國國民黨"
070302 "吳音寧/女/民主進步黨"
070325 "桂麗娜/女/中華統一促進黨"
070384 "洪建興/男/無"
070401 "鄭俊雄/男/中國國民黨"
070402 "陳素月/女/民主進步黨"
070471 "鄭錫懋/男/臺灣雙語無法黨"
070482 "蔡念諶/男/中華文化共和黨"
080101 "馬文君/女/中國國民黨"
080102 "蔡銘軒/男/民主進步黨"
080113 "許文忠/男/勞動黨"
080179 "李圓恩/女/小民參政歐巴桑聯盟"
080184 "林金潭/男/無"
080201 "游顥/男/中國國民黨"
080202 "蔡培慧/女/民主進步黨"
080284 "陳癸佑/男/無"
090101 "丁學忠/男/中國國民黨"
090102 "蘇治芬/女/民主進步黨"
090125 "郭炳宏/男/中華統一促進黨"
090170 "李昭儀/女/台灣革命黨"
090184 "吳炳輝/男/無"
090185 "陳俊龍/男/無"
090201 "邱良閱/男/中國國民黨"
090202 "劉建國/男/民主進步黨"
100101 "詹琬蓁/女/中國國民黨"
100102 "蔡易餘/男/民主進步黨"
100202 "陳冠廷/男/民主進步黨"
100242 "黃一哲/男/台灣維新"
100275 "簡銘傑/男/制度救世島"
100284 "林國慶/男/無"
100285 "廖昱婧/女/無"
130101 "黃明賢/男/中國國民黨"
130102 "鍾佳濱/男/民主進步黨"
130125 "李孟翰/男/中華統一促進黨"
130142 "張庭源/男/台灣維新"
130184 "蔣月惠/女/無"
130185 "曾鈺庭/男/無"
130202 "徐富癸/男/民主進步黨"
130256 "吳媚宮/女/中華聯合黨"
130273 "何秋葺/女/人民最大黨"
130284 "蘇孟淳/男/無"
020101 "黃琤婷/女/中國國民黨"
020102 "陳俊宇/男/民主進步黨"
020117 "林意評/男/台灣基進"
020141 "陳琬惠/女/台灣民眾黨"
020175 "邱介勳/男/制度救世島"
020184 "林錦坤/男/無"
150101 "傅崑萁/男/中國國民黨"
150102 "張美慧/女/民主進步黨"
150175 "周玉梅/女/制度救世島"
150184 "許願神/男/無"
140101 "黃建賓/男/中國國民黨"
140102 "賴坤成/男/民主進步黨"
140179 "黃婉茹/女/小民參政歐巴桑聯盟"
140184 "許瑞貴/男/無"
140185 "劉櫂豪/男/無"
140186 "陳長宏/男/無"
160101 "吳政杰/男/中國國民黨"
160102 "楊曜/男/民主進步黨"
160184 "陳慧娟/女/無"
280101 "陳玉珍/女/中國國民黨"
280141 "尚文凱/女/台灣民眾黨"
280184 "洪和成/男/無"
290101 "陳雪生/男/中國國民黨"
290102 "李問/男/民主進步黨"
290141 "曹爾凱/男/台灣民眾黨"
170101 "林沛祥/男/中國國民黨"
170102 "鄭文婷/女/民主進步黨"
170179 "謝海菁/女/小民參政歐巴桑聯盟"
170181 "邱紹祐/男/家庭基本收入"
170183 "黃傑陽/男/無"
170185 "王醒之/男/無"
180101 "鄭正鈐/男/中國國民黨"
180102 "林志潔/女/民主進步黨"
180119 "邱顯智/男/時代力量"
180175 "趙福龍/男/制度救世島"
180177 "楊清華/男/司法改革黨"
180184 "柯美蘭/女/無"
180185 "王榮德/男/無"
200101 "張秀華/女/中國國民黨"
200102 "王美惠/女/民主進步黨"
200171 "林智勳/男/臺灣雙語無法黨"
200179 "陳玥妗/女/小民參政歐巴桑聯盟"
200180 "蔡松益/男/復康聯盟黨"
200184 "簡明廉/男/無"
690101 "黃仁/男/中國國民黨"
690102 "鄭天財 Sra-Kacaw/男/中國國民黨"
690103 "陳瑩/女/民主進步黨"
690104 "米甘幹-理佛克/男/新黨"
690107 "陳國榮/男/台灣維新"
690109 "陳政宗/男/無"
690110 "忠仁-達祿斯/男/無"
690111 "高美珠/女/無"
690112 "吳建智咖啡哥/男/無"
700101 "孔文吉/男/中國國民黨"
700102 "盧縣一/男/中國國民黨"
700103 "伍麗華 Saidhai-Tahovecahe/女/民主進步黨"
700106 "胡黃廣文/男/台灣民眾黨"
700108 "高畹芯/女/司法改革黨"
700109 "張子孝/男/無"
700110 "高金素梅/女/無"
700111 "林果/女/無"
700112 "林世偉/男/無"
700113 "李我要單列族名我的布農族名字是Savungaz Valincinan/女/無"
999991 "原本不想投"
999992 "都不是"
999995 "拒答"
999999 "跳題".

fre pporiwvc.


*建立選區原先想投對象（以政黨歸類）pporiwvp.
compute PPoriwvp=PPoriwvc.
recode pporiwvp (630101 630201 630301 630401 630501 630601 630701 630801 650101 650301 650401 650501 650601 650701 650801 650901 651001 651101
               651201 680101 680201 680301 680401 680501 680601 660201 660301 660401 660501 660601 660701 660801 670101 670301 670601 640201 
               640301 640401 640501 640601 640701 640801 040101 040201 050201 070101 070201 070301 070401 080101 080201 090101 090201 100101
               130101 020101 150101 140101 160101 280101 290101 170101 180101 200101 690101 690102 700101 700102=01)
              (630102 630202 630302 630402 630502 630702 630802 650102 650202 650302 650402 650502 650602 650702 650802 650902 651002 651102
               651202 680102 680202 680302 680402 680502 660102 660202 660302 660402 660502 660602 660702 660802 670102 670202 670302 670402 
               670502 670602 640102 640202 640302 640402 640502 640602 640702 640802 040102 040202 050102 070102 070202 070302 070402 080102
               080202 090102 090202 100102 100202 130102 130202 020102 150102 140102 160102 290102 170102 180102 200102 690103 700103=02)
              (680303 690104=03)
              (040109=09)
              (640813 080113=13)
              (630417 020117=17)
              (040219 180119=19)
              (630624=24)
              (630225 650125 650225 680225 660525 660625 670125 070325 090125 130125=25)
              (630538=38)
              (630841 650241 650841 680541 680641 660141 640141 020141 280141 290141 700106=41)
              (630342 630642 630742 630842 650142 650942 651242 040142 100242 130142 690107=42)
              (640644=44)
              (630148=48)
              (651152=52)
              (630753=53)
              (130256=56)
              (630459=59)
              (660261=61)
              (630867=67)
              (090170=70)
              (630171 630371 630671 651271 660471 660571 070471 200171 660472 670572=71)
              (630173 630174 630273 630373 651073 651173 680673 670273 640173 130273=73)
              (630275 630375 630475 630675 650175 650475 651175 680375 100275 020175 150175 180175=75)
              (630576 640376=76)
              (630577 650677 680577 660377 660577 660777 670477 640777 640877 180177 700108=77)
              (630578=78)
              (630879 650779 680379 660579 640579 040179 080179 140179 170179 200179=79)
              (651080 680680 670180 200180=80)
              (680481=81)
              (070482=82)
              (170183 170181=83)
              (630184 630185 630384 630584 630585 630586 630587 630784 630884 630885 650384 650385 650484 650485 651184 651284 651285 680184
               680284 680484 680684 680685 660184 660185 660284 660485 660584 660585 660684 660685 670184 670185 670284 670484 670684 640184 
               640384 640385 640584 640784 050184 050284 070184 070384 080184 080284 090184 090185 100284 100285 130184 130285 130284 020184 
               150184 140184 140185 140186 160184 280184 170185 180184 180185 200184 690109 690110 690111 690112 700109 700110 700111 700112=84)
              (999991=91) (999992=92)(999995=95)(999999=99) .    

var lab pporiwvp "區域原先想投對象(政黨)" .
val lab pporiwvp  01 "國民黨"             02 "民進黨"          03 "新黨"               09 "台灣綠黨"         13 "勞動黨"
                17 "台灣基進"           19 "時代力量"        24 "社會民主黨"         25 "中華統一促進黨"   38 "合一行動聯盟"
                41 "台灣民眾黨"         42 "台灣維新"        44 "喜樂島聯盟"         48 "人民民主黨"       52 "中華婦女黨"
                53 "中華愛國同心黨"     56 "中華聯合黨"      59 "台灣整復師聯盟工黨" 61 "司法正義黨"       67 "興中同盟會"
                70 "台灣革命黨"         71 "臺灣雙語無法黨"  73 "人民最大黨"         75 "制度救世島"       76 "台灣麻將最大黨"  
                77 "司法改革黨"         78 "經濟黨"          79 "小民參政歐巴桑聯盟" 80 "復康聯盟黨"       81 "台灣國民黨"      
                82 "中華文化共和黨"     83 "家庭基本收入"    84 "無黨籍"
               91"原本不想投"            92 "都不是"                95"拒答"           99 "跳題". 

fre pporiwvp.


var lab WPA "Panel權值".

*加權.
SAVE TRANSLATE OUTFILE=='D:\加權程式\w.csv'
  /TYPE=XLS /VERSION=8 /MAP /REPLACE /FIELDNAMES
  /CELLS=VALUES
  /keep=psex page pedu  parear .

NPAR TEST/CHI SEX(1,2)/EXP=9417691,9837551
NPAR TEST/CHI AGE(1,5)/EXP=2913399,3239128,3814862,3525054,5762799
NPAR TEST/CHI EDU(1,5)/EXP=2113303,2204427,5294759,2211276,7431477
NPAR TEST/CHI AREAR(1,7)/EXP=3979193,1761995,3109581,3740402,2763230,3075855,824986.


weigh by WPA.
fre all.

*panel.
recode PRESULT(0=1)(else=0) into Panel.
var lab panel"選後追蹤".
val lab panel 0"追蹤失敗"1"追蹤成功".
fre panel.


